----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\User\Documents\GitHub\797b-problem-sets\DDCG_Replication\JL_replication_
> final_real.log
  log type:  text
 opened on:   4 Dec 2020, 19:46:19

. do "C:\Users\User\AppData\Local\Temp\STD1c0_000000.tmp"

. //                      797B JesÃºs Lara                 ///
. ///     Critical Replication and extension of   ///
> ///DDCG by Acemoglu, Naidu, Restrepo & Robinson (2018) ///
> 
. clear all

. 
. global home "C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication"

. global tables "$home/tables"

. global figures "$home/figures"

. global auxdata "$home/auxdata"

. global numbers "$home/numbers"

. cd $home
C:\Users\User\Documents\GitHub\797b-problem-sets\DDCG_Replication

. use DDCGdata_final, clear

. xtset wbcode2 year
       panel variable:  wbcode2 (strongly balanced)
        time variable:  year, 1960 to 2010
                delta:  1 unit

. 
. 
. 
. *******PART 1****************************
. ****************************************
. ****************************************
. *******PART 1****************************
. ****************************************
. ****************************************
. ****************************************
. ****** PART 1***************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 1***************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 1*************************
. ****************************************
. ****************************************
. xtset wbcode2 year
       panel variable:  wbcode2 (strongly balanced)
        time variable:  year, 1960 to 2010
                delta:  1 unit

. 
. /// Program to calculate LR effect of democracy 
> 
. capture program drop dynamiceffects

.                 program define dynamiceffects, eclass
  1.                 quietly: nlcom (effect1: _b[democracy]) ///
>                           (democracy: _b[democracy]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post
  2. 
.                 quietly: nlcom (effect2: _b[effect1]*_b[lag1]+_b[democracy]) ///
>                           (effect1: _b[effect1]) ///
>                           (democracy: _b[democracy]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post
  3. 
.                 quietly: nlcom (effect3: _b[effect2]*_b[lag1]+_b[effect1]*_b[lag2]+_b[democr
> acy]) ///
>                           (effect2: _b[effect2]) ///
>                           (effect1: _b[effect1]) ///
>                           (democracy: _b[democracy]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post
  4.                           
.                 quietly: nlcom (effect4: _b[effect3]*_b[lag1]+_b[effect2]*_b[lag2]+_b[effect
> 1]*_b[lag3]+_b[democracy]) ///
>                           (effect3: _b[effect3]) ///
>                           (effect2: _b[effect2]) ///
>                           (effect1: _b[effect1]) ///
>                           (democracy: _b[democracy]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post          
  5.                 
.                 forvalues j=5(1)25{       
  6.                 local j1=`j'-1
  7.                 local j2=`j'-2
  8.                 local j3=`j'-3
  9.                 local j4=`j'-4
 10. 
.                 quietly: nlcom (effect`j': _b[effect`j1']*_b[lag1]+_b[effect`j2']*_b[lag2]+_
> b[effect`j3']*_b[lag3]+_b[effect`j4']*_b[lag4]+_b[democracy]) ///
>                           (effect`j1': _b[effect`j1']) ///
>                           (effect`j2': _b[effect`j2']) ///
>                           (effect`j3': _b[effect`j3']) ///
>                           (democracy: _b[democracy]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post                  
 11. 
.                 }
 12. 
.                 quietly: nlcom (effect25: _b[effect25]) ///
>                           (longrun: _b[democracy]/(1-_b[lag1]-_b[lag2]-_b[lag3]-_b[lag4])) /
> //
>                           (democracy: _b[democracy]) ///
>                           (persistence: _b[lag1]+_b[lag2]+_b[lag3]+_b[lag4]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post
 13.                 ereturn display
 14.                 end

. 
. /// Replication of table 2
> /////////////////////////////
> 
. quietly{

. 
. esttab T2_1 T2_2 T2_3 using "$tables/Table2.tex", keep(dem  L.y  L2.y  L3.y  L4.y) varlabels
> (dem "Democracy" L.y "Log GDP, first lag" L2.y "Log GDP, second lag" L3.y "Log GDP, third la
> g" L4.y "Log GDP, fourth lag") fragment nonum noobs nonotes mlabels("(1)" "(2)" "(3)") b(3) 
> se ty replace nostar  wrap gaps

            &         (1)&         (2)&         (3)\\
\hline
Democracy   &       0.973&       0.651&       0.787\\
            &     (0.294)&     (0.248)&     (0.226)\\
Log GDP,    &       0.973&       1.266&       1.238\\
first lag   &     (0.006)&     (0.038)&     (0.038)\\
Log GDP,    &            &      -0.300&      -0.207\\
second lag  &            &     (0.037)&     (0.046)\\
Log GDP,    &            &            &      -0.026\\
third lag   &            &            &     (0.028)\\
Log GDP,    &            &            &      -0.043\\
fourth lag  &            &            &     (0.017)\\
(output written to C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/Ta
> ble2.tex)

. 
. esttab T2_1a T2_2a T2_3a using "$tables/Table2.tex", varlabels (longrun "Long-run effect of 
> democracy" persistence "Persistence") fragment noobs nonum nonotes  b(3) se ty append nostar
>  nomtitles nolines wrap gaps

[1em]
Long-run    &      35.587&      19.599&      21.240\\
effect of democracy&    (13.998)&     (8.595)&     (7.215)\\
Persistence &       0.973&       0.967&       0.963\\
            &     (0.006)&     (0.005)&     (0.005)\\
(output written to C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/Ta
> ble2.tex)

. 
. esttab T2_1aa T2_2aa T2_3aa using "$tables/Table2.tex", keep(effect25) varlabels(effect25 "E
> ffect of democracy: 25 years") fragment noobs nonum nonotes  b(3) se ty append nostar nomtit
> les nolines wrap gaps

[1em]
Effect of   &      17.791&      13.800&      16.895\\
democracy: 25 years&     (5.649)&     (5.550)&     (5.297)\\
(output written to C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/Ta
> ble2.tex)

. 
. ////////////////////////
> /// UNIT ROOTS TESTS ///
> ////////////////////////
> capture program drop unitroot

. program define unitroot, rclass
  1. syntax anything[, lags(integer 3) varalt mumain(real -.53796) sigmamain(real .85408)]
  2.         local 0 `anything' 
  3.         gettoken yvar 0 : 0
  4.         gettoken excov 0 : 0, match(par) 
  5.         gettoken bpvar 0 : 0, match(par) 
  6.         
. quietly: if `lags'>=1{
  7. reg d.`yvar' l(1/`lags').d.`yvar' yy* i.wbcode2 `excov'
  8. }
  9. quietly: if `lags'==0{
 10. reg d.`yvar' yy* i.wbcode2 `excov'
 11. }
 12. quietly: predict e if e(sample), resid
 13. 
. if `lags'==0{
 14. return scalar SA=1
 15. local SA=1
 16. }
 17. if `lags'==1{
 18. return scalar SA=1/abs(1-(_b[LD.`yvar']))
 19. local SA=1/abs(1-(_b[LD.`yvar']))
 20. }
 21. if `lags'==2{
 22. return scalar SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']))
 23. local  SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']))
 24. }
 25. if `lags'==3{
 26. return scalar SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']+_b[L3D.`yvar']))
 27. local SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']+_b[L3D.`yvar']))
 28. }
 29. if `lags'==4{
 30. return scalar SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']+_b[L3D.`yvar']+_b[L4D.`yvar']))
 31. local SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']+_b[L3D.`yvar']+_b[L4D.`yvar']))
 32. }
 33. 
. quietly: if `lags'>=1{
 34. reg l.`yvar' l(1/`lags').d.`yvar' yy* i.wbcode2 `excov'
 35. }
 36. quietly: if `lags'==0{
 37. reg l.`yvar'  yy* i.wbcode2 `excov'
 38. }
 39. quietly: predict v if e(sample), resid
 40. 
. quietly: if `lags'>=1{
 41. reg d.`yvar' l.`yvar' l(1/`lags').d.`yvar' yy* i.wbcode2
 42. }
 43. quietly: if `lags'==0{
 44. reg d.`yvar' l.`yvar' yy* i.wbcode2
 45. }
 46. quietly: predict residual if e(sample), resid
 47. quietly: gen res2=residual^2
 48. quietly: bysort wbcode2: egen vari=mean(res2)
 49. quietly: gen sigmai=sqrt(vari)
 50. 
. quietly: gen e_est=e/sigmai
 51. quietly: gen v_est=v/sigmai
 52. 
. quietly: reg e_est v_est, noconstant
 53. return scalar tdelta=_b[v_est]/_se[v_est]
 54. return scalar stddelta=_se[v_est]
 55. local tdelta=_b[v_est]/_se[v_est]
 56. local stddelta=_se[v_est]
 57. 
. quietly: predict z if e(sample), resid
 58. quietly: gen z2=z^2
 59. quietly: sum z2
 60. return scalar sigma2=r(mean)
 61. return scalar num=r(N)
 62. local sigma2=r(mean)
 63. local num=r(N)
 64. 
. local tadjmain=(`tdelta'-`num'*`SA'*`stddelta'*`mumain'/`sigma2')/`sigmamain'
 65. return scalar pvalmain=normal(`tadjmain')
 66. return scalar  tadjmain=(`tdelta'-`num'*`SA'*`stddelta'*`mumain'/`sigma2')/`sigmamain'
 67. 
. drop e v residual res2 vari sigmai e_est v_est z z2
 68. end

. 
. foreach i of numlist 0 1 3{
  2. 
. unitroot y (dem) (), lags(`i')
  3. local t`i'lag= r(tadjmain)
  4. local t`i'lagc: display %9.2f `t`i'lag' 
  5. 
. file open myfile using ${numbers}/t`i'lagc.tex, ///
>  write text replace 
  6. file write myfile "`t`i'lagc'" 
  7. file close myfile
  8. 
. }

. 
. foreach i of numlist 0 1 3{
  2. 
. unitroot y (dem) (), lags(`i')
  3. local p`i'lag= r(pvalmain)
  4. local p`i'lagc: display %9.2f `p`i'lag' 
  5. 
. file open myfile using ${numbers}/p`i'lagc.tex, ///
>  write text replace 
  6. file write myfile "`p`i'lagc'" 
  7. file close myfile
  8. }

. 
. ///////////////////////////////
> // Replication of table 5/////
. //////////////////////////////
> 
. // Generate Treatment democracy variable td
. 
. use DDCGdata_final, clear

. gen tdemoc=.  
(9,384 missing values generated)

. replace tdemoc=1 if dem==1 & l.dem==0 // captures the exact moment when a country transition
> s to democracy
(122 real changes made)

. replace tdemoc=0 if dem==0 & l.dem==0  // countries that have never been a democracy
(4,768 real changes made)

. // 4 lags in GDP. These will be covariates in our regression
. forvalues i=1/4{
  2. gen lag`i'y=l`i'.y
  3. }
(2,405 missing values generated)
(2,578 missing values generated)
(2,752 missing values generated)
(2,927 missing values generated)

. keep if lag1y!=. & lag2y!=. & lag3y!=. & lag4y!=.
(2,930 observations deleted)

. 
. // 15 lags (15 years previous dem)
. forvalues i=0/15{
  2. local k =15-`i'
  3. gen ydep`i'=L`k'.y-L.y
  4. }
(2,594 missing values generated)
(2,426 missing values generated)
(2,257 missing values generated)
(2,087 missing values generated)
(1,916 missing values generated)
(1,745 missing values generated)
(1,572 missing values generated)
(1,399 missing values generated)
(1,225 missing values generated)
(1,050 missing values generated)
(875 missing values generated)
(700 missing values generated)
(525 missing values generated)
(350 missing values generated)
(175 missing values generated)
(186 missing values generated)

. 
. // 30 leads
. forvalues i=16/45{
  2. local k=`i'-15
  3. gen ydep`i'=F`k'.y-L.y
  4. }
(361 missing values generated)
(536 missing values generated)
(711 missing values generated)
(886 missing values generated)
(1,061 missing values generated)
(1,235 missing values generated)
(1,408 missing values generated)
(1,581 missing values generated)
(1,753 missing values generated)
(1,924 missing values generated)
(2,095 missing values generated)
(2,265 missing values generated)
(2,434 missing values generated)
(2,602 missing values generated)
(2,769 missing values generated)
(2,933 missing values generated)
(3,085 missing values generated)
(3,236 missing values generated)
(3,385 missing values generated)
(3,531 missing values generated)
(3,675 missing values generated)
(3,816 missing values generated)
(3,954 missing values generated)
(4,092 missing values generated)
(4,227 missing values generated)
(4,357 missing values generated)
(4,477 missing values generated)
(4,596 missing values generated)
(4,714 missing values generated)
(4,828 missing values generated)

. 
. order country_name tdemoc year y ydep*

. keep if tdemoc!=.
(3,418 observations deleted)

. // tdemoc is missing value if country is democracy and was democracy the period before
. // We will have only observations of: nondemocracy and exact transition (including reversals
> )
. 
. 
. set seed 12345                       

. 
. ////////////////////////
> // CREATE PROGRAMS/////
. ///////////////////////
> 
. /////////////////////////////
> /// A. REGRESSION ADJUSTMENT PROGRAM
> capture program ra, eclass

. ////////////
> ////////////
> 
. // B. PSR PROGRAM/////
. //////////////////////
> capture program psr, eclass

. 
. //////////////////////////
> //C. DOUBLY ROBUST PROGRAM
. //////////////////////////
> 
. capture program drop dr

. program dr, eclass
  1. /* year -15 */
. quietly: gen temp=tdemoc if ydep0!=. &tdemoc!=.
  2. quietly: bysort year: egen mtemp=max(temp)
  3. quietly: tab year if mtemp==1, gen(dumyears)
  4. cap: teffects ipwra (ydep0 lag1y lag2y lag3y lag4y dumyears*, noconstant) (tdemoc lag1y l
> ag2y lag3y lag4y dumyears*, probit), atet iterate(7)
  5. if _rc==0{
  6. matrix b=_b[ATET: r1vs0.tdemoc]
  7. }
  8. else{
  9. matrix b=(.)
 10. }
 11. quietly: drop dumyears* temp mtemp
 12. /* years -14 to -5 */
. forvalues s=1(1)10{
 13. quietly: gen temp=tdemoc if ydep`s'!=. &tdemoc!=.
 14. quietly: bysort year: egen mtemp=max(temp)
 15. quietly: tab year if mtemp==1, gen(dumyears)
 16. cap: teffects ipwra (ydep`s' lag1y lag2y lag3y lag4y dumyears*, noconstant) (tdemoc lag1y
>  lag2y lag3y lag4y dumyears*, probit), atet iterate(7)
 17. if _rc==0{
 18. matrix b=(b, _b[ATET: r1vs0.tdemoc])
 19. }
 20. else{
 21. matrix b=(b, .)
 22. }
 23. quietly: drop dumyears* temp mtemp
 24. }
 25. /*  years -4, -3, -2, -1  */
. matrix b=(b, 0, 0, 0, 0)
 26. /* year 0 to 30 */
. forvalues s=15(1)45{
 27. quietly: gen temp=tdemoc if ydep`s'!=. &tdemoc!=.
 28. quietly: bysort year: egen mtemp=max(temp)
 29. quietly: tab year if mtemp==1, gen(dumyears)
 30. cap: teffects ipwra (ydep`s' lag1y lag2y lag3y lag4y dumyears*, noconstant) (tdemoc lag1y
>  lag2y lag3y lag4y dumyears*, probit), atet iterate(7)
 31. if _rc==0{
 32. matrix b=(b, _b[ATET: r1vs0.tdemoc])
 33. }
 34. else{
 35. matrix b=(b, .)
 36. }
 37. quietly: drop dumyears* temp mtemp
 38. }
 39. ereturn post b
 40. end

. 
. //////////////////
> ////ESTIMATION ///
> //////////////////
> set seed 12345

. //// A. Adjustment regression 
> xtset, clear

. bootstrap _b, reps(20) cluster(wbcode2): ra 
(running ra on estimation sample)

Warning:  Because ra is not an estimation command or does not set e(sample), bootstrap has
          no way to determine which observations are used in calculating the statistics and
          so assumes that all observations are used.  This means that no observations will
          be excluded from the resampling because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the
          observations that are to be excluded.  Be sure that the dataset in memory contains
          only the relevant data.

Bootstrap replications (20)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
....................

Bootstrap results                               Number of obs     =      3,036
                                                Replications      =         20

                               (Replications based on 126 clusters in wbcode2)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          c1 |  -1.208078   3.921871    -0.31   0.758    -8.894803    6.478648
          c2 |  -3.049757   3.701891    -0.82   0.410    -10.30533    4.205816
          c3 |  -2.150273   3.627301    -0.59   0.553    -9.259652    4.959106
          c4 |   -1.97831   3.866623    -0.51   0.609    -9.556753    5.600132
          c5 |  -2.776327    3.70813    -0.75   0.454    -10.04413    4.491475
          c6 |  -3.338203   3.327435    -1.00   0.316    -9.859855     3.18345
          c7 |  -1.807659   2.885049    -0.63   0.531    -7.462251    3.846932
          c8 |  -1.862079   2.322572    -0.80   0.423    -6.414237    2.690078
          c9 |  -1.662993   1.691257    -0.98   0.325    -4.977796    1.651811
         c10 |  -.9274664   1.161995    -0.80   0.425    -3.204935    1.350003
         c11 |    .300876   .7897657     0.38   0.703    -1.247036    1.848788
         c12 |          0  (omitted)
         c13 |          0  (omitted)
         c14 |          0  (omitted)
         c15 |          0  (omitted)
         c16 |   .3777393   .7358853     0.51   0.608    -1.064569    1.820048
         c17 |    2.07734   1.328555     1.56   0.118    -.5265801    4.681261
         c18 |   2.868402   2.042439     1.40   0.160    -1.134706    6.871509
         c19 |   3.456062   2.488447     1.39   0.165    -1.421205    8.333329
         c20 |   3.491263   2.579247     1.35   0.176    -1.563968    8.546495
         c21 |   3.262353   2.659932     1.23   0.220    -1.951018    8.475724
         c22 |    3.46428   2.958152     1.17   0.242     -2.33359    9.262151
         c23 |   3.270084   3.237135     1.01   0.312    -3.074585    9.614752
         c24 |    3.36042   3.586432     0.94   0.349    -3.668859     10.3897
         c25 |     4.7467   3.669438     1.29   0.196    -2.445266    11.93867
         c26 |   5.014282   4.096077     1.22   0.221     -3.01388    13.04244
         c27 |   7.002995   4.531279     1.55   0.122     -1.87815    15.88414
         c28 |   8.368105   4.860687     1.72   0.085    -1.158667    17.89488
         c29 |   8.461492   5.160911     1.64   0.101    -1.653708    18.57669
         c30 |   10.18277   5.587624     1.82   0.068    -.7687676    21.13432
         c31 |    12.3585   5.300016     2.33   0.020     1.970658    22.74634
         c32 |   10.65862   5.786623     1.84   0.065    -.6829546    22.00019
         c33 |   14.73963   6.333776     2.33   0.020     2.325654     27.1536
         c34 |   16.14008   6.075308     2.66   0.008     4.232698    28.04747
         c35 |   16.28586   6.564325     2.48   0.013     3.420021     29.1517
         c36 |   18.95624   7.913895     2.40   0.017     3.445296    34.46719
         c37 |   24.93348   7.892423     3.16   0.002     9.464619    40.40235
         c38 |   25.40744   8.122826     3.13   0.002     9.486989    41.32788
         c39 |   25.61797   8.612535     2.97   0.003     8.737715    42.49823
         c40 |   25.45834   8.578745     2.97   0.003      8.64431    42.27237
         c41 |   23.58824    8.64853     2.73   0.006     6.637434    40.53905
         c42 |   22.02303   7.950259     2.77   0.006     6.440808    37.60525
         c43 |   21.10831   8.564835     2.46   0.014     4.321542    37.89508
         c44 |   19.76782   8.553387     2.31   0.021     3.003487    36.53215
         c45 |   20.06104   10.29143     1.95   0.051    -.1097939    40.23188
         c46 |   19.54404   10.18456     1.92   0.055    -.4173356    39.50541
------------------------------------------------------------------------------

. parmest, format(estimate min95 max95) saving("$auxdata/ra", replace)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/ra.dta saved

. eststo main_ra

. // Get 5 year averages
. nlcom (ra: (_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5), post

          ra:  (_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ra |   .0601752   .1579531     0.38   0.703    -.2494073    .3697576
------------------------------------------------------------------------------

. eststo ra1

. 
. estimates restore main_ra
(results main_ra are active now)

. nlcom (ra: (_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5), post

          ra:  (_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ra |   2.454161   1.749341     1.40   0.161    -.9744845    5.882807
------------------------------------------------------------------------------

. eststo ra2 

. 
. estimates restore main_ra
(results main_ra are active now)

. nlcom (ra: (_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5), post

          ra:  (_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ra |   3.620767   3.182696     1.14   0.255    -2.617202    9.858736
------------------------------------------------------------------------------

. eststo ra3 

. 
. estimates restore main_ra
(results main_ra are active now)

. nlcom (ra: (_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5), post

          ra:  (_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ra |    7.80593   4.780116     1.63   0.102    -1.562926    17.17479
------------------------------------------------------------------------------

. eststo ra4 

. 
. estimates restore main_ra
(results main_ra are active now)

. nlcom (ra: (_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5), post

          ra:  (_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ra |   14.03654   5.805075     2.42   0.016       2.6588    25.41428
------------------------------------------------------------------------------

. eststo ra5 

. 
. estimates restore main_ra
(results main_ra are active now)

. nlcom (ra: (_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5), post

          ra:  (_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ra |    24.0747   8.090437     2.98   0.003     8.217729    39.93166
------------------------------------------------------------------------------

. eststo ra6

. 
. estimates restore main_ra
(results main_ra are active now)

. nlcom (ra:  (_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5), post

          ra:  (_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ra |   21.30969   8.607325     2.48   0.013     4.439641    38.17973
------------------------------------------------------------------------------

. eststo ra7 

. 
. esttab ra* using "$tables/T5_ra.tex", replace varlabels (ra "Avg. effect on log GDP") fragme
> nt nostar nonum nonotes se nomtitles nolines wrap gaps ty  noobs b(3)

[1em]
Avg. effect &       0.060&       2.454&       3.621&       7.806&      14.037&      24.075&   
>    21.310\\
on log GDP  &     (0.158)&     (1.749)&     (3.183)&     (4.780)&     (5.805)&     (8.090)&   
>   (8.607)\\
(output written to C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/T5
> _ra.tex)

. 
. /// B. Inverse propensity score reweighting
> set seed 12345

. xtset, clear

. bootstrap _b, reps(20) cluster(wbcode2): psr
(running psr on estimation sample)

Warning:  Because psr is not an estimation command or does not set e(sample), bootstrap has
          no way to determine which observations are used in calculating the statistics and
          so assumes that all observations are used.  This means that no observations will
          be excluded from the resampling because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the
          observations that are to be excluded.  Be sure that the dataset in memory contains
          only the relevant data.

Bootstrap replications (20)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
....................

Bootstrap results                               Number of obs     =      3,036
                                                Replications      =         20

                               (Replications based on 126 clusters in wbcode2)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          c1 |  -5.348826   6.957534    -0.77   0.442    -18.98534    8.287691
          c2 |  -6.863527   6.795896    -1.01   0.313    -20.18324    6.456184
          c3 |  -5.011499   5.790955    -0.87   0.387    -16.36156    6.338564
          c4 |  -4.715084    5.62822    -0.84   0.402    -15.74619    6.316024
          c5 |  -5.692406   5.236376    -1.09   0.277    -15.95552    4.570703
          c6 |  -6.355406   5.221794    -1.22   0.224    -16.58993    3.879122
          c7 |  -5.020103   4.658915    -1.08   0.281    -14.15141    4.111202
          c8 |  -5.654936   4.347182    -1.30   0.193    -14.17526    2.865384
          c9 |  -5.386442   3.773977    -1.43   0.154     -12.7833    2.010417
         c10 |  -4.552659   3.229088    -1.41   0.159    -10.88155    1.776236
         c11 |  -3.090007   2.868372    -1.08   0.281    -8.711914    2.531899
         c12 |   -2.38014   2.057285    -1.16   0.247    -6.412345    1.652066
         c13 |  -1.743328   1.475667    -1.18   0.237    -4.635582    1.148927
         c14 |  -.7173139   .7389088    -0.97   0.332    -2.165549    .7309207
         c15 |          0  (omitted)
         c16 |   1.003326   1.007593     1.00   0.319    -.9715197    2.978172
         c17 |   3.326791    1.90196     1.75   0.080    -.4009813    7.054564
         c18 |   4.472569   3.037681     1.47   0.141    -1.481176    10.42631
         c19 |    4.97614   3.640061     1.37   0.172    -2.158248    12.11053
         c20 |   4.841104   3.643861     1.33   0.184    -2.300733    11.98294
         c21 |   3.844462   3.193471     1.20   0.229    -2.414627    10.10355
         c22 |   3.190795   3.042384     1.05   0.294    -2.772168    9.153758
         c23 |    2.64792   3.298414     0.80   0.422    -3.816853    9.112693
         c24 |   2.530603   3.557393     0.71   0.477     -4.44176    9.502966
         c25 |   3.854172   3.767691     1.02   0.306    -3.530367    11.23871
         c26 |   4.165231   4.164518     1.00   0.317    -3.997075    12.32754
         c27 |   6.218378   4.744879     1.31   0.190    -3.081415    15.51817
         c28 |   7.567457   5.157749     1.47   0.142    -2.541545    17.67646
         c29 |   7.390154   5.548273     1.33   0.183    -3.484261    18.26457
         c30 |   8.747839   6.066104     1.44   0.149    -3.141506    20.63718
         c31 |   10.77317   5.767627     1.87   0.062    -.5311671    22.07751
         c32 |   9.283862    6.14067     1.51   0.131    -2.751629    21.31935
         c33 |   14.66367   6.280235     2.33   0.020     2.354632     26.9727
         c34 |   16.61314    5.86549     2.83   0.005     5.116985    28.10929
         c35 |   16.37579   6.301282     2.60   0.009     4.025502    28.72607
         c36 |   18.56237   7.289245     2.55   0.011     4.275712    32.84903
         c37 |   24.44331   7.838867     3.12   0.002     9.079413    39.80721
         c38 |   25.21325   8.127783     3.10   0.002     9.283093    41.14342
         c39 |   26.21248   8.487525     3.09   0.002     9.577237    42.84772
         c40 |   26.12366   8.525615     3.06   0.002     9.413764    42.83356
         c41 |   24.07292   8.628571     2.79   0.005     7.161235    40.98461
         c42 |   22.73674   8.374572     2.71   0.007     6.322884     39.1506
         c43 |    22.1219   9.325655     2.37   0.018     3.843954    40.39985
         c44 |   21.00047   9.085111     2.31   0.021     3.193977    38.80696
         c45 |   20.98716   11.11615     1.89   0.059     -.800102    42.77442
         c46 |   20.65125   10.91969     1.89   0.059    -.7509427    42.05345
------------------------------------------------------------------------------

. parmest, format(estimate min95 max95) saving("$auxdata/psr", replace)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/psr.dta saved

. eststo main_psr 

. // Get 5 year averages
. nlcom (psr: (_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5), post

         psr:  (_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         psr |  -1.586158   1.386032    -1.14   0.252     -4.30273    1.130415
------------------------------------------------------------------------------

. eststo psr1

. 
. estimates restore main_psr 
(results main_psr are active now)

. nlcom (psr: (_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5), post

         psr:  (_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         psr |   3.723986   2.562663     1.45   0.146    -1.298741    8.746713
------------------------------------------------------------------------------

. eststo psr2 

. 
. estimates restore main_psr 
(results main_psr are active now)

. nlcom (psr: (_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5), post

         psr:  (_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         psr |    3.21359   3.242289     0.99   0.322    -3.141179     9.56836
------------------------------------------------------------------------------

. eststo psr3 

. 
. estimates restore main_psr 
(results main_psr are active now)

. nlcom (psr: (_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5), post

         psr:  (_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         psr |   6.817812   5.045401     1.35   0.177    -3.070992    16.70662
------------------------------------------------------------------------------

. eststo psr4 

. 
. estimates restore main_psr 
(results main_psr are active now)

. nlcom (psr: (_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5), post

         psr:  (_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         psr |   13.54193    5.80524     2.33   0.020     2.163864    24.91999
------------------------------------------------------------------------------

. eststo psr5 

. 
. estimates restore main_psr 
(results main_psr are active now)

. nlcom (psr: (_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5), post

         psr:  (_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         psr |   24.11102    7.93388     3.04   0.002     8.560897    39.66113
------------------------------------------------------------------------------

. eststo psr6

. 
. estimates restore main_psr 
(results main_psr are active now)

. nlcom (psr:  (_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5), post

         psr:  (_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         psr |   22.18384    9.00913     2.46   0.014     4.526268    39.84141
------------------------------------------------------------------------------

. eststo psr7 

. 
. esttab psr* using "$tables/T5_psr.tex", replace varlabels (psr "Avg. effect on log GDP") fra
> gment nostar nonum nonotes se nomtitles nolines wrap gaps ty  noobs b(3)

[1em]
Avg. effect &      -1.586&       3.724&       3.214&       6.818&      13.542&      24.111&   
>    22.184\\
on log GDP  &     (1.386)&     (2.563)&     (3.242)&     (5.045)&     (5.805)&     (7.934)&   
>   (9.009)\\
(output written to C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/T5
> _psr.tex)

. 
. 
. // C. Doubly robust estimator
. set seed 12345

. xtset, clear

. bootstrap _b, reps(20) cluster(wbcode2): dr
(running dr on estimation sample)

Warning:  Because dr is not an estimation command or does not set e(sample), bootstrap has
          no way to determine which observations are used in calculating the statistics and
          so assumes that all observations are used.  This means that no observations will
          be excluded from the resampling because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the
          observations that are to be excluded.  Be sure that the dataset in memory contains
          only the relevant data.

Bootstrap replications (20)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
...............x....

Bootstrap results                               Number of obs     =      3,036
                                                Replications      =         19

                               (Replications based on 126 clusters in wbcode2)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          c1 |  -.5753906   4.566806    -0.13   0.900    -9.526166    8.375384
          c2 |  -2.418304   4.494032    -0.54   0.590    -11.22644    6.389837
          c3 |  -1.609369   4.262421    -0.38   0.706    -9.963562    6.744823
          c4 |   -1.44989   4.463632    -0.32   0.745    -10.19845    7.298668
          c5 |  -2.355892   4.126154    -0.57   0.568      -10.443    5.731222
          c6 |  -3.082545   3.864453    -0.80   0.425    -10.65673    4.491643
          c7 |  -1.714901   3.310996    -0.52   0.604    -8.204334    4.774531
          c8 |  -1.741191   2.721311    -0.64   0.522    -7.074863     3.59248
          c9 |  -1.574023   1.993341    -0.79   0.430    -5.480899    2.332853
         c10 |  -.9388879   1.314374    -0.71   0.475    -3.515014    1.637238
         c11 |   .2532907   .7902464     0.32   0.749    -1.295564    1.802145
         c12 |          0  (omitted)
         c13 |          0  (omitted)
         c14 |          0  (omitted)
         c15 |          0  (omitted)
         c16 |    .541812   .8014397     0.68   0.499    -1.028981    2.112605
         c17 |   2.482011   1.451941     1.71   0.087    -.3637416    5.327763
         c18 |   3.390913   2.329625     1.46   0.146    -1.175068    7.956895
         c19 |    3.85488    2.80505     1.37   0.169    -1.642917    9.352676
         c20 |   3.707369   2.837028     1.31   0.191    -1.853103    9.267841
         c21 |   3.097665   2.853818     1.09   0.278    -2.495716    8.691047
         c22 |   2.813484   2.997821     0.94   0.348    -3.062138    8.689105
         c23 |   2.498123   3.282466     0.76   0.447    -3.935393    8.931639
         c24 |   2.519032   3.416194     0.74   0.461    -4.176584    9.214648
         c25 |   3.916411   3.675784     1.07   0.287    -3.287994    11.12082
         c26 |   4.274925   4.015849     1.06   0.287    -3.595995    12.14584
         c27 |   6.301885   4.413229     1.43   0.153    -2.347885    14.95165
         c28 |   7.675004    4.80317     1.60   0.110    -1.739037    17.08905
         c29 |   7.580508   5.129633     1.48   0.139    -2.473389     17.6344
         c30 |   8.996041   5.479047     1.64   0.101    -1.742694    19.73478
         c31 |   10.84074   5.462169     1.98   0.047     .1350881     21.5464
         c32 |   9.308498   5.828025     1.60   0.110    -2.114222    20.73122
         c33 |   13.65817   6.275696     2.18   0.030     1.358035    25.95831
         c34 |   15.45666   5.860752     2.64   0.008     3.969793    26.94352
         c35 |   15.46903   6.327283     2.44   0.014     3.067785    27.87028
         c36 |   18.29679   7.354561     2.49   0.013     3.882117    32.71147
         c37 |   24.31254   7.923377     3.07   0.002     8.783009    39.84208
         c38 |   25.00711   8.239149     3.04   0.002     8.858675    41.15555
         c39 |   25.43126   8.697681     2.92   0.003     8.384115     42.4784
         c40 |   25.40845   8.807764     2.88   0.004     8.145546    42.67135
         c41 |   23.46804   8.936778     2.63   0.009     5.952279    40.98381
         c42 |   22.40911   8.598645     2.61   0.009     5.556075    39.26214
         c43 |    21.6798   9.474566     2.29   0.022     3.109989    40.24961
         c44 |    20.8553   9.483805     2.20   0.028     2.267387    39.44322
         c45 |   20.55028   11.40521     1.80   0.072    -1.803535    42.90409
         c46 |   20.14815   11.02708     1.83   0.068    -1.464523    41.76082
------------------------------------------------------------------------------
Note: One or more parameters could not be estimated in 1 bootstrap replicate;
      standard-error estimates include only complete replications.

. parmest, format(estimate min95 max95) saving("$auxdata/dr", replace)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/dr.dta saved

. eststo main_dr 

. // Get 5 year averages
. nlcom (dr: (_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5), post

          dr:  (_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          dr |   .0506581   .1580493     0.32   0.749    -.2591128     .360429
------------------------------------------------------------------------------

. eststo dr1

. 
. estimates restore main_dr 
(results main_dr are active now)

. nlcom (dr: (_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5), post

          dr:  (_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          dr |   2.795397   1.969428     1.42   0.156    -1.064612    6.655406
------------------------------------------------------------------------------

. eststo dr2 

. 
. estimates restore main_dr 
(results main_dr are active now)

. nlcom (dr: (_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5), post

          dr:  (_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          dr |   2.968943   3.183015     0.93   0.351    -3.269653    9.207539
------------------------------------------------------------------------------

. eststo dr3 

. 
. estimates restore main_dr 
(results main_dr are active now)

. nlcom (dr: (_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5), post

          dr:  (_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          dr |   6.965672   4.685456     1.49   0.137    -2.217653      16.149
------------------------------------------------------------------------------

. eststo dr4 

. 
. estimates restore main_dr 
(results main_dr are active now)

. nlcom (dr: (_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5), post

          dr:  (_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          dr |   12.94662    5.76088     2.25   0.025     1.655503    24.23774
------------------------------------------------------------------------------

. eststo dr5 

. 
. estimates restore main_dr 
(results main_dr are active now)

. nlcom (dr: (_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5), post

          dr:  (_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          dr |   23.69123   8.083226     2.93   0.003     7.848397    39.53406
------------------------------------------------------------------------------

. eststo dr6

. 
. estimates restore main_dr 
(results main_dr are active now)

. nlcom (dr:  (_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5), post

          dr:  (_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          dr |   21.79251    9.27206     2.35   0.019     3.619602    39.96541
------------------------------------------------------------------------------

. eststo dr7 

. 
. esttab dr* using "$tables/T5_dr.tex", replace varlabels (dr "Avg. effect on log GDP") fragme
> nt nostar nonum nonotes se nomtitles nolines wrap ty  noobs b(3)

[1em]
Avg. effect &       0.051&       2.795&       2.969&       6.966&      12.947&      23.691&   
>    21.793\\
on log GDP  &     (0.158)&     (1.969)&     (3.183)&     (4.685)&     (5.761)&     (8.083)&   
>   (9.272)\\
(output written to C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/T5
> _dr.tex)

. 
. 
. */
. *******PART 2****************************
. ****************************************
. ****************************************
. *******PART 2****************************
. ****************************************
. ****************************************
. ****************************************
. ****** PART 2***************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 2***************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 2*************************
. ****************************************
. ****************************************
. 
. 
. /// Now it is correct
> 
. use DDCGdata_final, clear

. gen tdemoc=.  
(9,384 missing values generated)

. replace tdemoc=1 if dem==1 & l.dem==0 // captures the exact moment when a country transition
> s to democracy
(122 real changes made)

. replace tdemoc=0 if dem==0 & l.dem==0 
(4,768 real changes made)

. 
. forvalues i=1/4{
  2. gen lag`i'y=l`i'.y
  3. }
(2,405 missing values generated)
(2,578 missing values generated)
(2,752 missing values generated)
(2,927 missing values generated)

. 
. forvalues i=0/15{
  2. local k =15-`i'
  3. gen ydep`i'=L`k'.y-L.y
  4. }
(4,846 missing values generated)
(4,675 missing values generated)
(4,502 missing values generated)
(4,329 missing values generated)
(4,155 missing values generated)
(3,980 missing values generated)
(3,805 missing values generated)
(3,630 missing values generated)
(3,455 missing values generated)
(3,280 missing values generated)
(3,105 missing values generated)
(2,930 missing values generated)
(2,755 missing values generated)
(2,580 missing values generated)
(2,405 missing values generated)
(2,416 missing values generated)

. 
. forvalues i=16/45{
  2. local k=`i'-15
  3. gen ydep`i'=F`k'.y-L.y
  4. }
(2,591 missing values generated)
(2,766 missing values generated)
(2,941 missing values generated)
(3,116 missing values generated)
(3,291 missing values generated)
(3,466 missing values generated)
(3,641 missing values generated)
(3,816 missing values generated)
(3,991 missing values generated)
(4,165 missing values generated)
(4,338 missing values generated)
(4,511 missing values generated)
(4,683 missing values generated)
(4,854 missing values generated)
(5,025 missing values generated)
(5,195 missing values generated)
(5,364 missing values generated)
(5,532 missing values generated)
(5,699 missing values generated)
(5,863 missing values generated)
(6,015 missing values generated)
(6,166 missing values generated)
(6,315 missing values generated)
(6,461 missing values generated)
(6,605 missing values generated)
(6,746 missing values generated)
(6,884 missing values generated)
(7,022 missing values generated)
(7,157 missing values generated)
(7,287 missing values generated)

. order country_name tdemoc year y ydep*

. keep if tdemoc!=.
(4,494 observations deleted)

. 
. // Controlling for 4 GDP lags
. forvalues s=0/45{
  2. quiet reg ydep`s' tdemoc  lag*, cluster(wbcode2)
  3. if `s'==0{
  4. mat ests=(_b[tdemoc], r(table)[5,1],r(table)[6,1])
  5. }
  6. else{
  7. mat ests=ests\(_b[tdemoc], r(table)[5,1],r(table)[6,1])
  8. mat colnames ests="b" "ll" "ul"
  9. }
 10. }

. 
. 
. svmat ests

. 
. cap drop yad

. gen yad=. 
(4,890 missing values generated)

. forvalues i=0/45{
  2. local k=`i'-14
  3. local j=`i'+1
  4. replace yad=`k' in `j'
  5. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. line ests1 yad, lcolor(black) scheme(s1color) xtitle(Years around democratization) ytitle(Ch
> ange in GDP per capita log points) yline(0, lcolor(black) lpattern(dash))||line ests2 yad,  
> lcolor(gray) lpattern(dash)||line ests3 yad,  lcolor(gray) lpattern(dash) legend(off)

. graph export "$figures/part2a.png", as(png) replace
(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part2a.png wri
> tten in PNG format)

. 
. /// No lags
> forvalues s=0/45{
  2. quiet reg ydep`s' tdemoc, cluster(wbcode2)
  3. if `s'==0{
  4. mat ests=(_b[tdemoc], r(table)[5,1],r(table)[6,1])
  5. }
  6. else{
  7. mat ests=ests\(_b[tdemoc], r(table)[5,1],r(table)[6,1])
  8. mat colnames ests="b" "ll" "ul"
  9. }
 10. }

. 
. drop ests*

. svmat ests

. cap drop yad

. gen yad=. 
(4,890 missing values generated)

. forvalues i=0/45{
  2. local k=`i'-14
  3. local j=`i'+1
  4. replace yad=`k' in `j'
  5. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. line ests1 yad, lcolor(black) scheme(s1color) xtitle(Years around democratization) ytitle(Ch
> ange in GDP per capita log points) yline(0, lcolor(black) lpattern(dash))||line ests2 yad,  
> lcolor(gray) lpattern(dash)||line ests3 yad,  lcolor(gray) lpattern(dash) legend(off) ylabel
> (#6) 

. graph export "$figures/part2b.png", as(png) replace
(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part2b.png wri
> tten in PNG format)

. 
. 
. *******PART 3****************************
. ****************************************
. ****************************************
. *******PART 3****************************
. ****************************************
. ****************************************
. ****************************************
. ****** PART 3***************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 3***************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 3*************************
. ****************************************
. ****************************************
. 
. 
. /// Replicate the figures
> 
. * Â¯\_(ã)_/Â¯
. 
. 
. foreach type in psr dr{
  2. 
. use "$auxdata/`type'.dta",clear
  3. 
. gen event=.
  4. 
. forvalues i=1/46{
  5. local k=`i'-16
  6. replace event=`k' in `i'
  7. }
  8. 
. line estimate event, lcolor(black) || line min95 event, lcolor(gray) lpattern(dash) || line 
> max95 event, lcolor(gray) lpattern(dash) ytitle(Change in GDP per capita log points) xlabel(
> #10) xtitle(Years around democratization) scheme(s1color) legend(off) yline(0, lpattern(dash
> ))
  9. graph export  "$figures/part3`type'.png", replace
 10. }
(46 missing values generated)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part3psr.png w
> ritten in PNG format)
(46 missing values generated)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part3dr.png wr
> itten in PNG format)

. 
. *******PART 4****************************
. ****************************************
. ****************************************
. *******PART 4****************************
. ****************************************
. ****************************************
. ****************************************
. ****** PART 4***************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 4***************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 4*************************
. ****************************************
. ****************************************
. 
. use ${home}/DDCGdata_final, clear

. 
. // The code below identifies treated units (countries that transitioned to democracy with no
>  reversals) and the clean controls associated to each treated unit (countries that did not h
> ave a transition before t0 and at least 20 year after)
. // We will use tunit for part 6, so it will assign a missing value to all countries which ex
> perienced a kind of transition 
. // Â¯\_(ã)_/Â¯
. 
. egen countrynum= group(country_name)

. gen tdemoc=.
(9,384 missing values generated)

. replace tdemoc=1 if dem==1 & l.dem==0
(122 real changes made)

. order tdemoc countrynum year

. gen tunit=.
(9,384 missing values generated)

. quiet su countrynum 

. local mincountry=r(min)

. local maxcountry=r(max)

. 
. 
. forvalues i=`mincountry'/`maxcountry'{
  2. quiet  su year if countrynum==`i' & tdemoc==1
  3. if r(N)==1{
  4. di `i'
  5. di "Only one transition to democracy"
  6. local t0=r(mean)
  7. quiet su dem if year >=`t0' & countrynum==`i'
  8. if r(min)==r(max) { // 1992 
  9. di " `i' is treated unit, democratized in `t0'"
 10. quietly replace tunit=1 if countrynum==`i'
 11. 
. //Event i
. gen event_`i'_=.
 12. // Prepare dependent variables for regressions. 
. 
. forvalues j=`mincountry'/`maxcountry'{
 13. if `j'==`i'{
 14. quietly replace event_`i'_=0 if year<`t0' & countrynum==`j'
 15. quietly replace event_`i'_=1 if year==`t0' & countrynum==`j'
 16. }
 17. 
. else{
 18. local t20= `t0'+20
 19. quietly su dem if countrynum==`j' & year <=`t20'
 20. if r(max)==0{
 21. 
. // di "`j' is a clean control of `i'"
. quietly replace event_`i'_=0 if countrynum==`j'
 22. }
 23. else{
 24. quietly replace event_`i'_=. if countrynum==`j'
 25. }
 26. }
 27. }
 28. }
 29. else{
 30. di "Experienced a reversal"
 31. //quietly replace tunit=. if countrynum==`i'
. }
 32. }
 33. 
. else {
 34. di "`i' had more than one transition to democracy"
 35. //quietly replace tunit=. if countrynum==`i'
. }
 36. }
1 had more than one transition to democracy
2 had more than one transition to democracy
3 had more than one transition to democracy
4 had more than one transition to democracy
5 had more than one transition to democracy
6 had more than one transition to democracy
7 had more than one transition to democracy
8 had more than one transition to democracy
9 had more than one transition to democracy
10
Only one transition to democracy
Experienced a reversal
11 had more than one transition to democracy
12 had more than one transition to democracy
13 had more than one transition to democracy
14 had more than one transition to democracy
15
Only one transition to democracy
Experienced a reversal
16 had more than one transition to democracy
17 had more than one transition to democracy
18
Only one transition to democracy
 18 is treated unit, democratized in 1991
(9,384 missing values generated)
19
Only one transition to democracy
 19 is treated unit, democratized in 2008
(9,384 missing values generated)
20
Only one transition to democracy
 20 is treated unit, democratized in 1982
(9,384 missing values generated)
21 had more than one transition to democracy
22 had more than one transition to democracy
23
Only one transition to democracy
 23 is treated unit, democratized in 1985
(9,384 missing values generated)
24 had more than one transition to democracy
25
Only one transition to democracy
 25 is treated unit, democratized in 1991
(9,384 missing values generated)
26
Only one transition to democracy
Experienced a reversal
27
Only one transition to democracy
 27 is treated unit, democratized in 2003
(9,384 missing values generated)
28
Only one transition to democracy
Experienced a reversal
29 had more than one transition to democracy
30 had more than one transition to democracy
31
Only one transition to democracy
 31 is treated unit, democratized in 1991
(9,384 missing values generated)
32
Only one transition to democracy
Experienced a reversal
33 had more than one transition to democracy
34
Only one transition to democracy
 34 is treated unit, democratized in 1990
(9,384 missing values generated)
35 had more than one transition to democracy
36 had more than one transition to democracy
37 had more than one transition to democracy
38 had more than one transition to democracy
39
Only one transition to democracy
Experienced a reversal
40 had more than one transition to democracy
41
Only one transition to democracy
 41 is treated unit, democratized in 2000
(9,384 missing values generated)
42 had more than one transition to democracy
43
Only one transition to democracy
 43 is treated unit, democratized in 1974
(9,384 missing values generated)
44
Only one transition to democracy
 44 is treated unit, democratized in 1993
(9,384 missing values generated)
45
Only one transition to democracy
Experienced a reversal
46 had more than one transition to democracy
47
Only one transition to democracy
Experienced a reversal
48 had more than one transition to democracy
49
Only one transition to democracy
 49 is treated unit, democratized in 1978
(9,384 missing values generated)
50
Only one transition to democracy
 50 is treated unit, democratized in 1979
(9,384 missing values generated)
51 had more than one transition to democracy
52
Only one transition to democracy
 52 is treated unit, democratized in 1982
(9,384 missing values generated)
53 had more than one transition to democracy
54 had more than one transition to democracy
55
Only one transition to democracy
 55 is treated unit, democratized in 1992
(9,384 missing values generated)
56
Only one transition to democracy
Experienced a reversal
57
Only one transition to democracy
Experienced a reversal
58 had more than one transition to democracy
59 had more than one transition to democracy
60 had more than one transition to democracy
61 had more than one transition to democracy
62
Only one transition to democracy
 62 is treated unit, democratized in 1995
(9,384 missing values generated)
63 had more than one transition to democracy
64 had more than one transition to democracy
65
Only one transition to democracy
 65 is treated unit, democratized in 1975
(9,384 missing values generated)
66
Only one transition to democracy
 66 is treated unit, democratized in 1984
(9,384 missing values generated)
67 had more than one transition to democracy
68
Only one transition to democracy
 68 is treated unit, democratized in 2010
(9,384 missing values generated)
69 had more than one transition to democracy
70
Only one transition to democracy
 70 is treated unit, democratized in 1992
(9,384 missing values generated)
71 had more than one transition to democracy
72
Only one transition to democracy
 72 is treated unit, democratized in 1982
(9,384 missing values generated)
73
Only one transition to democracy
 73 is treated unit, democratized in 1990
(9,384 missing values generated)
74 had more than one transition to democracy
75 had more than one transition to democracy
76
Only one transition to democracy
 76 is treated unit, democratized in 1999
(9,384 missing values generated)
77 had more than one transition to democracy
78 had more than one transition to democracy
79 had more than one transition to democracy
80 had more than one transition to democracy
81 had more than one transition to democracy
82 had more than one transition to democracy
83 had more than one transition to democracy
84 had more than one transition to democracy
85 had more than one transition to democracy
86
Only one transition to democracy
 86 is treated unit, democratized in 2002
(9,384 missing values generated)
87 had more than one transition to democracy
88
Only one transition to democracy
 88 is treated unit, democratized in 1988
(9,384 missing values generated)
89 had more than one transition to democracy
90 had more than one transition to democracy
91 had more than one transition to democracy
92
Only one transition to democracy
 92 is treated unit, democratized in 1993
(9,384 missing values generated)
93
Only one transition to democracy
 93 is treated unit, democratized in 2005
(9,384 missing values generated)
94 had more than one transition to democracy
95
Only one transition to democracy
 95 is treated unit, democratized in 2004
(9,384 missing values generated)
96 had more than one transition to democracy
97
Only one transition to democracy
 97 is treated unit, democratized in 1993
(9,384 missing values generated)
98 had more than one transition to democracy
99
Only one transition to democracy
 99 is treated unit, democratized in 1991
(9,384 missing values generated)
100
Only one transition to democracy
Experienced a reversal
101
Only one transition to democracy
 101 is treated unit, democratized in 1994
(9,384 missing values generated)
102 had more than one transition to democracy
103 had more than one transition to democracy
104
Only one transition to democracy
 104 is treated unit, democratized in 1992
(9,384 missing values generated)
105 had more than one transition to democracy
106
Only one transition to democracy
Experienced a reversal
107 had more than one transition to democracy
108
Only one transition to democracy
 108 is treated unit, democratized in 1997
(9,384 missing values generated)
109
Only one transition to democracy
 109 is treated unit, democratized in 1994
(9,384 missing values generated)
110
Only one transition to democracy
 110 is treated unit, democratized in 1993
(9,384 missing values generated)
111 had more than one transition to democracy
112
Only one transition to democracy
 112 is treated unit, democratized in 1994
(9,384 missing values generated)
113 had more than one transition to democracy
114 had more than one transition to democracy
115 had more than one transition to democracy
116 had more than one transition to democracy
117 had more than one transition to democracy
118 had more than one transition to democracy
119
Only one transition to democracy
 119 is treated unit, democratized in 1990
(9,384 missing values generated)
120 had more than one transition to democracy
121 had more than one transition to democracy
122 had more than one transition to democracy
123 had more than one transition to democracy
124 had more than one transition to democracy
125 had more than one transition to democracy
126 had more than one transition to democracy
127
Only one transition to democracy
 127 is treated unit, democratized in 1994
(9,384 missing values generated)
128 had more than one transition to democracy
129
Only one transition to democracy
 129 is treated unit, democratized in 1993
(9,384 missing values generated)
130 had more than one transition to democracy
131
Only one transition to democracy
 131 is treated unit, democratized in 1987
(9,384 missing values generated)
132
Only one transition to democracy
 132 is treated unit, democratized in 1990
(9,384 missing values generated)
133
Only one transition to democracy
 133 is treated unit, democratized in 1976
(9,384 missing values generated)
134 had more than one transition to democracy
135
Only one transition to democracy
 135 is treated unit, democratized in 1990
(9,384 missing values generated)
136
Only one transition to democracy
Experienced a reversal
137 had more than one transition to democracy
138 had more than one transition to democracy
139 had more than one transition to democracy
140
Only one transition to democracy
 140 is treated unit, democratized in 2000
(9,384 missing values generated)
141
Only one transition to democracy
 141 is treated unit, democratized in 2000
(9,384 missing values generated)
142 had more than one transition to democracy
143 had more than one transition to democracy
144 had more than one transition to democracy
145
Only one transition to democracy
 145 is treated unit, democratized in 1993
(9,384 missing values generated)
146
Only one transition to democracy
 146 is treated unit, democratized in 1992
(9,384 missing values generated)
147
Only one transition to democracy
 147 is treated unit, democratized in 2004
(9,384 missing values generated)
148 had more than one transition to democracy
149
Only one transition to democracy
 149 is treated unit, democratized in 1994
(9,384 missing values generated)
150
Only one transition to democracy
 150 is treated unit, democratized in 1978
(9,384 missing values generated)
151 had more than one transition to democracy
152 had more than one transition to democracy
153 had more than one transition to democracy
154 had more than one transition to democracy
155 had more than one transition to democracy
156 had more than one transition to democracy
157 had more than one transition to democracy
158 had more than one transition to democracy
159 had more than one transition to democracy
160 had more than one transition to democracy
161
Only one transition to democracy
 161 is treated unit, democratized in 1991
(9,384 missing values generated)
162
Only one transition to democracy
 162 is treated unit, democratized in 1992
(9,384 missing values generated)
163 had more than one transition to democracy
164 had more than one transition to democracy
165 had more than one transition to democracy
166 had more than one transition to democracy
167 had more than one transition to democracy
168 had more than one transition to democracy
169 had more than one transition to democracy
170 had more than one transition to democracy
171 had more than one transition to democracy
172
Only one transition to democracy
Experienced a reversal
173
Only one transition to democracy
 173 is treated unit, democratized in 1994
(9,384 missing values generated)
174 had more than one transition to democracy
175 had more than one transition to democracy
176 had more than one transition to democracy
177
Only one transition to democracy
 177 is treated unit, democratized in 1985
(9,384 missing values generated)
178 had more than one transition to democracy
179 had more than one transition to democracy
180 had more than one transition to democracy
181 had more than one transition to democracy
182 had more than one transition to democracy
183
Only one transition to democracy
 183 is treated unit, democratized in 1991
(9,384 missing values generated)
184
Only one transition to democracy
Experienced a reversal

. quietly replace tunit=0 if tunit==.

. 
. 
. 
. // Generate variables and prepare events datasets
. forvalues i=1/4{
  2. gen lag`i'y=l`i'.y
  3. }
(2,405 missing values generated)
(2,578 missing values generated)
(2,752 missing values generated)
(2,927 missing values generated)

. 
. // 15 lags (15 years previous dem)
. forvalues i=0/15{
  2. local k =15-`i'
  3. gen ydep`i'=L`k'.y-L.y
  4. }
(4,846 missing values generated)
(4,675 missing values generated)
(4,502 missing values generated)
(4,329 missing values generated)
(4,155 missing values generated)
(3,980 missing values generated)
(3,805 missing values generated)
(3,630 missing values generated)
(3,455 missing values generated)
(3,280 missing values generated)
(3,105 missing values generated)
(2,930 missing values generated)
(2,755 missing values generated)
(2,580 missing values generated)
(2,405 missing values generated)
(2,416 missing values generated)

. // 30 leads
. forvalues i=16/45{
  2. local k=`i'-15
  3. gen ydep`i'=F`k'.y-L.y
  4. }
(2,591 missing values generated)
(2,766 missing values generated)
(2,941 missing values generated)
(3,116 missing values generated)
(3,291 missing values generated)
(3,466 missing values generated)
(3,641 missing values generated)
(3,816 missing values generated)
(3,991 missing values generated)
(4,165 missing values generated)
(4,338 missing values generated)
(4,511 missing values generated)
(4,683 missing values generated)
(4,854 missing values generated)
(5,025 missing values generated)
(5,195 missing values generated)
(5,364 missing values generated)
(5,532 missing values generated)
(5,699 missing values generated)
(5,863 missing values generated)
(6,015 missing values generated)
(6,166 missing values generated)
(6,315 missing values generated)
(6,461 missing values generated)
(6,605 missing values generated)
(6,746 missing values generated)
(6,884 missing values generated)
(7,022 missing values generated)
(7,157 missing values generated)
(7,287 missing values generated)

. 
. save "DDCG_with_events.dta", replace
file DDCG_with_events.dta saved

. /// Save datasets
> 
. foreach var of varlist event_*{
  2. preserve 
  3. drop if `var'==.
  4. keep `var' ydep* country_name countrynum dem tdemoc lag* year y yy*
  5. order year countrynum country_name `var' tdemoc dem y ydep* lag* 
  6. quiet su year if `var'==1
  7. local t0=r(mean)
  8. keep if year==`t0'
  9. save "$auxdata/`var'.dta", replace
 10. restore
 11. }
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_18_.dta s
> aved
(7,040 observations deleted)
(2,298 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_19_.dta s
> aved
(6,760 observations deleted)
(2,572 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_20_.dta s
> aved
(6,910 observations deleted)
(2,425 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_23_.dta s
> aved
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_25_.dta s
> aved
(7,045 observations deleted)
(2,293 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_27_.dta s
> aved
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_31_.dta s
> aved
(7,058 observations deleted)
(2,280 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_34_.dta s
> aved
(7,048 observations deleted)
(2,290 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_41_.dta s
> aved
(6,258 observations deleted)
(3,064 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_43_.dta s
> aved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_44_.dta s
> aved
(6,407 observations deleted)
(2,918 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_49_.dta s
> aved
(6,508 observations deleted)
(2,819 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_50_.dta s
> aved
(6,760 observations deleted)
(2,572 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_52_.dta s
> aved
(7,056 observations deleted)
(2,282 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_55_.dta s
> aved
(7,053 observations deleted)
(2,285 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_62_.dta s
> aved
(6,359 observations deleted)
(2,965 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_65_.dta s
> aved
(6,860 observations deleted)
(2,474 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_66_.dta s
> aved
(7,038 observations deleted)
(2,300 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_68_.dta s
> aved
(7,056 observations deleted)
(2,282 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_70_.dta s
> aved
(6,760 observations deleted)
(2,572 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_72_.dta s
> aved
(7,058 observations deleted)
(2,280 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_73_.dta s
> aved
(7,049 observations deleted)
(2,289 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_76_.dta s
> aved
(7,046 observations deleted)
(2,292 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_86_.dta s
> aved
(7,009 observations deleted)
(2,328 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_88_.dta s
> aved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_92_.dta s
> aved
(7,043 observations deleted)
(2,295 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_93_.dta s
> aved
(7,044 observations deleted)
(2,294 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_95_.dta s
> aved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_97_.dta s
> aved
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_99_.dta s
> aved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_101_.dta 
> saved
(7,056 observations deleted)
(2,282 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_104_.dta 
> saved
(7,051 observations deleted)
(2,287 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_108_.dta 
> saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_109_.dta 
> saved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_110_.dta 
> saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_112_.dta 
> saved
(7,058 observations deleted)
(2,280 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_119_.dta 
> saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_127_.dta 
> saved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_129_.dta 
> saved
(6,959 observations deleted)
(2,377 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_131_.dta 
> saved
(7,058 observations deleted)
(2,280 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_132_.dta 
> saved
(6,358 observations deleted)
(2,966 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_133_.dta 
> saved
(7,058 observations deleted)
(2,280 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_135_.dta 
> saved
(7,048 observations deleted)
(2,290 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_140_.dta 
> saved
(7,048 observations deleted)
(2,290 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_141_.dta 
> saved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_145_.dta 
> saved
(7,056 observations deleted)
(2,282 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_146_.dta 
> saved
(7,044 observations deleted)
(2,294 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_147_.dta 
> saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_149_.dta 
> saved
(6,407 observations deleted)
(2,918 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_150_.dta 
> saved
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_161_.dta 
> saved
(7,056 observations deleted)
(2,282 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_162_.dta 
> saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_173_.dta 
> saved
(6,910 observations deleted)
(2,425 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_177_.dta 
> saved
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_183_.dta 
> saved

. 
. ********4(a)********
. ****** 4 (a) *******
. ********************
. ********************
. ********************
. ********************
. ********************
. *******4 (a)********
. ********************
. /// Proceed with estimation...
> 
. 
. use DDCG_with_events, clear 

. 
. *** 
. 
. // This one works. 
. foreach var of varlist event_*{
  2. use "$auxdata/`var'.dta",replace
  3. 
. forvalues s=30/34{
  4. quiet su ydep`s' if `var'==1
  5. di "`var'" `s' 
  6. di r(mean)
  7. 
. // Define first for the first event=18
. if "`var'"=="event_18_"{
  8. if r(mean)!=.{
  9. quiet reg ydep`s' `var' lag*, cluster(countrynum)
 10. mat b`s'=(_b[`var'])
 11. }
 12. else {
 13. mat b`s'=(.)
 14. }
 15. }
 16. else{
 17. if r(mean)!=.{
 18. quiet reg ydep`s' `var' lag*, cluster(countrynum)
 19. mat b`s'=b`s' \ (_b[`var'])
 20. }
 21. else{
 22. mat b`s'=b`s' \ (.)
 23. }
 24. }
 25. }
 26. }
event_18_30
19.82959
event_18_31
21.312927
event_18_32
23.330872
event_18_33
24.161377
event_18_34
24.272339
event_19_30
.
event_19_31
.
event_19_32
.
event_19_33
.
event_19_34
.
event_20_30
-5.4272461
event_20_31
-2.6363525
event_20_32
-4.2907104
event_20_33
-3.8623657
event_20_34
-4.2119751
event_23_30
15.831238
event_23_31
15.737305
event_23_32
17.006348
event_23_33
16.850159
event_23_34
21.179382
event_25_30
33.34906
event_25_31
40.063782
event_25_32
46.555115
event_25_33
41.401306
event_25_34
42.277466
event_27_30
.
event_27_31
.
event_27_32
.
event_27_33
.
event_27_34
.
event_31_30
69.602478
event_31_31
76.908325
event_31_32
82.025391
event_31_33
84.661316
event_31_34
89.043152
event_34_30
63.268921
event_34_31
66.737732
event_34_32
70.240967
event_34_33
72.866516
event_34_34
70.221375
event_41_30
.
event_41_31
.
event_41_32
.
event_41_33
.
event_41_34
.
event_43_30
.
event_43_31
.
event_43_32
.
event_43_33
.
event_43_34
.
event_44_30
47.71167
event_44_31
42.873169
event_44_32
44.880066
event_44_33
.
event_44_34
.
event_49_30
21.022461
event_49_31
21.431946
event_49_32
24.977966
event_49_33
30.132629
event_49_34
36.160156
event_50_30
1.6522217
event_50_31
1.5210571
event_50_32
2.1557617
event_50_33
4.5026855
event_50_34
5.029541
event_52_30
21.905273
event_52_31
24.920593
event_52_32
27.751526
event_52_33
29.388611
event_52_34
30.651367
event_55_30
73.813049
event_55_31
68.691162
event_55_32
53.756531
event_55_33
56.834229
event_55_34
.
event_62_30
100.28418
event_62_31
.
event_62_32
.
event_62_33
.
event_62_34
.
event_65_30
20.922363
event_65_31
23.001465
event_65_32
22.597778
event_65_33
20.066528
event_65_34
21.214172
event_66_30
68.654114
event_66_31
80.370422
event_66_32
76.174133
event_66_33
78.074341
event_66_34
85.944702
event_68_30
.
event_68_31
.
event_68_32
.
event_68_33
.
event_68_34
.
event_70_30
53.604675
event_70_31
55.38385
event_70_32
58.439819
event_70_33
61.713013
event_70_34
.
event_72_30
2.7963867
event_72_31
3.4970093
event_72_32
-.52062988
event_72_33
2.9886475
event_72_34
3.6201782
event_73_30
23.23407
event_73_31
27.212891
event_73_32
27.482483
event_73_33
28.547729
event_73_34
21.661804
event_76_30
.
event_76_31
.
event_76_32
.
event_76_33
.
event_76_34
.
event_86_30
.
event_86_31
.
event_86_32
.
event_86_33
.
event_86_34
.
event_88_30
83.912659
event_88_31
88.052795
event_88_32
91.727783
event_88_33
96.447021
event_88_34
101.09808
event_92_30
94.041199
event_92_31
74.749023
event_92_32
75.10968
event_92_33
.
event_92_34
.
event_93_30
.
event_93_31
.
event_93_32
.
event_93_33
.
event_93_34
.
event_95_30
.
event_95_31
.
event_95_32
.
event_95_33
.
event_95_34
.
event_97_30
64.022034
event_97_31
48.630798
event_97_32
51.535461
event_97_33
.
event_97_34
.
event_99_30
-3.2721558
event_99_31
2.4589233
event_99_32
7.0658569
event_99_33
5.9347534
event_99_34
7.5617676
event_101_30
22.738678
event_101_31
26.471222
event_101_32
.
event_101_33
.
event_101_34
.
event_104_30
32.232727
event_104_31
34.027344
event_104_32
35.365601
event_104_33
36.727539
event_104_34
.
event_108_30
.
event_108_31
.
event_108_32
.
event_108_33
.
event_108_34
.
event_109_30
-3.1886597
event_109_31
3.6281738
event_109_32
.
event_109_33
.
event_109_34
.
event_110_30
59.515564
event_110_31
56.595947
event_110_32
61.144775
event_110_33
.
event_110_34
.
event_112_30
71.520142
event_112_31
76.174683
event_112_32
.
event_112_33
.
event_112_34
.
event_119_30
19.042786
event_119_31
23.24762
event_119_32
26.717041
event_119_33
28.961487
event_119_34
24.350586
event_127_30
50.653076
event_127_31
53.792053
event_127_32
.
event_127_33
.
event_127_34
.
event_129_30
7.6054077
event_129_31
1.9066772
event_129_32
14.17041
event_129_33
.
event_129_34
.
event_131_30
17.147522
event_131_31
19.956116
event_131_32
24.462463
event_131_33
27.229919
event_131_34
30.521606
event_132_30
.
event_132_31
.
event_132_32
.
event_132_33
.
event_132_34
.
event_133_30
51.965515
event_133_31
53.02832
event_133_32
50.837158
event_133_33
51.582336
event_133_34
55.513367
event_135_30
11.636719
event_135_31
19.456299
event_135_32
25.47229
event_135_33
34.634399
event_135_34
25.905884
event_140_30
.
event_140_31
.
event_140_32
.
event_140_33
.
event_140_34
.
event_141_30
.
event_141_31
.
event_141_32
.
event_141_33
.
event_141_34
.
event_145_30
70.417786
event_145_31
65.161621
event_145_32
69.107239
event_145_33
.
event_145_34
.
event_146_30
56.370972
event_146_31
59.739136
event_146_32
50.488586
event_146_33
51.402222
event_146_34
.
event_147_30
.
event_147_31
.
event_147_32
.
event_147_33
.
event_147_34
.
event_149_30
24.019836
event_149_31
25.47821
event_149_32
.
event_149_33
.
event_149_34
.
event_150_30
27.534363
event_150_31
29.620544
event_150_32
32.10675
event_150_33
34.263794
event_150_34
37.795898
event_161_30
.
event_161_31
.
event_161_32
.
event_161_33
.
event_161_34
.
event_162_30
.
event_162_31
.
event_162_32
.
event_162_33
.
event_162_34
.
event_173_30
1.3059692
event_173_31
5.8167725
event_173_32
.
event_173_33
.
event_173_34
.
event_177_30
44.058533
event_177_31
39.911316
event_177_32
31.858826
event_177_33
32.811768
event_177_34
37.749512
event_183_30
-4.0062866
event_183_31
-.56188965
event_183_32
2.3102417
event_183_33
5.7747192
event_183_34
11.524353

. 
. 
. 
. forvalues s=30/34{
  2. local k=`s'-15
  3. svmat b`s'
  4. replace b`s'=. if b`s'==0 // If the coefficient is exactly=0 it is because of problems of
>  colinearity, idk why that happens 
  5. }
number of observations will be reset to 55
Press any key to continue, or Break to abort
number of observations (_N) was 46, now 55
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(2 real changes made, 2 to missing)
(1 real change made, 1 to missing)

. 
. egen average_b= rowmean(b*)
(20 missing values generated)

. 
. hist average_b, title (Effect of Democratization on Growth: Event Analysis) subtitle(Average
>  15-19 years after democratization) freq w(8) scheme(s1color) xtitle(Estimate) xlabel(#20) 
(bin=22, start=-39.102684, width=8)

. graph export "$figures/4a.png",replace
(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/4a.png written
>  in PNG format)

. 
. label var average_b "Average Effect 15-19 years"

. estpost su average_b,d

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~) 
-------------+-----------------------------------------------------------------------------
   average_b |        35         35   18.11395   1858.429    43.1095   .7680999   3.129425 

             |    e(sum)     e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25) 
-------------+-----------------------------------------------------------------------------
   average_b |  633.9882  -39.10268   130.2509  -39.10268  -36.54499  -33.89811  -15.72699 

             |    e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+-------------------------------------------------------
   average_b |  6.906044   50.35049   68.88967   118.6681   130.2509 

. eststo summary4a

. esttab summary4a using "$tables/summary4a.tex", ///
>      label noobs nonumbers nomtitles ty  booktabs replace        ///
>      cell((                                        ///
>             count(fmt(%9.0fc)  label(Obs.))        ///
>              mean(fmt(%10.2fc) label(Mean))        ///
>               p50(fmt(%8.1fc)  label(Median))      ///
>                sd(fmt(%10.2fc) label(Std. Dev.))   ///
>           )) ///
> title(Summary of Event-Estimates) 

\begin{table}[htbp]\centering
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\caption{Summary of Event-Estimates}
\begin{tabular}{l*{1}{cccc}}
\toprule
                    &        Obs.&        Mean&      Median&   Std. Dev.\\
\midrule
Average Effect 15-19 years&          35&       18.11&         6.9&       43.11\\
\bottomrule
\end{tabular}
\end{table}
(output written to C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/su
> mmary4a.tex)

. 
. ********4(b)********
. ****** 4 (b) *******
. ********************
. ********************
. ********************
. ********************
. ********************
. *******4 (b)********
. ********************
. 
. /*The basic  steps are described in Ferman and Pintoâs paper (p. 457-458), which is in our s
> yllabus Yes, youâre right itâs Figure D1, Iâll make that correction. You can use the populat
> ion of the country as the M, or can simply set M=1 for all countries for simplicity (in whic
> h case the estimates are basically like Conley and Taber and donât correct for heteroscedast
> icty). 
> 
> If you canât implement the FP SEs, at the minimum, show the distribution of estimates from t
> he events even if the standard errors arenât âcorrectâ  [make a note of that in your writeup
> .]*/
. use DDCG_with_events, clear 

. 
. foreach var of varlist event_*{
  2. di "`var'"
  3. use "$auxdata/`var'.dta", clear
  4. egen ydepmean= rowmean(ydep30 ydep31 ydep32 ydep33 ydep34)
  5. rename `var' treatment
  6. if "`var'"=="event_18_"{
  7. quiet reg ydepmean treatment lag*, cluster(countrynum)
  8. mat ests=(_b[treatment],r(table)[5,1],r(table)[6,1])
  9. }
 10. 
. 
. else{
 11. cap: quiet reg ydepmean treatment lag*, cluster(countrynum)
 12. if _rc==0{
 13. mat ests= ests \ (_b[treatment],r(table)[5,1],r(table)[6,1])
 14. }
 15. else{
 16. di "No observations"
 17. }
 18. }
 19. }
event_18_
(10 missing values generated)
event_19_
(46 missing values generated)
No observations
event_20_
(23 missing values generated)
event_23_
(19 missing values generated)
event_25_
(10 missing values generated)
event_27_
(46 missing values generated)
No observations
event_31_
(10 missing values generated)
event_34_
(12 missing values generated)
event_41_
(46 missing values generated)
No observations
event_43_
(33 missing values generated)
event_44_
(9 missing values generated)
event_49_
(29 missing values generated)
event_50_
(28 missing values generated)
event_52_
(23 missing values generated)
event_55_
(10 missing values generated)
event_62_
(12 missing values generated)
event_65_
(30 missing values generated)
event_66_
(22 missing values generated)
event_68_
(46 missing values generated)
No observations
event_70_
(10 missing values generated)
event_72_
(23 missing values generated)
event_73_
(12 missing values generated)
event_76_
(46 missing values generated)
No observations
event_86_
(46 missing values generated)
No observations
event_88_
(13 missing values generated)
event_92_
(9 missing values generated)
event_93_
(46 missing values generated)
No observations
event_95_
(46 missing values generated)
No observations
event_97_
(9 missing values generated)
event_99_
(10 missing values generated)
event_101_
(10 missing values generated)
event_104_
(10 missing values generated)
event_108_
(46 missing values generated)
No observations
event_109_
(10 missing values generated)
event_110_
(9 missing values generated)
event_112_
(10 missing values generated)
event_119_
(12 missing values generated)
event_127_
(10 missing values generated)
event_129_
(9 missing values generated)
event_131_
(15 missing values generated)
event_132_
(13 missing values generated)
event_133_
(29 missing values generated)
event_135_
(12 missing values generated)
event_140_
(46 missing values generated)
No observations
event_141_
(46 missing values generated)
No observations
event_145_
(9 missing values generated)
event_146_
(10 missing values generated)
event_147_
(46 missing values generated)
No observations
event_149_
(10 missing values generated)
event_150_
(29 missing values generated)
event_161_
(11 missing values generated)
event_162_
(11 missing values generated)
event_173_
(10 missing values generated)
event_177_
(19 missing values generated)
event_183_
(10 missing values generated)

. 
. 
. svmat ests 

. drop if ests2==. | ests3==.
(11 observations deleted)

. label var ests1 "Average Effect 15-19 years"

. sort ests1

. 
. gen evening=.
(35 missing values generated)

. forvalues i=1/35{
  2. replace evening=`i' in `i'
  3. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. twoway ///
> rbar ests2 ests3 evening , xline(0) scheme(s1color) horizontal color(gs12) ||  ///
> scatter evening  ests1 if ests2>0 | ests3<0, mcolor(blue) || ///
> scatter evening  ests1 if ests2<0 & ests3>0, mcolor(red) ///
> ytitle(Event) xtitle(Estimate 15-19 years) legend(label(1 "Lower/Upper 95%"  ) label(2 "Sign
> ificant") label(3 "Non-significant"))

. graph export "$figures/4b.png", replace
(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/4b.png written
>  in PNG format)

. 
. estpost su ests1, d

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~) 
-------------+-----------------------------------------------------------------------------
       ests1 |        35         35   17.90633   1851.763   43.03212   .7851936   3.184998 

             |    e(sum)     e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25) 
-------------+-----------------------------------------------------------------------------
       ests1 |  626.7215  -38.79275   130.7049  -38.79275  -36.18394  -34.88939  -16.00507 

             |    e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+-------------------------------------------------------
       ests1 |  7.803573   50.35049   68.88967   118.6681   130.7049 

. eststo summary4b

. 
.         
. esttab summary4b using "$tables/summary4b.tex", ///
>      label noobs nonumbers nomtitles ty  booktabs replace        ///
>      cell((                                        ///
>             count(fmt(%9.0fc)  label(Obs.))        ///
>              mean(fmt(%10.2fc) label(Mean))        ///
>               p50(fmt(%8.1fc)  label(Median))      ///
>                sd(fmt(%10.2fc) label(Std. Dev.))   ///
>           )) ///
> title(Summary of Event-Estimates) 

\begin{table}[htbp]\centering
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\caption{Summary of Event-Estimates}
\begin{tabular}{l*{1}{cccc}}
\toprule
                    &        Obs.&        Mean&      Median&   Std. Dev.\\
\midrule
Average Effect 15-19 years&          35&       17.91&         7.8&       43.03\\
\bottomrule
\end{tabular}
\end{table}
(output written to C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/su
> mmary4b.tex)

. 
. 
. 
. 
. **** Do Conley Taber Â¯\_(ã)_/Â¯
. 
. ****************
. ****** Conley Taber
. 
. // Prepare dataset, same than as the beginning of par 4 but keeping all years for treated co
> untries
. 
. ********4(c)********
. ********4 (c) *******
. ********************
. ********************
. ********************
. ********************
. ********************
. ********4 (c)********
. ********************
. 
. // Stack in wide format
. use DDCG_with_events, clear 

. 
. 
. // Generate FE
. foreach var of varlist event_*{
  2. use "$auxdata/`var'.dta", clear
  3. replace `var'=1 if `var'==0
  4. replace tdemoc=0 if tdemoc==.
  5. drop year
  6. sa "$auxdata/fe_`var'.dta", replace
  7. }
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_18_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_19_.dt
> a saved
(51 real changes made)
(51 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_20_.dt
> a saved
(48 real changes made)
(48 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_23_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_25_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_27_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_31_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_34_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_41_.dt
> a saved
(61 real changes made)
(61 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_43_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_44_.dt
> a saved
(58 real changes made)
(58 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_49_.dt
> a saved
(56 real changes made)
(56 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_50_.dt
> a saved
(51 real changes made)
(51 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_52_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_55_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_62_.dt
> a saved
(59 real changes made)
(59 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_65_.dt
> a saved
(49 real changes made)
(49 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_66_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_68_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_70_.dt
> a saved
(51 real changes made)
(51 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_72_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_73_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_76_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_86_.dt
> a saved
(46 real changes made)
(46 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_88_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_92_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_93_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_95_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_97_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_99_.dt
> a saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_101_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_104_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_108_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_109_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_110_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_112_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_119_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_127_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_129_.d
> ta saved
(47 real changes made)
(47 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_131_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_132_.d
> ta saved
(59 real changes made)
(59 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_133_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_135_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_140_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_141_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_145_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_146_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_147_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_149_.d
> ta saved
(58 real changes made)
(58 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_150_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_161_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_162_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_173_.d
> ta saved
(48 real changes made)
(48 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_177_.d
> ta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_183_.d
> ta saved

. 
. use DDCG_with_events, clear 

. foreach var of varlist event_*{
  2. 
. if "`var'"=="event_18_"{
  3. use "$auxdata/fe_`var'.dta", clear
  4. }
  5. else{
  6. append using "$auxdata/fe_`var'.dta"
  7. }
  8. }

. 
. foreach var of varlist event_*{
  2. replace `var'=0 if `var'==.
  3. }
(2,596 real changes made)
(2,596 real changes made)
(2,590 real changes made)
(2,593 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,580 real changes made)
(2,596 real changes made)
(2,583 real changes made)
(2,585 real changes made)
(2,590 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,582 real changes made)
(2,592 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,590 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,595 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,594 real changes made)
(2,596 real changes made)
(2,582 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,583 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,593 real changes made)
(2,596 real changes made)

. order event_*

. 
. capture program drop  fe_event 

. program fe_event, eclass 
  1. forvalues s=30/34{
  2. local k= `s'-29
  3. quiet reg ydep`s' tdemoc lag*  event_*, cluster (countrynum)
  4. di _b[tdemoc]
  5. est sto r`k'
  6. if `s'==30 {
  7. mat b=(_b[tdemoc])
  8. local v`k'=e(V)[1,1]
  9. } 
 10. else{
 11. mat b=(b, _b[tdemoc])
 12. local v`k'=e(V)[1,1]
 13. }
 14. }
 15. matrix V=J(5,5,1)
 16. matrix V[1,1]=`v1'
 17. matrix V[2,2]=`v2'
 18. matrix V[3,3]=`v3'
 19. matrix V[4,4]=`v4'
 20. matrix V[5,5]=`v5'
 21. matrix rownames V= "c1" "c2" "c3" "c4" "c5"
 22. mat list V
 23. mat list b
 24. 
. ereturn post b V
 25. *ereturn post V
. end

. 
. //bootstrap standard errors
. set seed 12345

. bootstrap _b: fe_event
(running fe_event on estimation sample)

Warning:  Because fe_event is not an estimation command or does not set e(sample), bootstrap
          has no way to determine which observations are used in calculating the statistics
          and so assumes that all observations are used.  This means that no observations
          will be excluded from the resampling because of missing values or other reasons.

          If the assumption is not true, press Break, save the data, and drop the
          observations that are to be excluded.  Be sure that the dataset in memory contains
          only the relevant data.

Bootstrap replications (50)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50

Bootstrap results                               Number of obs     =      2,642
                                                Replications      =         50

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          c1 |   15.95492   7.342333     2.17   0.030     1.564208    30.34562
          c2 |   12.29896   6.927709     1.78   0.076    -1.279105    25.87702
          c3 |    19.6995   7.977465     2.47   0.014     4.063955    35.33504
          c4 |   17.33512   7.035737     2.46   0.014     3.545326    31.12491
          c5 |   18.61164   7.616847     2.44   0.015     3.682895    33.54038
------------------------------------------------------------------------------

. nlcom (tdemoc: (_b[c1]+_b[c2]+_b[c3]+_b[c4] +_b[c5])/5), post

      tdemoc:  (_b[c1]+_b[c2]+_b[c3]+_b[c4] +_b[c5])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      tdemoc |   16.78003    6.73486     2.49   0.013     3.579942    29.98011
------------------------------------------------------------------------------

. eststo avb

. 
. // cluster standard errors
. fe_event
15.954916
12.298956
19.699498
17.335117
18.61164

symmetric V[5,5]
           c1         c2         c3         c4         c5
c1  98.453203
c2          1  90.024329
c3          1          1  108.03712
c4          1          1          1   100.7735
c5          1          1          1          1  109.29295

b[1,5]
           c1         c2         c3         c4         c5
r1  15.954916  12.298956  19.699498  17.335117   18.61164

. nlcom (tdemoc: (_b[c1]+_b[c2]+_b[c3]+_b[c4]+_b[c5])/5), post

      tdemoc:  (_b[c1]+_b[c2]+_b[c3]+_b[c4]+_b[c5])/5

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      tdemoc |   16.78003   4.589471     3.66   0.000     7.784828    25.77522
------------------------------------------------------------------------------

. eststo avc   

. 
. esttab r1 r2 r3 r4 r5 avc avb using "$tables/4c.tex", replace keep(tdemoc)  se nostar varlab
> els (tdemoc "Avg. effect on log GDP") b(3)   wrap nonotes ty mlabels("15 years" "16 years" "
> 17 years" "18 years" "19 years" "Av." "Av.(Bootstrap)")

\begin{tabular}{l*{7}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}&\multicolumn{1}{c}{(3)}&\multicol
> umn{1}{c}{(4)}&\multicolumn{1}{c}{(5)}&\multicolumn{1}{c}{(6)}&\multicolumn{1}{c}{(7)}\\
            &    15 years&    16 years&    17 years&    18 years&    19 years&         Av.&Av.
> (Bootstrap)\\
\hline
Avg. effect &      15.955&      12.299&      19.699&      17.335&      18.612&      16.780&   
>    16.780\\
on log GDP  &     (9.922)&     (9.488)&    (10.394)&    (10.039)&    (10.454)&     (4.589)&   
>   (6.735)\\
\hline
\(N\)       &        1348&        1292&        1077&         878&         707&            &   
>      2642\\
\hline\hline
\end{tabular}
(output written to C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/4c
> .tex)

. 
. ///  GET A FIGURE LIKE 4 WITHOUT WEIGHTS USING ALL EVENTS////////
> /// ////////////////////////////////////////////////////////////
> 
. /// Data win Wide format with FE
> use DDCG_with_events, clear 

. foreach var of varlist event_*{
  2. 
. if "`var'"=="event_18_"{
  3. use "$auxdata/fe_`var'.dta", clear
  4. }
  5. else{
  6. append using "$auxdata/fe_`var'.dta"
  7. }
  8. }

. 
. foreach var of varlist event_*{
  2. replace `var'=0 if `var'==.
  3. }
(2,596 real changes made)
(2,596 real changes made)
(2,590 real changes made)
(2,593 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,580 real changes made)
(2,596 real changes made)
(2,583 real changes made)
(2,585 real changes made)
(2,590 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,582 real changes made)
(2,592 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,590 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,595 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,594 real changes made)
(2,596 real changes made)
(2,582 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,583 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,593 real changes made)
(2,596 real changes made)

. order event_*

. 
. //// Estimation
> 
. forvalues s=0/45{
  2. quiet reg ydep`s' tdemoc i.event_*  lag*, cluster(countrynum)
  3. if `s'==0{
  4. mat ests=(_b[tdemoc], r(table)[5,1],r(table)[6,1])
  5. }
  6. else{
  7. mat ests=ests\(_b[tdemoc], r(table)[5,1],r(table)[6,1])
  8. mat colnames ests="b" "ll" "ul"
  9. }
 10. }

. 
. svmat ests

. cap drop yad

. gen yad=. 
(2,642 missing values generated)

. forvalues i=0/45{
  2. local k=`i'-14
  3. local j=`i'+1
  4. replace yad=`k' in `j'
  5. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. line ests1 yad, lcolor(black) scheme(s1color) xtitle(Years around democratization) ytitle(Ch
> ange in GDP per capita log points) yline(0, lcolor(black) lpattern(dash))||line ests2 yad,  
> lcolor(gray) lpattern(dash)||line ests3 yad,  lcolor(gray) lpattern(dash) legend(off)

. graph export "$figures/part5no_weights.png", replace
(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part5no_weight
> s.png written in PNG format)

. 
. 
. *******PART 5***************************
. ****************************************
. ****************************************
. *******PART 5***************************
. ****************************************
. ****************************************
. ****************************************
. ****** PART 5***************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 5**************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 5**************************
. ****************************************
. ****************************************
. 
. 
. ///////////// Get synth_events ///////////
> //////////////////////////////////////////
> 
. use DDCG_with_events, clear

. 
. foreach var of varlist event_*{
  2. preserve
  3. di "`var'" 
  4. quiet su year if `var'==1
  5. local t0 = r(mean)
  6. sca t0= r(mean)
  7. sca t10=t0-10
  8. sca t15=t0-15
  9. quiet su countrynum if `var'== 1
 10. sca tcountry=r(mean)
 11. quietly drop if `var'==.
 12. quietly drop if year<t10 // Critical 1
 13. 
. egen countrynum2=group(country_name)
 14. quiet su countrynum2 
 15. local mincountry=r(min)
 16. local maxcountry=r(max)
 17. forvalues i=`mincountry'/`maxcountry'{
 18. quiet su year if countrynum2==`i'
 19. local N=r(N)
 20. local N5= `N'-10 // Critical 2
 21. quiet su y if countrynum2==`i'
 22. di r(N)
 23. di `N5'
 24. if r(N)<`N' {
 25. drop if countrynum2==`i' 
 26. }
 27. else{
 28. di "No"
 29. }
 30. }
 31. rename `var'  synth_`var'
 32. 
. keep synth_`var' ydep* country_name countrynum dem tdemoc lag* year y yy*
 33. order year synth_`var' countrynum country_name  tdemoc dem y ydep* lag* 
 34. keep if year==`t0'
 35. replace synth_`var'=1 
 36. replace tdemoc=0 if tdemoc==.
 37. save "$auxdata/synth_`var'.dta", replace
 38. restore
 39. }
event_18_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
11
1
No
17
20
(30 observations deleted)
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
(590 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_18_
> .dta saved
event_19_
0
3
(13 observations deleted)
13
3
No
13
3
No
11
3
(13 observations deleted)
11
1
No
13
3
No
12
3
(13 observations deleted)
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
12
3
(13 observations deleted)
13
3
No
13
3
No
13
3
No
10
3
(13 observations deleted)
13
3
No
11
3
(13 observations deleted)
13
3
No
13
3
No
13
3
No
0
3
(13 observations deleted)
12
3
(13 observations deleted)
10
3
(13 observations deleted)
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
0
3
(13 observations deleted)
13
3
No
13
3
No
13
3
No
(430 observations deleted)
(35 real changes made)
(35 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_19_
> .dta saved
event_20_
0
29
(39 observations deleted)
39
29
No
26
29
(39 observations deleted)
29
29
(39 observations deleted)
30
29
(39 observations deleted)
11
1
No
17
29
(39 observations deleted)
36
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
26
29
(39 observations deleted)
19
29
(39 observations deleted)
39
29
No
25
29
(39 observations deleted)
38
29
(39 observations deleted)
14
29
(39 observations deleted)
36
29
(39 observations deleted)
21
29
(39 observations deleted)
13
29
(39 observations deleted)
25
29
(39 observations deleted)
27
29
(39 observations deleted)
39
29
No
11
29
(39 observations deleted)
39
29
No
16
29
(39 observations deleted)
39
29
No
39
29
No
0
29
(39 observations deleted)
38
29
(39 observations deleted)
10
29
(39 observations deleted)
39
29
No
29
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
26
29
(39 observations deleted)
23
29
(39 observations deleted)
39
29
No
30
29
(39 observations deleted)
39
29
No
24
29
(39 observations deleted)
0
29
(39 observations deleted)
24
29
(39 observations deleted)
27
29
(39 observations deleted)
21
29
(39 observations deleted)
(808 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_20_
> .dta saved
event_23_
0
26
(36 observations deleted)
36
26
No
26
26
(36 observations deleted)
29
26
(36 observations deleted)
30
26
(36 observations deleted)
17
26
(36 observations deleted)
11
1
No
35
26
(36 observations deleted)
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
26
26
(36 observations deleted)
19
26
(36 observations deleted)
36
26
No
25
26
(36 observations deleted)
35
26
(36 observations deleted)
14
26
(36 observations deleted)
36
26
No
21
26
(36 observations deleted)
13
26
(36 observations deleted)
27
26
(36 observations deleted)
11
26
(36 observations deleted)
36
26
No
16
26
(36 observations deleted)
36
26
No
36
26
No
0
26
(36 observations deleted)
35
26
(36 observations deleted)
10
26
(36 observations deleted)
36
26
No
29
26
(36 observations deleted)
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
26
26
(36 observations deleted)
23
26
(36 observations deleted)
36
26
No
30
26
(36 observations deleted)
36
26
No
24
26
(36 observations deleted)
0
26
(36 observations deleted)
24
26
(36 observations deleted)
27
26
(36 observations deleted)
21
26
(36 observations deleted)
(710 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_23_
> .dta saved
event_25_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
17
20
(30 observations deleted)
29
20
(30 observations deleted)
11
1
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
(590 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_25_
> .dta saved
event_27_
0
8
(18 observations deleted)
18
8
No
18
8
No
16
8
(18 observations deleted)
17
8
(18 observations deleted)
17
8
(18 observations deleted)
11
1
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
17
8
(18 observations deleted)
14
8
(18 observations deleted)
18
8
No
18
8
No
13
8
(18 observations deleted)
18
8
No
11
8
(18 observations deleted)
18
8
No
16
8
(18 observations deleted)
18
8
No
0
8
(18 observations deleted)
17
8
(18 observations deleted)
10
8
(18 observations deleted)
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
0
8
(18 observations deleted)
18
8
No
18
8
No
18
8
No
(554 observations deleted)
(32 real changes made)
(32 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_27_
> .dta saved
event_31_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
17
20
(30 observations deleted)
29
20
(30 observations deleted)
30
20
No
11
1
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
(590 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_31_
> .dta saved
event_34_
0
21
(31 observations deleted)
31
21
No
26
21
(31 observations deleted)
29
21
(31 observations deleted)
17
21
(31 observations deleted)
30
21
(31 observations deleted)
31
21
No
31
21
No
11
1
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
19
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
14
21
(31 observations deleted)
31
21
No
21
21
(31 observations deleted)
13
21
(31 observations deleted)
27
21
(31 observations deleted)
11
21
(31 observations deleted)
31
21
No
16
21
(31 observations deleted)
31
21
No
0
21
(31 observations deleted)
30
21
(31 observations deleted)
10
21
(31 observations deleted)
31
21
No
29
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
23
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
31
21
No
24
21
(31 observations deleted)
0
21
(31 observations deleted)
24
21
(31 observations deleted)
27
21
(31 observations deleted)
21
21
(31 observations deleted)
(580 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_34_
> .dta saved
event_41_
0
11
(21 observations deleted)
21
11
No
21
11
No
19
11
(21 observations deleted)
17
11
(21 observations deleted)
20
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
21
11
No
11
1
No
21
11
No
21
11
No
21
11
No
19
11
(21 observations deleted)
21
11
No
20
11
(21 observations deleted)
14
11
(21 observations deleted)
21
11
No
21
11
No
13
11
(21 observations deleted)
21
11
No
11
11
(21 observations deleted)
21
11
No
16
11
(21 observations deleted)
21
11
No
0
11
(21 observations deleted)
20
11
(21 observations deleted)
10
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
0
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
(630 observations deleted)
(31 real changes made)
(31 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_41_
> .dta saved
event_43_
0
37
(47 observations deleted)
47
37
No
26
37
(47 observations deleted)
29
37
(47 observations deleted)
30
37
(47 observations deleted)
17
37
(47 observations deleted)
36
37
(47 observations deleted)
47
37
No
47
37
No
47
37
No
47
37
No
47
37
No
21
37
(47 observations deleted)
41
37
(47 observations deleted)
0
1
(11 observations deleted)
47
37
No
20
37
(47 observations deleted)
47
37
No
26
37
(47 observations deleted)
19
37
(47 observations deleted)
30
37
(47 observations deleted)
47
37
No
46
37
(47 observations deleted)
25
37
(47 observations deleted)
47
37
No
45
37
(47 observations deleted)
14
37
(47 observations deleted)
36
37
(47 observations deleted)
21
37
(47 observations deleted)
47
37
No
13
37
(47 observations deleted)
25
37
(47 observations deleted)
27
37
(47 observations deleted)
47
37
No
11
37
(47 observations deleted)
47
37
No
16
37
(47 observations deleted)
47
37
No
47
37
No
47
37
No
0
37
(47 observations deleted)
46
37
(47 observations deleted)
10
37
(47 observations deleted)
47
37
No
29
37
(47 observations deleted)
43
37
(47 observations deleted)
47
37
No
0
37
(47 observations deleted)
47
37
No
47
37
No
41
37
(47 observations deleted)
47
37
No
26
37
(47 observations deleted)
23
37
(47 observations deleted)
47
37
No
30
37
(47 observations deleted)
47
37
No
24
37
(47 observations deleted)
0
37
(47 observations deleted)
24
37
(47 observations deleted)
27
37
(47 observations deleted)
21
37
(47 observations deleted)
(1,058 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_43_
> .dta saved
event_44_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
4
1
(11 observations deleted)
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
18
(28 observations deleted)
28
18
No
16
18
(28 observations deleted)
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
(567 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_44_
> .dta saved
event_49_
0
33
(43 observations deleted)
43
33
No
26
33
(43 observations deleted)
29
33
(43 observations deleted)
30
33
(43 observations deleted)
17
33
(43 observations deleted)
36
33
(43 observations deleted)
43
33
No
43
33
No
43
33
No
43
33
No
43
33
No
21
33
(43 observations deleted)
41
33
(43 observations deleted)
43
33
No
20
33
(43 observations deleted)
11
1
No
43
33
No
26
33
(43 observations deleted)
19
33
(43 observations deleted)
43
33
No
25
33
(43 observations deleted)
43
33
No
42
33
(43 observations deleted)
14
33
(43 observations deleted)
36
33
(43 observations deleted)
21
33
(43 observations deleted)
43
33
No
13
33
(43 observations deleted)
25
33
(43 observations deleted)
27
33
(43 observations deleted)
43
33
No
11
33
(43 observations deleted)
43
33
No
16
33
(43 observations deleted)
43
33
No
43
33
No
0
33
(43 observations deleted)
42
33
(43 observations deleted)
10
33
(43 observations deleted)
43
33
No
29
33
(43 observations deleted)
43
33
No
43
33
No
0
33
(43 observations deleted)
43
33
No
43
33
No
41
33
(43 observations deleted)
43
33
No
26
33
(43 observations deleted)
23
33
(43 observations deleted)
43
33
No
30
33
(43 observations deleted)
43
33
No
24
33
(43 observations deleted)
0
33
(43 observations deleted)
24
33
(43 observations deleted)
27
33
(43 observations deleted)
21
33
(43 observations deleted)
(976 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_49_
> .dta saved
event_50_
0
32
(42 observations deleted)
42
32
No
26
32
(42 observations deleted)
29
32
(42 observations deleted)
30
32
(42 observations deleted)
17
32
(42 observations deleted)
36
32
(42 observations deleted)
42
32
No
42
32
No
42
32
No
42
32
No
42
32
No
21
32
(42 observations deleted)
41
32
(42 observations deleted)
42
32
No
11
1
No
42
32
No
26
32
(42 observations deleted)
19
32
(42 observations deleted)
42
32
No
25
32
(42 observations deleted)
41
32
(42 observations deleted)
14
32
(42 observations deleted)
36
32
(42 observations deleted)
21
32
(42 observations deleted)
42
32
No
13
32
(42 observations deleted)
25
32
(42 observations deleted)
27
32
(42 observations deleted)
42
32
No
11
32
(42 observations deleted)
42
32
No
16
32
(42 observations deleted)
42
32
No
42
32
No
0
32
(42 observations deleted)
41
32
(42 observations deleted)
10
32
(42 observations deleted)
42
32
No
29
32
(42 observations deleted)
42
32
No
42
32
No
0
32
(42 observations deleted)
42
32
No
42
32
No
41
32
(42 observations deleted)
42
32
No
26
32
(42 observations deleted)
23
32
(42 observations deleted)
42
32
No
30
32
(42 observations deleted)
42
32
No
24
32
(42 observations deleted)
0
32
(42 observations deleted)
24
32
(42 observations deleted)
27
32
(42 observations deleted)
21
32
(42 observations deleted)
(912 observations deleted)
(22 real changes made)
(22 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_50_
> .dta saved
event_52_
0
29
(39 observations deleted)
39
29
No
26
29
(39 observations deleted)
29
29
(39 observations deleted)
30
29
(39 observations deleted)
17
29
(39 observations deleted)
36
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
11
1
No
26
29
(39 observations deleted)
19
29
(39 observations deleted)
39
29
No
25
29
(39 observations deleted)
38
29
(39 observations deleted)
14
29
(39 observations deleted)
36
29
(39 observations deleted)
21
29
(39 observations deleted)
13
29
(39 observations deleted)
25
29
(39 observations deleted)
27
29
(39 observations deleted)
39
29
No
11
29
(39 observations deleted)
39
29
No
16
29
(39 observations deleted)
39
29
No
39
29
No
0
29
(39 observations deleted)
38
29
(39 observations deleted)
10
29
(39 observations deleted)
39
29
No
29
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
26
29
(39 observations deleted)
23
29
(39 observations deleted)
39
29
No
30
29
(39 observations deleted)
39
29
No
24
29
(39 observations deleted)
0
29
(39 observations deleted)
24
29
(39 observations deleted)
27
29
(39 observations deleted)
21
29
(39 observations deleted)
(808 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_52_
> .dta saved
event_55_
0
19
(29 observations deleted)
29
19
No
26
19
(29 observations deleted)
27
19
(29 observations deleted)
17
19
(29 observations deleted)
28
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
19
19
(29 observations deleted)
11
1
No
29
19
No
28
19
(29 observations deleted)
14
19
(29 observations deleted)
29
19
No
21
19
(29 observations deleted)
13
19
(29 observations deleted)
27
19
(29 observations deleted)
11
19
(29 observations deleted)
29
19
No
16
19
(29 observations deleted)
29
19
No
0
19
(29 observations deleted)
28
19
(29 observations deleted)
10
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
23
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
24
19
(29 observations deleted)
0
19
(29 observations deleted)
24
19
(29 observations deleted)
27
19
(29 observations deleted)
21
19
(29 observations deleted)
(598 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_55_
> .dta saved
event_62_
0
16
(26 observations deleted)
26
16
No
26
16
No
24
16
(26 observations deleted)
17
16
(26 observations deleted)
25
16
(26 observations deleted)
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
19
16
(26 observations deleted)
26
16
No
11
1
No
25
16
(26 observations deleted)
14
16
(26 observations deleted)
26
16
No
21
16
(26 observations deleted)
13
16
(26 observations deleted)
26
16
No
11
16
(26 observations deleted)
26
16
No
16
16
(26 observations deleted)
26
16
No
0
16
(26 observations deleted)
25
16
(26 observations deleted)
10
16
(26 observations deleted)
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
23
16
(26 observations deleted)
26
16
No
26
16
No
26
16
No
24
16
(26 observations deleted)
0
16
(26 observations deleted)
24
16
(26 observations deleted)
26
16
No
21
16
(26 observations deleted)
(660 observations deleted)
(26 real changes made)
(26 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_62_
> .dta saved
event_65_
0
36
(46 observations deleted)
46
36
No
26
36
(46 observations deleted)
29
36
(46 observations deleted)
30
36
(46 observations deleted)
17
36
(46 observations deleted)
36
36
(46 observations deleted)
46
36
No
46
36
No
46
36
No
46
36
No
46
36
No
21
36
(46 observations deleted)
41
36
(46 observations deleted)
46
36
No
20
36
(46 observations deleted)
46
36
No
26
36
(46 observations deleted)
19
36
(46 observations deleted)
46
36
No
11
1
No
25
36
(46 observations deleted)
46
36
No
45
36
(46 observations deleted)
14
36
(46 observations deleted)
36
36
(46 observations deleted)
21
36
(46 observations deleted)
46
36
No
13
36
(46 observations deleted)
25
36
(46 observations deleted)
27
36
(46 observations deleted)
46
36
No
11
36
(46 observations deleted)
46
36
No
16
36
(46 observations deleted)
46
36
No
46
36
No
46
36
No
0
36
(46 observations deleted)
45
36
(46 observations deleted)
10
36
(46 observations deleted)
46
36
No
29
36
(46 observations deleted)
43
36
(46 observations deleted)
46
36
No
0
36
(46 observations deleted)
46
36
No
46
36
No
41
36
(46 observations deleted)
46
36
No
26
36
(46 observations deleted)
23
36
(46 observations deleted)
46
36
No
30
36
(46 observations deleted)
46
36
No
24
36
(46 observations deleted)
0
36
(46 observations deleted)
24
36
(46 observations deleted)
27
36
(46 observations deleted)
21
36
(46 observations deleted)
(1,045 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_65_
> .dta saved
event_66_
0
27
(37 observations deleted)
37
27
No
26
27
(37 observations deleted)
29
27
(37 observations deleted)
30
27
(37 observations deleted)
17
27
(37 observations deleted)
36
27
(37 observations deleted)
37
27
No
37
27
No
37
27
No
37
27
No
37
27
No
37
27
No
26
27
(37 observations deleted)
19
27
(37 observations deleted)
37
27
No
8
1
(11 observations deleted)
25
27
(37 observations deleted)
36
27
(37 observations deleted)
14
27
(37 observations deleted)
36
27
(37 observations deleted)
21
27
(37 observations deleted)
13
27
(37 observations deleted)
25
27
(37 observations deleted)
27
27
(37 observations deleted)
11
27
(37 observations deleted)
37
27
No
16
27
(37 observations deleted)
37
27
No
37
27
No
0
27
(37 observations deleted)
36
27
(37 observations deleted)
10
27
(37 observations deleted)
37
27
No
29
27
(37 observations deleted)
37
27
No
37
27
No
37
27
No
37
27
No
37
27
No
26
27
(37 observations deleted)
23
27
(37 observations deleted)
37
27
No
30
27
(37 observations deleted)
37
27
No
24
27
(37 observations deleted)
0
27
(37 observations deleted)
24
27
(37 observations deleted)
27
27
(37 observations deleted)
21
27
(37 observations deleted)
(684 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_66_
> .dta saved
event_68_
0
1
(11 observations deleted)
11
1
No
11
1
No
9
1
(11 observations deleted)
11
1
No
10
1
(11 observations deleted)
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
10
1
(11 observations deleted)
11
1
No
11
1
No
11
1
No
8
1
(11 observations deleted)
11
1
No
10
1
(11 observations deleted)
11
1
No
11
1
No
11
1
No
0
1
(11 observations deleted)
10
1
(11 observations deleted)
10
1
(11 observations deleted)
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
0
1
(11 observations deleted)
11
1
No
11
1
No
11
1
No
(360 observations deleted)
(35 real changes made)
(35 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_68_
> .dta saved
event_70_
0
19
(29 observations deleted)
29
19
No
26
19
(29 observations deleted)
27
19
(29 observations deleted)
17
19
(29 observations deleted)
28
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
19
19
(29 observations deleted)
29
19
No
11
1
No
28
19
(29 observations deleted)
14
19
(29 observations deleted)
29
19
No
21
19
(29 observations deleted)
13
19
(29 observations deleted)
27
19
(29 observations deleted)
11
19
(29 observations deleted)
29
19
No
16
19
(29 observations deleted)
29
19
No
0
19
(29 observations deleted)
28
19
(29 observations deleted)
10
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
23
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
24
19
(29 observations deleted)
0
19
(29 observations deleted)
24
19
(29 observations deleted)
27
19
(29 observations deleted)
21
19
(29 observations deleted)
(598 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_70_
> .dta saved
event_72_
0
29
(39 observations deleted)
39
29
No
26
29
(39 observations deleted)
29
29
(39 observations deleted)
30
29
(39 observations deleted)
17
29
(39 observations deleted)
36
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
26
29
(39 observations deleted)
19
29
(39 observations deleted)
39
29
No
25
29
(39 observations deleted)
11
1
No
38
29
(39 observations deleted)
14
29
(39 observations deleted)
36
29
(39 observations deleted)
21
29
(39 observations deleted)
13
29
(39 observations deleted)
25
29
(39 observations deleted)
27
29
(39 observations deleted)
39
29
No
11
29
(39 observations deleted)
39
29
No
16
29
(39 observations deleted)
39
29
No
39
29
No
0
29
(39 observations deleted)
38
29
(39 observations deleted)
10
29
(39 observations deleted)
39
29
No
29
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
26
29
(39 observations deleted)
23
29
(39 observations deleted)
39
29
No
30
29
(39 observations deleted)
39
29
No
24
29
(39 observations deleted)
0
29
(39 observations deleted)
24
29
(39 observations deleted)
27
29
(39 observations deleted)
21
29
(39 observations deleted)
(808 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_72_
> .dta saved
event_73_
0
21
(31 observations deleted)
31
21
No
26
21
(31 observations deleted)
29
21
(31 observations deleted)
17
21
(31 observations deleted)
30
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
19
21
(31 observations deleted)
31
21
No
11
1
No
30
21
(31 observations deleted)
14
21
(31 observations deleted)
31
21
No
21
21
(31 observations deleted)
13
21
(31 observations deleted)
27
21
(31 observations deleted)
11
21
(31 observations deleted)
31
21
No
16
21
(31 observations deleted)
31
21
No
0
21
(31 observations deleted)
30
21
(31 observations deleted)
10
21
(31 observations deleted)
31
21
No
29
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
23
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
31
21
No
24
21
(31 observations deleted)
0
21
(31 observations deleted)
24
21
(31 observations deleted)
27
21
(31 observations deleted)
21
21
(31 observations deleted)
(580 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_73_
> .dta saved
event_76_
0
12
(22 observations deleted)
22
12
No
22
12
No
20
12
(22 observations deleted)
17
12
(22 observations deleted)
21
12
(22 observations deleted)
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
19
12
(22 observations deleted)
22
12
No
11
1
No
21
12
(22 observations deleted)
14
12
(22 observations deleted)
22
12
No
21
12
(22 observations deleted)
13
12
(22 observations deleted)
22
12
No
11
12
(22 observations deleted)
22
12
No
16
12
(22 observations deleted)
22
12
No
0
12
(22 observations deleted)
21
12
(22 observations deleted)
10
12
(22 observations deleted)
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
0
12
(22 observations deleted)
22
12
No
22
12
No
21
12
(22 observations deleted)
(619 observations deleted)
(29 real changes made)
(29 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_76_
> .dta saved
event_86_
0
9
(19 observations deleted)
19
9
No
19
9
No
17
9
(19 observations deleted)
17
9
(19 observations deleted)
18
9
(19 observations deleted)
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
18
9
(19 observations deleted)
14
9
(19 observations deleted)
19
9
No
19
9
No
11
1
No
13
9
(19 observations deleted)
19
9
No
11
9
(19 observations deleted)
19
9
No
16
9
(19 observations deleted)
19
9
No
0
9
(19 observations deleted)
18
9
(19 observations deleted)
10
9
(19 observations deleted)
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
0
9
(19 observations deleted)
19
9
No
19
9
No
19
9
No
(586 observations deleted)
(32 real changes made)
(32 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_86_
> .dta saved
event_88_
0
23
(33 observations deleted)
33
23
No
26
23
(33 observations deleted)
29
23
(33 observations deleted)
17
23
(33 observations deleted)
32
23
(33 observations deleted)
33
23
No
33
23
No
33
23
No
33
23
No
33
23
No
33
23
No
26
23
(33 observations deleted)
19
23
(33 observations deleted)
33
23
No
25
23
(33 observations deleted)
32
23
(33 observations deleted)
14
23
(33 observations deleted)
33
23
No
21
23
(33 observations deleted)
11
1
No
13
23
(33 observations deleted)
27
23
(33 observations deleted)
11
23
(33 observations deleted)
33
23
No
16
23
(33 observations deleted)
33
23
No
0
23
(33 observations deleted)
32
23
(33 observations deleted)
10
23
(33 observations deleted)
33
23
No
29
23
(33 observations deleted)
33
23
No
33
23
No
33
23
No
33
23
No
33
23
No
26
23
(33 observations deleted)
23
23
(33 observations deleted)
33
23
No
30
23
(33 observations deleted)
33
23
No
24
23
(33 observations deleted)
0
23
(33 observations deleted)
24
23
(33 observations deleted)
27
23
(33 observations deleted)
21
23
(33 observations deleted)
(618 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_88_
> .dta saved
event_92_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
1
No
11
18
(28 observations deleted)
28
18
No
16
18
(28 observations deleted)
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
(577 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_92_
> .dta saved
event_93_
0
6
(16 observations deleted)
16
6
No
16
6
No
14
6
(16 observations deleted)
16
6
No
15
6
(16 observations deleted)
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
15
6
(16 observations deleted)
14
6
(16 observations deleted)
16
6
No
16
6
No
13
6
(16 observations deleted)
16
6
No
11
1
No
11
6
(16 observations deleted)
16
6
No
16
6
No
16
6
No
0
6
(16 observations deleted)
15
6
(16 observations deleted)
10
6
(16 observations deleted)
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
0
6
(16 observations deleted)
16
6
No
16
6
No
16
6
No
(520 observations deleted)
(34 real changes made)
(34 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_93_
> .dta saved
event_95_
0
7
(17 observations deleted)
17
7
No
17
7
No
15
7
(17 observations deleted)
17
7
No
16
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
16
7
(17 observations deleted)
14
7
(17 observations deleted)
17
7
No
17
7
No
13
7
(17 observations deleted)
17
7
No
11
1
No
11
7
(17 observations deleted)
17
7
No
16
7
(17 observations deleted)
17
7
No
0
7
(17 observations deleted)
16
7
(17 observations deleted)
10
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
0
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
(538 observations deleted)
(33 real changes made)
(33 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_95_
> .dta saved
event_97_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
18
(28 observations deleted)
4
1
(11 observations deleted)
28
18
No
16
18
(28 observations deleted)
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
(567 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_97_
> .dta saved
event_99_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
17
20
(30 observations deleted)
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
2
1
(11 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
(580 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_99_
> .dta saved
event_101_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
11
1
No
27
17
No
16
17
(27 observations deleted)
27
17
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
(608 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_101
> _.dta saved
event_104_
0
19
(29 observations deleted)
29
19
No
26
19
(29 observations deleted)
27
19
(29 observations deleted)
17
19
(29 observations deleted)
28
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
19
19
(29 observations deleted)
29
19
No
28
19
(29 observations deleted)
14
19
(29 observations deleted)
29
19
No
21
19
(29 observations deleted)
13
19
(29 observations deleted)
27
19
(29 observations deleted)
11
19
(29 observations deleted)
29
19
No
16
19
(29 observations deleted)
11
1
No
29
19
No
0
19
(29 observations deleted)
28
19
(29 observations deleted)
10
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
23
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
24
19
(29 observations deleted)
0
19
(29 observations deleted)
24
19
(29 observations deleted)
27
19
(29 observations deleted)
21
19
(29 observations deleted)
(598 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_104
> _.dta saved
event_108_
0
14
(24 observations deleted)
24
14
No
24
14
No
22
14
(24 observations deleted)
17
14
(24 observations deleted)
23
14
(24 observations deleted)
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
19
14
(24 observations deleted)
24
14
No
23
14
(24 observations deleted)
14
14
(24 observations deleted)
24
14
No
21
14
(24 observations deleted)
13
14
(24 observations deleted)
24
14
No
11
14
(24 observations deleted)
24
14
No
16
14
(24 observations deleted)
11
1
No
24
14
No
0
14
(24 observations deleted)
23
14
(24 observations deleted)
10
14
(24 observations deleted)
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
23
14
(24 observations deleted)
24
14
No
24
14
No
24
14
No
24
14
No
0
14
(24 observations deleted)
24
14
No
24
14
No
21
14
(24 observations deleted)
(654 observations deleted)
(28 real changes made)
(28 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_108
> _.dta saved
event_109_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
27
17
No
16
17
(27 observations deleted)
11
1
No
27
17
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
(608 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_109
> _.dta saved
event_110_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
18
(28 observations deleted)
28
18
No
16
18
(28 observations deleted)
11
1
No
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
(577 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_110
> _.dta saved
event_112_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
27
17
No
16
17
(27 observations deleted)
27
17
No
11
1
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
(608 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_112
> _.dta saved
event_119_
0
21
(31 observations deleted)
31
21
No
26
21
(31 observations deleted)
29
21
(31 observations deleted)
17
21
(31 observations deleted)
30
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
19
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
14
21
(31 observations deleted)
31
21
No
21
21
(31 observations deleted)
13
21
(31 observations deleted)
27
21
(31 observations deleted)
11
21
(31 observations deleted)
31
21
No
16
21
(31 observations deleted)
31
21
No
11
1
No
0
21
(31 observations deleted)
30
21
(31 observations deleted)
10
21
(31 observations deleted)
31
21
No
29
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
23
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
31
21
No
24
21
(31 observations deleted)
0
21
(31 observations deleted)
24
21
(31 observations deleted)
27
21
(31 observations deleted)
21
21
(31 observations deleted)
(580 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_119
> _.dta saved
event_127_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
27
17
No
16
17
(27 observations deleted)
27
17
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
11
1
No
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
(608 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_127
> _.dta saved
event_129_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
18
(28 observations deleted)
28
18
No
16
18
(28 observations deleted)
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
11
1
No
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
(577 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_129
> _.dta saved
event_131_
0
24
(34 observations deleted)
34
24
No
26
24
(34 observations deleted)
29
24
(34 observations deleted)
30
24
(34 observations deleted)
17
24
(34 observations deleted)
33
24
(34 observations deleted)
34
24
No
34
24
No
34
24
No
34
24
No
34
24
No
34
24
No
26
24
(34 observations deleted)
19
24
(34 observations deleted)
34
24
No
25
24
(34 observations deleted)
33
24
(34 observations deleted)
14
24
(34 observations deleted)
34
24
No
21
24
(34 observations deleted)
13
24
(34 observations deleted)
27
24
(34 observations deleted)
11
24
(34 observations deleted)
34
24
No
16
24
(34 observations deleted)
34
24
No
0
24
(34 observations deleted)
33
24
(34 observations deleted)
11
1
No
10
24
(34 observations deleted)
34
24
No
29
24
(34 observations deleted)
34
24
No
34
24
No
34
24
No
34
24
No
34
24
No
26
24
(34 observations deleted)
23
24
(34 observations deleted)
34
24
No
30
24
(34 observations deleted)
34
24
No
24
24
(34 observations deleted)
0
24
(34 observations deleted)
24
24
(34 observations deleted)
27
24
(34 observations deleted)
21
24
(34 observations deleted)
(637 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_131
> _.dta saved
event_132_
0
21
(31 observations deleted)
31
21
No
26
21
(31 observations deleted)
29
21
(31 observations deleted)
17
21
(31 observations deleted)
30
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
19
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
14
21
(31 observations deleted)
31
21
No
21
21
(31 observations deleted)
13
21
(31 observations deleted)
27
21
(31 observations deleted)
11
21
(31 observations deleted)
31
21
No
16
21
(31 observations deleted)
31
21
No
0
21
(31 observations deleted)
30
21
(31 observations deleted)
1
1
(11 observations deleted)
10
21
(31 observations deleted)
31
21
No
29
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
23
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
31
21
No
24
21
(31 observations deleted)
0
21
(31 observations deleted)
24
21
(31 observations deleted)
27
21
(31 observations deleted)
21
21
(31 observations deleted)
(570 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_132
> _.dta saved
event_133_
0
35
(45 observations deleted)
45
35
No
26
35
(45 observations deleted)
29
35
(45 observations deleted)
30
35
(45 observations deleted)
17
35
(45 observations deleted)
36
35
(45 observations deleted)
45
35
No
45
35
No
45
35
No
45
35
No
45
35
No
21
35
(45 observations deleted)
41
35
(45 observations deleted)
45
35
No
20
35
(45 observations deleted)
45
35
No
26
35
(45 observations deleted)
19
35
(45 observations deleted)
45
35
No
25
35
(45 observations deleted)
45
35
No
44
35
(45 observations deleted)
14
35
(45 observations deleted)
36
35
(45 observations deleted)
21
35
(45 observations deleted)
45
35
No
13
35
(45 observations deleted)
25
35
(45 observations deleted)
27
35
(45 observations deleted)
45
35
No
11
35
(45 observations deleted)
45
35
No
16
35
(45 observations deleted)
45
35
No
45
35
No
45
35
No
0
35
(45 observations deleted)
44
35
(45 observations deleted)
11
1
No
10
35
(45 observations deleted)
45
35
No
29
35
(45 observations deleted)
43
35
(45 observations deleted)
45
35
No
0
35
(45 observations deleted)
45
35
No
45
35
No
41
35
(45 observations deleted)
45
35
No
26
35
(45 observations deleted)
23
35
(45 observations deleted)
45
35
No
30
35
(45 observations deleted)
45
35
No
24
35
(45 observations deleted)
0
35
(45 observations deleted)
24
35
(45 observations deleted)
27
35
(45 observations deleted)
21
35
(45 observations deleted)
(1,022 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_133
> _.dta saved
event_135_
0
21
(31 observations deleted)
31
21
No
26
21
(31 observations deleted)
29
21
(31 observations deleted)
17
21
(31 observations deleted)
30
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
19
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
14
21
(31 observations deleted)
31
21
No
21
21
(31 observations deleted)
13
21
(31 observations deleted)
27
21
(31 observations deleted)
11
21
(31 observations deleted)
31
21
No
16
21
(31 observations deleted)
31
21
No
0
21
(31 observations deleted)
30
21
(31 observations deleted)
10
21
(31 observations deleted)
11
1
No
31
21
No
29
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
23
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
31
21
No
24
21
(31 observations deleted)
0
21
(31 observations deleted)
24
21
(31 observations deleted)
27
21
(31 observations deleted)
21
21
(31 observations deleted)
(580 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_135
> _.dta saved
event_140_
0
11
(21 observations deleted)
21
11
No
21
11
No
19
11
(21 observations deleted)
17
11
(21 observations deleted)
20
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
19
11
(21 observations deleted)
21
11
No
20
11
(21 observations deleted)
14
11
(21 observations deleted)
21
11
No
21
11
No
13
11
(21 observations deleted)
21
11
No
11
11
(21 observations deleted)
21
11
No
16
11
(21 observations deleted)
21
11
No
0
11
(21 observations deleted)
20
11
(21 observations deleted)
10
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
11
1
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
0
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
(630 observations deleted)
(31 real changes made)
(31 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_140
> _.dta saved
event_141_
0
11
(21 observations deleted)
21
11
No
21
11
No
19
11
(21 observations deleted)
17
11
(21 observations deleted)
20
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
19
11
(21 observations deleted)
21
11
No
20
11
(21 observations deleted)
14
11
(21 observations deleted)
21
11
No
21
11
No
13
11
(21 observations deleted)
21
11
No
11
11
(21 observations deleted)
21
11
No
16
11
(21 observations deleted)
21
11
No
0
11
(21 observations deleted)
20
11
(21 observations deleted)
10
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
0
1
(11 observations deleted)
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
0
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
(620 observations deleted)
(31 real changes made)
(31 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_141
> _.dta saved
event_145_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
18
(28 observations deleted)
28
18
No
16
18
(28 observations deleted)
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
10
1
(11 observations deleted)
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
(567 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_145
> _.dta saved
event_146_
0
19
(29 observations deleted)
29
19
No
26
19
(29 observations deleted)
27
19
(29 observations deleted)
17
19
(29 observations deleted)
28
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
19
19
(29 observations deleted)
29
19
No
28
19
(29 observations deleted)
14
19
(29 observations deleted)
29
19
No
21
19
(29 observations deleted)
13
19
(29 observations deleted)
27
19
(29 observations deleted)
11
19
(29 observations deleted)
29
19
No
16
19
(29 observations deleted)
29
19
No
0
19
(29 observations deleted)
28
19
(29 observations deleted)
10
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
3
1
(11 observations deleted)
29
19
No
29
19
No
26
19
(29 observations deleted)
23
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
24
19
(29 observations deleted)
0
19
(29 observations deleted)
24
19
(29 observations deleted)
27
19
(29 observations deleted)
21
19
(29 observations deleted)
(588 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_146
> _.dta saved
event_147_
0
7
(17 observations deleted)
17
7
No
17
7
No
15
7
(17 observations deleted)
17
7
No
16
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
16
7
(17 observations deleted)
14
7
(17 observations deleted)
17
7
No
17
7
No
13
7
(17 observations deleted)
17
7
No
11
7
(17 observations deleted)
17
7
No
16
7
(17 observations deleted)
17
7
No
0
7
(17 observations deleted)
16
7
(17 observations deleted)
10
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
11
1
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
0
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
(538 observations deleted)
(33 real changes made)
(33 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_147
> _.dta saved
event_149_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
27
17
No
16
17
(27 observations deleted)
27
17
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
11
1
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
(608 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_149
> _.dta saved
event_150_
0
33
(43 observations deleted)
43
33
No
26
33
(43 observations deleted)
29
33
(43 observations deleted)
30
33
(43 observations deleted)
17
33
(43 observations deleted)
36
33
(43 observations deleted)
43
33
No
43
33
No
43
33
No
43
33
No
43
33
No
21
33
(43 observations deleted)
41
33
(43 observations deleted)
43
33
No
20
33
(43 observations deleted)
43
33
No
26
33
(43 observations deleted)
19
33
(43 observations deleted)
43
33
No
25
33
(43 observations deleted)
43
33
No
42
33
(43 observations deleted)
14
33
(43 observations deleted)
36
33
(43 observations deleted)
21
33
(43 observations deleted)
43
33
No
13
33
(43 observations deleted)
25
33
(43 observations deleted)
27
33
(43 observations deleted)
43
33
No
11
33
(43 observations deleted)
43
33
No
16
33
(43 observations deleted)
43
33
No
43
33
No
0
33
(43 observations deleted)
42
33
(43 observations deleted)
10
33
(43 observations deleted)
43
33
No
29
33
(43 observations deleted)
43
33
No
43
33
No
0
33
(43 observations deleted)
43
33
No
43
33
No
11
1
No
41
33
(43 observations deleted)
43
33
No
26
33
(43 observations deleted)
23
33
(43 observations deleted)
43
33
No
30
33
(43 observations deleted)
43
33
No
24
33
(43 observations deleted)
0
33
(43 observations deleted)
24
33
(43 observations deleted)
27
33
(43 observations deleted)
21
33
(43 observations deleted)
(976 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_150
> _.dta saved
event_161_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
17
20
(30 observations deleted)
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
0
1
(11 observations deleted)
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
(580 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_161
> _.dta saved
event_162_
0
19
(29 observations deleted)
29
19
No
26
19
(29 observations deleted)
27
19
(29 observations deleted)
17
19
(29 observations deleted)
28
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
19
19
(29 observations deleted)
29
19
No
28
19
(29 observations deleted)
14
19
(29 observations deleted)
29
19
No
21
19
(29 observations deleted)
13
19
(29 observations deleted)
27
19
(29 observations deleted)
11
19
(29 observations deleted)
29
19
No
16
19
(29 observations deleted)
29
19
No
0
19
(29 observations deleted)
28
19
(29 observations deleted)
10
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
0
1
(11 observations deleted)
26
19
(29 observations deleted)
23
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
24
19
(29 observations deleted)
0
19
(29 observations deleted)
24
19
(29 observations deleted)
27
19
(29 observations deleted)
21
19
(29 observations deleted)
(588 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_162
> _.dta saved
event_173_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
27
17
No
16
17
(27 observations deleted)
27
17
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
8
1
(11 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
(598 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_173
> _.dta saved
event_177_
0
26
(36 observations deleted)
36
26
No
26
26
(36 observations deleted)
29
26
(36 observations deleted)
30
26
(36 observations deleted)
17
26
(36 observations deleted)
35
26
(36 observations deleted)
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
26
26
(36 observations deleted)
19
26
(36 observations deleted)
36
26
No
25
26
(36 observations deleted)
35
26
(36 observations deleted)
14
26
(36 observations deleted)
36
26
No
21
26
(36 observations deleted)
13
26
(36 observations deleted)
27
26
(36 observations deleted)
11
26
(36 observations deleted)
36
26
No
16
26
(36 observations deleted)
36
26
No
36
26
No
0
26
(36 observations deleted)
35
26
(36 observations deleted)
10
26
(36 observations deleted)
36
26
No
29
26
(36 observations deleted)
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
26
26
(36 observations deleted)
23
26
(36 observations deleted)
36
26
No
30
26
(36 observations deleted)
36
26
No
24
26
(36 observations deleted)
0
26
(36 observations deleted)
11
1
No
24
26
(36 observations deleted)
27
26
(36 observations deleted)
21
26
(36 observations deleted)
(710 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_177
> _.dta saved
event_183_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
17
20
(30 observations deleted)
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
11
1
No
(590 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_183
> _.dta saved

. 
. 
. //// Get weights and merge with events ////
> use DDCG_with_events, clear 

. xtset countrynum year
       panel variable:  countrynum (strongly balanced)
        time variable:  year, 1960 to 2010
                delta:  1 unit

. foreach var of varlist  event_*{
  2. preserve
  3. quiet su year if `var'==1
  4. local t0 = r(mean)
  5. sca t0= r(mean)
  6. sca t10=t0-10
  7. sca t15=t0-15
  8. quiet su countrynum if `var'== 1
  9. sca tcountry=r(mean)
 10. replace `var'=1 if `var'==. & countrynum==tcountry
 11. quietly drop if `var'==.
 12. quietly drop if year<t10 // Critical 1
 13. egen countrynum2=group(country_name)
 14. order countrynum2 
 15. quiet su countrynum2 
 16. local mincountry=r(min)
 17. local maxcountry=r(max)
 18. forvalues i=`mincountry'/`maxcountry'{
 19. quiet su year if countrynum2==`i'
 20. local N=r(N)
 21. local N5= `N'-10 // Critical 2
 22. quiet su y if countrynum2==`i'
 23. if r(N)<`N' {
 24. quietly drop if countrynum2==`i' 
 25. }
 26. else{
 27. }
 28. }
 29. */
. forvalues k=1/10{
 30. local t`k'=t0-`k'
 31. }
 32. local t0=t0
 33. local tcountry=tcountry
 34. //Controls must have y data for at least 10 years before treatment
. cap: quiet synth y  y(`t1') y(`t2') y(`t3') y(`t4'), trunit(`tcountry')  trperiod(`t0') keep
> ("$auxdata/s1_`var'", replace) 
 35. if _rc==0{
 36. use "$auxdata/s1_`var'.dta", clear
 37. rename _Co_Number countrynum   
 38. rename _W_Weight weight 
 39. quietly keep countrynum weight
 40. quietly drop if countrynum==. & weight==.
 41. quietly merge 1:1 countrynum using "$auxdata/synth_`var'.dta"
 42. quietly drop _merge 
 43. save "$auxdata/synth_weight_`var'.dta", replace
 44. }
 45. else{
 46. di "s1 didn't run `var'"
 47. }
 48. restore
 49. }
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_18_.dta saved
(2 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_19_.dta saved
(28 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_20_.dta saved
(25 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_23_.dta saved
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_25_.dta saved
(7 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_27_.dta saved
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_31_.dta saved
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_34_.dta saved
(10 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_41_.dta saved
(36 real changes made)
s1 didn't run event_43_
(17 real changes made)
s1 didn't run event_44_
(32 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_49_.dta saved
(31 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_50_.dta saved
(28 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_52_.dta saved
(18 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_55_.dta saved
(15 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_62_.dta saved
(35 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_65_.dta saved
(26 real changes made)
s1 didn't run event_66_
(0 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_68_.dta saved
(18 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_70_.dta saved
(28 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_72_.dta saved
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_73_.dta saved
(11 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_76_.dta saved
(8 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_86_.dta saved
(22 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_88_.dta saved
(17 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_92_.dta saved
(5 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_93_.dta saved
(6 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_95_.dta saved
(17 real changes made)
s1 didn't run event_97_
(19 real changes made)
s1 didn't run event_99_
(16 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_101_.dta saved
(18 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_104_.dta saved
(13 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_108_.dta saved
(16 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_109_.dta saved
(17 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_110_.dta saved
(16 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_112_.dta saved
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_119_.dta saved
(16 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_127_.dta saved
(17 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_129_.dta saved
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_131_.dta saved
(20 real changes made)
s1 didn't run event_132_
(34 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_133_.dta saved
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_135_.dta saved
(10 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_140_.dta saved
(10 real changes made)
s1 didn't run event_141_
(17 real changes made)
s1 didn't run event_145_
(18 real changes made)
s1 didn't run event_146_
(6 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_147_.dta saved
(16 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_149_.dta saved
(32 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_150_.dta saved
(19 real changes made)
s1 didn't run event_161_
(18 real changes made)
s1 didn't run event_162_
(16 real changes made)
s1 didn't run event_173_
(25 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_177_.dta saved
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_ev
> ent_183_.dta saved

. /////
> /// Repeat for S2 with 10 pre-treatment outcomes as predictors (couldn't) find a way to do i
> t more economically
> use DDCG_with_events, clear 

. xtset countrynum year
       panel variable:  countrynum (strongly balanced)
        time variable:  year, 1960 to 2010
                delta:  1 unit

. 
. foreach var of varlist  event_*{
  2. preserve
  3. quiet su year if `var'==1
  4. local t0 = r(mean)
  5. sca t0= r(mean)
  6. sca t10=t0-10
  7. sca t15=t0-15
  8. quiet su countrynum if `var'== 1
  9. sca tcountry=r(mean)
 10. replace `var'=1 if `var'==. & countrynum==tcountry
 11. quietly drop if `var'==.
 12. quietly drop if year<t10 // Critical 1
 13. egen countrynum2=group(country_name)
 14. order countrynum2 
 15. quiet su countrynum2 
 16. local mincountry=r(min)
 17. local maxcountry=r(max)
 18. forvalues i=`mincountry'/`maxcountry'{
 19. quiet su year if countrynum2==`i'
 20. local N=r(N)
 21. local N5= `N'-10 // Critical 2
 22. quiet su y if countrynum2==`i'
 23. if r(N)<`N5' {
 24. quietly drop if countrynum2==`i' 
 25. }
 26. else{
 27. }
 28. }
 29. */
. forvalues k=1/10{
 30. local t`k'=t0-`k'
 31. }
 32. local t0=t0
 33. local tcountry=tcountry
 34. //Controls must have y data for at least 10 years before treatment
. cap: quiet  synth  y y(`t1') y(`t2') y(`t3') y(`t4') y(`t5') y(`t6') y(`t7') y(`t8') y(`t9')
>  y(`t10') , trunit(`tcountry')  trperiod(`t0') keep("$auxdata/s2_`var'", replace) 
 35. if _rc==0{
 36. di "s2 did run `var'"
 37. use "$auxdata/s2_`var'", clear
 38. rename _Co_Number countrynum   
 39. rename _W_Weight weight 
 40. quietly keep countrynum weight
 41. quietly drop if countrynum==. & weight==.
 42. quietly merge 1:1 countrynum using "$auxdata/synth_`var'.dta"
 43. quietly drop _merge 
 44. save "$auxdata/synth2_weight_`var'.dta", replace 
 45. }
 46. else{
 47. di "s2 didn't run `var'"
 48. }
 49. restore
 50. }
(19 real changes made)
s2 didn't run event_18_
(2 real changes made)
s2 didn't run event_19_
(28 real changes made)
s2 didn't run event_20_
(25 real changes made)
s2 didn't run event_23_
(19 real changes made)
s2 didn't run event_25_
(7 real changes made)
s2 didn't run event_27_
(19 real changes made)
s2 didn't run event_31_
(20 real changes made)
s2 didn't run event_34_
(10 real changes made)
s2 didn't run event_41_
(36 real changes made)
s2 didn't run event_43_
(17 real changes made)
s2 didn't run event_44_
(32 real changes made)
s2 didn't run event_49_
(31 real changes made)
s2 didn't run event_50_
(28 real changes made)
s2 didn't run event_52_
(18 real changes made)
s2 didn't run event_55_
(15 real changes made)
s2 didn't run event_62_
(35 real changes made)
s2 didn't run event_65_
(26 real changes made)
s2 didn't run event_66_
(0 real changes made)
s2 didn't run event_68_
(18 real changes made)
s2 didn't run event_70_
(28 real changes made)
s2 didn't run event_72_
(20 real changes made)
s2 didn't run event_73_
(11 real changes made)
s2 didn't run event_76_
(8 real changes made)
s2 didn't run event_86_
(22 real changes made)
s2 didn't run event_88_
(17 real changes made)
s2 didn't run event_92_
(5 real changes made)
s2 didn't run event_93_
(6 real changes made)
s2 didn't run event_95_
(17 real changes made)
s2 didn't run event_97_
(19 real changes made)
s2 didn't run event_99_
(16 real changes made)
s2 didn't run event_101_
(18 real changes made)
s2 didn't run event_104_
(13 real changes made)
s2 didn't run event_108_
(16 real changes made)
s2 didn't run event_109_
(17 real changes made)
s2 didn't run event_110_
(16 real changes made)
s2 didn't run event_112_
(20 real changes made)
s2 didn't run event_119_
(16 real changes made)
s2 didn't run event_127_
(17 real changes made)
s2 didn't run event_129_
(23 real changes made)
s2 didn't run event_131_
(20 real changes made)
s2 didn't run event_132_
(34 real changes made)
s2 didn't run event_133_
(20 real changes made)
s2 didn't run event_135_
(10 real changes made)
s2 didn't run event_140_
(10 real changes made)
s2 didn't run event_141_
(17 real changes made)
s2 didn't run event_145_
(18 real changes made)
s2 didn't run event_146_
(6 real changes made)
s2 didn't run event_147_
(16 real changes made)
s2 didn't run event_149_
(32 real changes made)
s2 didn't run event_150_
(19 real changes made)
s2 didn't run event_161_
(18 real changes made)
s2 didn't run event_162_
(16 real changes made)
s2 didn't run event_173_
(25 real changes made)
s2 didn't run event_177_
(19 real changes made)
s2 didn't run event_183_

. 
. ////////////////////////////////
> //// ESTIMATE USING WEIGHTS 1///
> ////////////////////////////////
> 
. use DDCG_with_events, clear 

. foreach var of varlist event_*{
  2. 
. if "`var'"=="event_18_"{
  3. use "$auxdata/synth_weight_`var'.dta", clear
  4. }
  5. else{
  6. cap: append using "$auxdata/synth_weight_`var'.dta"
  7. }
  8. }

. 
. foreach var of varlist synth_event_*{
  2. replace `var'=0 if `var'==.
  3. }
(1,053 real changes made)
(1,038 real changes made)
(1,052 real changes made)
(1,053 real changes made)
(1,053 real changes made)
(1,041 real changes made)
(1,053 real changes made)
(1,054 real changes made)
(1,042 real changes made)
(1,050 real changes made)
(1,051 real changes made)
(1,052 real changes made)
(1,052 real changes made)
(1,047 real changes made)
(1,050 real changes made)
(1,038 real changes made)
(1,052 real changes made)
(1,052 real changes made)
(1,054 real changes made)
(1,044 real changes made)
(1,041 real changes made)
(1,054 real changes made)
(1,052 real changes made)
(1,039 real changes made)
(1,040 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,045 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,050 real changes made)
(1,054 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,054 real changes made)
(1,050 real changes made)
(1,054 real changes made)
(1,042 real changes made)
(1,040 real changes made)
(1,050 real changes made)
(1,050 real changes made)
(1,053 real changes made)
(1,053 real changes made)

. 
. replace weight=1 if weight==.
(43 real changes made)

. //// Estimation
> 
. forvalues s=0/45{
  2. quiet reg ydep`s' tdemoc lag* i.synth_event_*   [aw=weight], cluster(countrynum)
  3. if `s'==0{
  4. mat ests=(_b[tdemoc], r(table)[5,1],r(table)[6,1])
  5. }
  6. else{
  7. mat ests=ests\(_b[tdemoc], r(table)[5,1],r(table)[6,1])
  8. mat colnames ests="b" "ll" "ul"
  9. }
 10. }

. 
. svmat ests

. cap drop yad

. gen yad=. 
(1,074 missing values generated)

. forvalues i=0/45{
  2. local k=`i'-14
  3. local j=`i'+1
  4. replace yad=`k' in `j'
  5. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. line ests1 yad, lcolor(black) scheme(s1color) xtitle(Years around democratization) ytitle(Ch
> ange in GDP per capita log points) yline(0, lcolor(black) lpattern(dash))||line ests2 yad,  
> lcolor(gray) lpattern(dash)||line ests3 yad,  lcolor(gray) lpattern(dash) legend(off)

. graph export "$figures/part5s1_weights.png", replace
(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part5s1_weight
> s.png written in PNG format)

. 
. ////////////////////////////////
> //// ESTIMATE USING WEIGHTS 2///
> ////////////////////////////////
> 
. 
. use DDCG_with_events, clear 

. foreach var of varlist event_*{
  2. 
. if "`var'"=="event_18_"{
  3. use "$auxdata/synth2_weight_`var'.dta", clear
  4. }
  5. else{
  6. cap: append using "$auxdata/synth2_weight_`var'.dta"
  7. }
  8. }

. 
. foreach var of varlist synth_event_*{
  2. replace `var'=0 if `var'==.
  3. }
(1,053 real changes made)
(1,038 real changes made)
(1,052 real changes made)
(1,053 real changes made)
(1,053 real changes made)
(1,041 real changes made)
(1,053 real changes made)
(1,054 real changes made)
(1,042 real changes made)
(1,050 real changes made)
(1,051 real changes made)
(1,052 real changes made)
(1,052 real changes made)
(1,047 real changes made)
(1,050 real changes made)
(1,038 real changes made)
(1,052 real changes made)
(1,052 real changes made)
(1,054 real changes made)
(1,044 real changes made)
(1,041 real changes made)
(1,054 real changes made)
(1,052 real changes made)
(1,039 real changes made)
(1,040 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,045 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,050 real changes made)
(1,054 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,054 real changes made)
(1,050 real changes made)
(1,054 real changes made)
(1,042 real changes made)
(1,040 real changes made)
(1,050 real changes made)
(1,050 real changes made)
(1,053 real changes made)
(1,053 real changes made)

. 
. replace weight=1 if weight==.
(43 real changes made)

. //// Estimation
> 
. forvalues s=0/45{
  2. quiet reg ydep`s' tdemoc lag* i.synth_event_*   [aw=weight], cluster(countrynum)
  3. if `s'==0{
  4. mat ests=(_b[tdemoc], r(table)[5,1],r(table)[6,1])
  5. }
  6. else{
  7. mat ests=ests\(_b[tdemoc], r(table)[5,1],r(table)[6,1])
  8. mat colnames ests="b" "ll" "ul"
  9. }
 10. }

. 
. svmat ests

. cap drop yad

. gen yad=. 
(1,074 missing values generated)

. forvalues i=0/45{
  2. local k=`i'-14
  3. local j=`i'+1
  4. replace yad=`k' in `j'
  5. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. line ests1 yad, lcolor(black) scheme(s1color) xtitle(Years around democratization) ytitle(Ch
> ange in GDP per capita log points) yline(0, lcolor(black) lpattern(dash))||line ests2 yad,  
> lcolor(gray) lpattern(dash)||line ests3 yad,  lcolor(gray) lpattern(dash) legend(off)

. graph export "$figures/part5s2_weights.png", replace
(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part5s2_weight
> s.png written in PNG format)

. 
. 
. ********************
. ****** PART 6*******
. ********************
. 
end of do-file

. log close
      name:  <unnamed>
       log:  C:\Users\User\Documents\GitHub\797b-problem-sets\DDCG_Replication\JL_replication_
> final_real.log
  log type:  text
 closed on:   4 Dec 2020, 20:28:59
----------------------------------------------------------------------------------------------
