{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\User\Documents\GitHub\797b-problem-sets\DDCG_Replication\JL_replication_final.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Dec 2020, 19:02:35

{com}. do "C:\Users\User\AppData\Local\Temp\STD1c0_000000.tmp"
{txt}
{com}. //                      797B JesÃºs Lara                 ///
. ///     Critical Replication and extension of   ///
> ///DDCG by Acemoglu, Naidu, Restrepo & Robinson (2018) ///
> 
. clear all
{res}{txt}
{com}. 
. global home "C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication"
{txt}
{com}. global tables "$home/tables"
{txt}
{com}. global figures "$home/figures"
{txt}
{com}. global auxdata "$home/auxdata"
{txt}
{com}. global numbers "$home/numbers"
{txt}
{com}. cd $home
{res}C:\Users\User\Documents\GitHub\797b-problem-sets\DDCG_Replication
{txt}
{com}. use DDCGdata_final, clear
{txt}
{com}. xtset wbcode2 year
{res}{txt}{col 8}panel variable:  {res}wbcode2 (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1960 to 2010
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. 
. 
. *******PART 1****************************
. ****************************************
. ****************************************
. *******PART 1****************************
. ****************************************
. ****************************************
. ****************************************
. ****** PART 1***************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 1***************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 1*************************
. ****************************************
. ****************************************
. xtset wbcode2 year
{res}{txt}{col 8}panel variable:  {res}wbcode2 (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1960 to 2010
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. /// Program to calculate LR effect of democracy 
> 
. capture program drop dynamiceffects
{txt}
{com}.                 program define dynamiceffects, eclass
{txt}  1{com}.                 quietly: nlcom (effect1: _b[democracy]) ///
>                           (democracy: _b[democracy]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post
{txt}  2{com}. 
.                 quietly: nlcom (effect2: _b[effect1]*_b[lag1]+_b[democracy]) ///
>                           (effect1: _b[effect1]) ///
>                           (democracy: _b[democracy]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post
{txt}  3{com}. 
.                 quietly: nlcom (effect3: _b[effect2]*_b[lag1]+_b[effect1]*_b[lag2]+_b[democracy]) ///
>                           (effect2: _b[effect2]) ///
>                           (effect1: _b[effect1]) ///
>                           (democracy: _b[democracy]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post
{txt}  4{com}.                           
.                 quietly: nlcom (effect4: _b[effect3]*_b[lag1]+_b[effect2]*_b[lag2]+_b[effect1]*_b[lag3]+_b[democracy]) ///
>                           (effect3: _b[effect3]) ///
>                           (effect2: _b[effect2]) ///
>                           (effect1: _b[effect1]) ///
>                           (democracy: _b[democracy]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post          
{txt}  5{com}.                 
.                 forvalues j=5(1)25{c -(}       
{txt}  6{com}.                 local j1=`j'-1
{txt}  7{com}.                 local j2=`j'-2
{txt}  8{com}.                 local j3=`j'-3
{txt}  9{com}.                 local j4=`j'-4
{txt} 10{com}. 
.                 quietly: nlcom (effect`j': _b[effect`j1']*_b[lag1]+_b[effect`j2']*_b[lag2]+_b[effect`j3']*_b[lag3]+_b[effect`j4']*_b[lag4]+_b[democracy]) ///
>                           (effect`j1': _b[effect`j1']) ///
>                           (effect`j2': _b[effect`j2']) ///
>                           (effect`j3': _b[effect`j3']) ///
>                           (democracy: _b[democracy]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post                  
{txt} 11{com}. 
.                 {c )-}
{txt} 12{com}. 
.                 quietly: nlcom (effect25: _b[effect25]) ///
>                           (longrun: _b[democracy]/(1-_b[lag1]-_b[lag2]-_b[lag3]-_b[lag4])) ///
>                           (democracy: _b[democracy]) ///
>                           (persistence: _b[lag1]+_b[lag2]+_b[lag3]+_b[lag4]) ///
>                           (lag1: _b[lag1]) ///
>                           (lag2: _b[lag2]) ///
>                           (lag3: _b[lag3]) ///
>                           (lag4: _b[lag4]) ///
>                           , post
{txt} 13{com}.                 ereturn display
{txt} 14{com}.                 end
{txt}
{com}. 
. /// Replication of table 2
> /////////////////////////////
> 
. quietly{c -(}
{txt}
{com}. 
. esttab T2_1 T2_2 T2_3 using "$tables/Table2.tex", keep(dem  L.y  L2.y  L3.y  L4.y) varlabels(dem "Democracy" L.y "Log GDP, first lag" L2.y "Log GDP, second lag" L3.y "Log GDP, third lag" L4.y "Log GDP, fourth lag") fragment nonum noobs nonotes mlabels("(1)" "(2)" "(3)") b(3) se ty replace nostar  wrap gaps
{res}
            &         (1)&         (2)&         (3)\\
\hline
Democracy   &       0.973&       0.651&       0.787\\
            &     (0.294)&     (0.248)&     (0.226)\\
Log GDP,    &       0.973&       1.266&       1.238\\
first lag   &     (0.006)&     (0.038)&     (0.038)\\
Log GDP,    &            &      -0.300&      -0.207\\
second lag  &            &     (0.037)&     (0.046)\\
Log GDP,    &            &            &      -0.026\\
third lag   &            &            &     (0.028)\\
Log GDP,    &            &            &      -0.043\\
fourth lag  &            &            &     (0.017)\\
{txt}(output written to {browse  `"C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/Table2.tex"'})

{com}. 
. esttab T2_1a T2_2a T2_3a using "$tables/Table2.tex", varlabels (longrun "Long-run effect of democracy" persistence "Persistence") fragment noobs nonum nonotes  b(3) se ty append nostar nomtitles nolines wrap gaps
{res}
[1em]
Long-run    &      35.587&      19.599&      21.240\\
effect of democracy&    (13.998)&     (8.595)&     (7.215)\\
Persistence &       0.973&       0.967&       0.963\\
            &     (0.006)&     (0.005)&     (0.005)\\
{txt}(output written to {browse  `"C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/Table2.tex"'})

{com}. 
. esttab T2_1aa T2_2aa T2_3aa using "$tables/Table2.tex", keep(effect25) varlabels(effect25 "Effect of democracy: 25 years") fragment noobs nonum nonotes  b(3) se ty append nostar nomtitles nolines wrap gaps
{res}
[1em]
Effect of   &      17.791&      13.800&      16.895\\
democracy: 25 years&     (5.649)&     (5.550)&     (5.297)\\
{txt}(output written to {browse  `"C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/Table2.tex"'})

{com}. 
. ////////////////////////
> /// UNIT ROOTS TESTS ///
> ////////////////////////
> capture program drop unitroot
{txt}
{com}. program define unitroot, rclass
{txt}  1{com}. syntax anything[, lags(integer 3) varalt mumain(real -.53796) sigmamain(real .85408)]
{txt}  2{com}.         local 0 `anything' 
{txt}  3{com}.         gettoken yvar 0 : 0
{txt}  4{com}.         gettoken excov 0 : 0, match(par) 
{txt}  5{com}.         gettoken bpvar 0 : 0, match(par) 
{txt}  6{com}.         
. quietly: if `lags'>=1{c -(}
{txt}  7{com}. reg d.`yvar' l(1/`lags').d.`yvar' yy* i.wbcode2 `excov'
{txt}  8{com}. {c )-}
{txt}  9{com}. quietly: if `lags'==0{c -(}
{txt} 10{com}. reg d.`yvar' yy* i.wbcode2 `excov'
{txt} 11{com}. {c )-}
{txt} 12{com}. quietly: predict e if e(sample), resid
{txt} 13{com}. 
. if `lags'==0{c -(}
{txt} 14{com}. return scalar SA=1
{txt} 15{com}. local SA=1
{txt} 16{com}. {c )-}
{txt} 17{com}. if `lags'==1{c -(}
{txt} 18{com}. return scalar SA=1/abs(1-(_b[LD.`yvar']))
{txt} 19{com}. local SA=1/abs(1-(_b[LD.`yvar']))
{txt} 20{com}. {c )-}
{txt} 21{com}. if `lags'==2{c -(}
{txt} 22{com}. return scalar SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']))
{txt} 23{com}. local  SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']))
{txt} 24{com}. {c )-}
{txt} 25{com}. if `lags'==3{c -(}
{txt} 26{com}. return scalar SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']+_b[L3D.`yvar']))
{txt} 27{com}. local SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']+_b[L3D.`yvar']))
{txt} 28{com}. {c )-}
{txt} 29{com}. if `lags'==4{c -(}
{txt} 30{com}. return scalar SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']+_b[L3D.`yvar']+_b[L4D.`yvar']))
{txt} 31{com}. local SA=1/abs(1-(_b[LD.`yvar']+_b[L2D.`yvar']+_b[L3D.`yvar']+_b[L4D.`yvar']))
{txt} 32{com}. {c )-}
{txt} 33{com}. 
. quietly: if `lags'>=1{c -(}
{txt} 34{com}. reg l.`yvar' l(1/`lags').d.`yvar' yy* i.wbcode2 `excov'
{txt} 35{com}. {c )-}
{txt} 36{com}. quietly: if `lags'==0{c -(}
{txt} 37{com}. reg l.`yvar'  yy* i.wbcode2 `excov'
{txt} 38{com}. {c )-}
{txt} 39{com}. quietly: predict v if e(sample), resid
{txt} 40{com}. 
. quietly: if `lags'>=1{c -(}
{txt} 41{com}. reg d.`yvar' l.`yvar' l(1/`lags').d.`yvar' yy* i.wbcode2
{txt} 42{com}. {c )-}
{txt} 43{com}. quietly: if `lags'==0{c -(}
{txt} 44{com}. reg d.`yvar' l.`yvar' yy* i.wbcode2
{txt} 45{com}. {c )-}
{txt} 46{com}. quietly: predict residual if e(sample), resid
{txt} 47{com}. quietly: gen res2=residual^2
{txt} 48{com}. quietly: bysort wbcode2: egen vari=mean(res2)
{txt} 49{com}. quietly: gen sigmai=sqrt(vari)
{txt} 50{com}. 
. quietly: gen e_est=e/sigmai
{txt} 51{com}. quietly: gen v_est=v/sigmai
{txt} 52{com}. 
. quietly: reg e_est v_est, noconstant
{txt} 53{com}. return scalar tdelta=_b[v_est]/_se[v_est]
{txt} 54{com}. return scalar stddelta=_se[v_est]
{txt} 55{com}. local tdelta=_b[v_est]/_se[v_est]
{txt} 56{com}. local stddelta=_se[v_est]
{txt} 57{com}. 
. quietly: predict z if e(sample), resid
{txt} 58{com}. quietly: gen z2=z^2
{txt} 59{com}. quietly: sum z2
{txt} 60{com}. return scalar sigma2=r(mean)
{txt} 61{com}. return scalar num=r(N)
{txt} 62{com}. local sigma2=r(mean)
{txt} 63{com}. local num=r(N)
{txt} 64{com}. 
. local tadjmain=(`tdelta'-`num'*`SA'*`stddelta'*`mumain'/`sigma2')/`sigmamain'
{txt} 65{com}. return scalar pvalmain=normal(`tadjmain')
{txt} 66{com}. return scalar  tadjmain=(`tdelta'-`num'*`SA'*`stddelta'*`mumain'/`sigma2')/`sigmamain'
{txt} 67{com}. 
. drop e v residual res2 vari sigmai e_est v_est z z2
{txt} 68{com}. end
{txt}
{com}. 
. foreach i of numlist 0 1 3{c -(}
{txt}  2{com}. 
. unitroot y (dem) (), lags(`i')
{txt}  3{com}. local t`i'lag= r(tadjmain)
{txt}  4{com}. local t`i'lagc: display %9.2f `t`i'lag' 
{txt}  5{com}. 
. file open myfile using ${c -(}numbers{c )-}/t`i'lagc.tex, ///
>  write text replace 
{txt}  6{com}. file write myfile "`t`i'lagc'" 
{txt}  7{com}. file close myfile
{txt}  8{com}. 
. {c )-}
{txt}
{com}. 
. foreach i of numlist 0 1 3{c -(}
{txt}  2{com}. 
. unitroot y (dem) (), lags(`i')
{txt}  3{com}. local p`i'lag= r(pvalmain)
{txt}  4{com}. local p`i'lagc: display %9.2f `p`i'lag' 
{txt}  5{com}. 
. file open myfile using ${c -(}numbers{c )-}/p`i'lagc.tex, ///
>  write text replace 
{txt}  6{com}. file write myfile "`p`i'lagc'" 
{txt}  7{com}. file close myfile
{txt}  8{com}. {c )-}
{txt}
{com}. 
. ///////////////////////////////
> // Replication of table 5/////
. //////////////////////////////
> 
. // Generate Treatment democracy variable td
. 
. use DDCGdata_final, clear
{txt}
{com}. gen tdemoc=.  
{txt}(9,384 missing values generated)

{com}. replace tdemoc=1 if dem==1 & l.dem==0 // captures the exact moment when a country transitions to democracy
{txt}(122 real changes made)

{com}. replace tdemoc=0 if dem==0 & l.dem==0  // countries that have never been a democracy
{txt}(4,768 real changes made)

{com}. // 4 lags in GDP. These will be covariates in our regression
. forvalues i=1/4{c -(}
{txt}  2{com}. gen lag`i'y=l`i'.y
{txt}  3{com}. {c )-}
{txt}(2,405 missing values generated)
(2,578 missing values generated)
(2,752 missing values generated)
(2,927 missing values generated)

{com}. keep if lag1y!=. & lag2y!=. & lag3y!=. & lag4y!=.
{txt}(2,930 observations deleted)

{com}. 
. // 15 lags (15 years previous dem)
. forvalues i=0/15{c -(}
{txt}  2{com}. local k =15-`i'
{txt}  3{com}. gen ydep`i'=L`k'.y-L.y
{txt}  4{com}. {c )-}
{txt}(2,594 missing values generated)
(2,426 missing values generated)
(2,257 missing values generated)
(2,087 missing values generated)
(1,916 missing values generated)
(1,745 missing values generated)
(1,572 missing values generated)
(1,399 missing values generated)
(1,225 missing values generated)
(1,050 missing values generated)
(875 missing values generated)
(700 missing values generated)
(525 missing values generated)
(350 missing values generated)
(175 missing values generated)
(186 missing values generated)

{com}. 
. // 30 leads
. forvalues i=16/45{c -(}
{txt}  2{com}. local k=`i'-15
{txt}  3{com}. gen ydep`i'=F`k'.y-L.y
{txt}  4{com}. {c )-}
{txt}(361 missing values generated)
(536 missing values generated)
(711 missing values generated)
(886 missing values generated)
(1,061 missing values generated)
(1,235 missing values generated)
(1,408 missing values generated)
(1,581 missing values generated)
(1,753 missing values generated)
(1,924 missing values generated)
(2,095 missing values generated)
(2,265 missing values generated)
(2,434 missing values generated)
(2,602 missing values generated)
(2,769 missing values generated)
(2,933 missing values generated)
(3,085 missing values generated)
(3,236 missing values generated)
(3,385 missing values generated)
(3,531 missing values generated)
(3,675 missing values generated)
(3,816 missing values generated)
(3,954 missing values generated)
(4,092 missing values generated)
(4,227 missing values generated)
(4,357 missing values generated)
(4,477 missing values generated)
(4,596 missing values generated)
(4,714 missing values generated)
(4,828 missing values generated)

{com}. 
. order country_name tdemoc year y ydep*
{txt}
{com}. keep if tdemoc!=.
{txt}(3,418 observations deleted)

{com}. // tdemoc is missing value if country is democracy and was democracy the period before
. // We will have only observations of: nondemocracy and exact transition (including reversals)
. 
. 
. set seed 12345                       
{txt}
{com}. 
. ////////////////////////
> // CREATE PROGRAMS/////
. ///////////////////////
> 
. /////////////////////////////
> /// A. REGRESSION ADJUSTMENT PROGRAM
> capture program ra, eclass
{txt}
{com}. ////////////
> ////////////
> 
. // B. PSR PROGRAM/////
. //////////////////////
> capture program psr, eclass
{txt}
{com}. 
. //////////////////////////
> //C. DOUBLY ROBUST PROGRAM
. //////////////////////////
> 
. capture program drop dr
{txt}
{com}. program dr, eclass
{txt}  1{com}. /* year -15 */
. quietly: gen temp=tdemoc if ydep0!=. &tdemoc!=.
{txt}  2{com}. quietly: bysort year: egen mtemp=max(temp)
{txt}  3{com}. quietly: tab year if mtemp==1, gen(dumyears)
{txt}  4{com}. cap: teffects ipwra (ydep0 lag1y lag2y lag3y lag4y dumyears*, noconstant) (tdemoc lag1y lag2y lag3y lag4y dumyears*, probit), atet iterate(7)
{txt}  5{com}. if _rc==0{c -(}
{txt}  6{com}. matrix b=_b[ATET: r1vs0.tdemoc]
{txt}  7{com}. {c )-}
{txt}  8{com}. else{c -(}
{txt}  9{com}. matrix b=(.)
{txt} 10{com}. {c )-}
{txt} 11{com}. quietly: drop dumyears* temp mtemp
{txt} 12{com}. /* years -14 to -5 */
. forvalues s=1(1)10{c -(}
{txt} 13{com}. quietly: gen temp=tdemoc if ydep`s'!=. &tdemoc!=.
{txt} 14{com}. quietly: bysort year: egen mtemp=max(temp)
{txt} 15{com}. quietly: tab year if mtemp==1, gen(dumyears)
{txt} 16{com}. cap: teffects ipwra (ydep`s' lag1y lag2y lag3y lag4y dumyears*, noconstant) (tdemoc lag1y lag2y lag3y lag4y dumyears*, probit), atet iterate(7)
{txt} 17{com}. if _rc==0{c -(}
{txt} 18{com}. matrix b=(b, _b[ATET: r1vs0.tdemoc])
{txt} 19{com}. {c )-}
{txt} 20{com}. else{c -(}
{txt} 21{com}. matrix b=(b, .)
{txt} 22{com}. {c )-}
{txt} 23{com}. quietly: drop dumyears* temp mtemp
{txt} 24{com}. {c )-}
{txt} 25{com}. /*  years -4, -3, -2, -1  */
. matrix b=(b, 0, 0, 0, 0)
{txt} 26{com}. /* year 0 to 30 */
. forvalues s=15(1)45{c -(}
{txt} 27{com}. quietly: gen temp=tdemoc if ydep`s'!=. &tdemoc!=.
{txt} 28{com}. quietly: bysort year: egen mtemp=max(temp)
{txt} 29{com}. quietly: tab year if mtemp==1, gen(dumyears)
{txt} 30{com}. cap: teffects ipwra (ydep`s' lag1y lag2y lag3y lag4y dumyears*, noconstant) (tdemoc lag1y lag2y lag3y lag4y dumyears*, probit), atet iterate(7)
{txt} 31{com}. if _rc==0{c -(}
{txt} 32{com}. matrix b=(b, _b[ATET: r1vs0.tdemoc])
{txt} 33{com}. {c )-}
{txt} 34{com}. else{c -(}
{txt} 35{com}. matrix b=(b, .)
{txt} 36{com}. {c )-}
{txt} 37{com}. quietly: drop dumyears* temp mtemp
{txt} 38{com}. {c )-}
{txt} 39{com}. ereturn post b
{txt} 40{com}. end
{txt}
{com}. 
. //////////////////
> ////ESTIMATION ///
> //////////////////
> set seed 12345
{txt}
{com}. //// A. Adjustment regression 
> xtset, clear
{txt}
{com}. bootstrap _b, reps(20) cluster(wbcode2): ra 
{txt}(running {bf:ra} on estimation sample)

{p 0 10 2} Warning:  Because {cmd:ra} is not an estimation command or does not set {cmd:e(sample)}, {cmd:bootstrap} has no way to determine which observations are used in calculating the statistics and so assumes that all observations are used.  This means that no observations will be excluded from the resampling because of missing values or other reasons.{p_end}

{p 10 10 2} If the assumption is not true, press Break, save the data, and drop the observations that are to be excluded. 
Be sure that the dataset in memory contains only the relevant data.{p_end}

Bootstrap replications ({res}20{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
....................
{res}
{txt}Bootstrap results{col 49}Number of obs{col 67}= {res}     3,036
{txt}{col 49}Replications{col 67}= {res}        20

{txt}{ralign 78:(Replications based on {res:126} clusters in wbcode2)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}c1 {c |}{col 14}{res}{space 2}-1.208078{col 26}{space 2} 3.921871{col 37}{space 1}   -0.31{col 46}{space 3}0.758{col 54}{space 4}-8.894803{col 67}{space 3} 6.478648
{txt}{space 10}c2 {c |}{col 14}{res}{space 2}-3.049757{col 26}{space 2} 3.701891{col 37}{space 1}   -0.82{col 46}{space 3}0.410{col 54}{space 4}-10.30533{col 67}{space 3} 4.205816
{txt}{space 10}c3 {c |}{col 14}{res}{space 2}-2.150273{col 26}{space 2} 3.627301{col 37}{space 1}   -0.59{col 46}{space 3}0.553{col 54}{space 4}-9.259652{col 67}{space 3} 4.959106
{txt}{space 10}c4 {c |}{col 14}{res}{space 2} -1.97831{col 26}{space 2} 3.866623{col 37}{space 1}   -0.51{col 46}{space 3}0.609{col 54}{space 4}-9.556753{col 67}{space 3} 5.600132
{txt}{space 10}c5 {c |}{col 14}{res}{space 2}-2.776327{col 26}{space 2}  3.70813{col 37}{space 1}   -0.75{col 46}{space 3}0.454{col 54}{space 4}-10.04413{col 67}{space 3} 4.491475
{txt}{space 10}c6 {c |}{col 14}{res}{space 2}-3.338203{col 26}{space 2} 3.327435{col 37}{space 1}   -1.00{col 46}{space 3}0.316{col 54}{space 4}-9.859855{col 67}{space 3}  3.18345
{txt}{space 10}c7 {c |}{col 14}{res}{space 2}-1.807659{col 26}{space 2} 2.885049{col 37}{space 1}   -0.63{col 46}{space 3}0.531{col 54}{space 4}-7.462251{col 67}{space 3} 3.846932
{txt}{space 10}c8 {c |}{col 14}{res}{space 2}-1.862079{col 26}{space 2} 2.322572{col 37}{space 1}   -0.80{col 46}{space 3}0.423{col 54}{space 4}-6.414237{col 67}{space 3} 2.690078
{txt}{space 10}c9 {c |}{col 14}{res}{space 2}-1.662993{col 26}{space 2} 1.691257{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 54}{space 4}-4.977796{col 67}{space 3} 1.651811
{txt}{space 9}c10 {c |}{col 14}{res}{space 2}-.9274664{col 26}{space 2} 1.161995{col 37}{space 1}   -0.80{col 46}{space 3}0.425{col 54}{space 4}-3.204935{col 67}{space 3} 1.350003
{txt}{space 9}c11 {c |}{col 14}{res}{space 2}  .300876{col 26}{space 2} .7897657{col 37}{space 1}    0.38{col 46}{space 3}0.703{col 54}{space 4}-1.247036{col 67}{space 3} 1.848788
{txt}{space 9}c12 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}c13 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}c14 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}c15 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}c16 {c |}{col 14}{res}{space 2} .3777393{col 26}{space 2} .7358853{col 37}{space 1}    0.51{col 46}{space 3}0.608{col 54}{space 4}-1.064569{col 67}{space 3} 1.820048
{txt}{space 9}c17 {c |}{col 14}{res}{space 2}  2.07734{col 26}{space 2} 1.328555{col 37}{space 1}    1.56{col 46}{space 3}0.118{col 54}{space 4}-.5265801{col 67}{space 3} 4.681261
{txt}{space 9}c18 {c |}{col 14}{res}{space 2} 2.868402{col 26}{space 2} 2.042439{col 37}{space 1}    1.40{col 46}{space 3}0.160{col 54}{space 4}-1.134706{col 67}{space 3} 6.871509
{txt}{space 9}c19 {c |}{col 14}{res}{space 2} 3.456062{col 26}{space 2} 2.488447{col 37}{space 1}    1.39{col 46}{space 3}0.165{col 54}{space 4}-1.421205{col 67}{space 3} 8.333329
{txt}{space 9}c20 {c |}{col 14}{res}{space 2} 3.491263{col 26}{space 2} 2.579247{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4}-1.563968{col 67}{space 3} 8.546495
{txt}{space 9}c21 {c |}{col 14}{res}{space 2} 3.262353{col 26}{space 2} 2.659932{col 37}{space 1}    1.23{col 46}{space 3}0.220{col 54}{space 4}-1.951018{col 67}{space 3} 8.475724
{txt}{space 9}c22 {c |}{col 14}{res}{space 2}  3.46428{col 26}{space 2} 2.958152{col 37}{space 1}    1.17{col 46}{space 3}0.242{col 54}{space 4} -2.33359{col 67}{space 3} 9.262151
{txt}{space 9}c23 {c |}{col 14}{res}{space 2} 3.270084{col 26}{space 2} 3.237135{col 37}{space 1}    1.01{col 46}{space 3}0.312{col 54}{space 4}-3.074585{col 67}{space 3} 9.614752
{txt}{space 9}c24 {c |}{col 14}{res}{space 2}  3.36042{col 26}{space 2} 3.586432{col 37}{space 1}    0.94{col 46}{space 3}0.349{col 54}{space 4}-3.668859{col 67}{space 3}  10.3897
{txt}{space 9}c25 {c |}{col 14}{res}{space 2}   4.7467{col 26}{space 2} 3.669438{col 37}{space 1}    1.29{col 46}{space 3}0.196{col 54}{space 4}-2.445266{col 67}{space 3} 11.93867
{txt}{space 9}c26 {c |}{col 14}{res}{space 2} 5.014282{col 26}{space 2} 4.096077{col 37}{space 1}    1.22{col 46}{space 3}0.221{col 54}{space 4} -3.01388{col 67}{space 3} 13.04244
{txt}{space 9}c27 {c |}{col 14}{res}{space 2} 7.002995{col 26}{space 2} 4.531279{col 37}{space 1}    1.55{col 46}{space 3}0.122{col 54}{space 4} -1.87815{col 67}{space 3} 15.88414
{txt}{space 9}c28 {c |}{col 14}{res}{space 2} 8.368105{col 26}{space 2} 4.860687{col 37}{space 1}    1.72{col 46}{space 3}0.085{col 54}{space 4}-1.158667{col 67}{space 3} 17.89488
{txt}{space 9}c29 {c |}{col 14}{res}{space 2} 8.461492{col 26}{space 2} 5.160911{col 37}{space 1}    1.64{col 46}{space 3}0.101{col 54}{space 4}-1.653708{col 67}{space 3} 18.57669
{txt}{space 9}c30 {c |}{col 14}{res}{space 2} 10.18277{col 26}{space 2} 5.587624{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-.7687676{col 67}{space 3} 21.13432
{txt}{space 9}c31 {c |}{col 14}{res}{space 2}  12.3585{col 26}{space 2} 5.300016{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} 1.970658{col 67}{space 3} 22.74634
{txt}{space 9}c32 {c |}{col 14}{res}{space 2} 10.65862{col 26}{space 2} 5.786623{col 37}{space 1}    1.84{col 46}{space 3}0.065{col 54}{space 4}-.6829546{col 67}{space 3} 22.00019
{txt}{space 9}c33 {c |}{col 14}{res}{space 2} 14.73963{col 26}{space 2} 6.333776{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} 2.325654{col 67}{space 3}  27.1536
{txt}{space 9}c34 {c |}{col 14}{res}{space 2} 16.14008{col 26}{space 2} 6.075308{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} 4.232698{col 67}{space 3} 28.04747
{txt}{space 9}c35 {c |}{col 14}{res}{space 2} 16.28586{col 26}{space 2} 6.564325{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} 3.420021{col 67}{space 3}  29.1517
{txt}{space 9}c36 {c |}{col 14}{res}{space 2} 18.95624{col 26}{space 2} 7.913895{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4} 3.445296{col 67}{space 3} 34.46719
{txt}{space 9}c37 {c |}{col 14}{res}{space 2} 24.93348{col 26}{space 2} 7.892423{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4} 9.464619{col 67}{space 3} 40.40235
{txt}{space 9}c38 {c |}{col 14}{res}{space 2} 25.40744{col 26}{space 2} 8.122826{col 37}{space 1}    3.13{col 46}{space 3}0.002{col 54}{space 4} 9.486989{col 67}{space 3} 41.32788
{txt}{space 9}c39 {c |}{col 14}{res}{space 2} 25.61797{col 26}{space 2} 8.612535{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4} 8.737715{col 67}{space 3} 42.49823
{txt}{space 9}c40 {c |}{col 14}{res}{space 2} 25.45834{col 26}{space 2} 8.578745{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4}  8.64431{col 67}{space 3} 42.27237
{txt}{space 9}c41 {c |}{col 14}{res}{space 2} 23.58824{col 26}{space 2}  8.64853{col 37}{space 1}    2.73{col 46}{space 3}0.006{col 54}{space 4} 6.637434{col 67}{space 3} 40.53905
{txt}{space 9}c42 {c |}{col 14}{res}{space 2} 22.02303{col 26}{space 2} 7.950259{col 37}{space 1}    2.77{col 46}{space 3}0.006{col 54}{space 4} 6.440808{col 67}{space 3} 37.60525
{txt}{space 9}c43 {c |}{col 14}{res}{space 2} 21.10831{col 26}{space 2} 8.564835{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} 4.321542{col 67}{space 3} 37.89508
{txt}{space 9}c44 {c |}{col 14}{res}{space 2} 19.76782{col 26}{space 2} 8.553387{col 37}{space 1}    2.31{col 46}{space 3}0.021{col 54}{space 4} 3.003487{col 67}{space 3} 36.53215
{txt}{space 9}c45 {c |}{col 14}{res}{space 2} 20.06104{col 26}{space 2} 10.29143{col 37}{space 1}    1.95{col 46}{space 3}0.051{col 54}{space 4}-.1097939{col 67}{space 3} 40.23188
{txt}{space 9}c46 {c |}{col 14}{res}{space 2} 19.54404{col 26}{space 2} 10.18456{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}-.4173356{col 67}{space 3} 39.50541
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. parmest, format(estimate min95 max95) saving("$auxdata/ra", replace)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/ra.dta saved

{com}. eststo main_ra
{txt}
{com}. // Get 5 year averages
. nlcom (ra: (_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5), post

          {txt}ra:  {res}(_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ra {c |}{col 14}{res}{space 2} .0601752{col 26}{space 2} .1579531{col 37}{space 1}    0.38{col 46}{space 3}0.703{col 54}{space 4}-.2494073{col 67}{space 3} .3697576
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo ra1
{txt}
{com}. 
. estimates restore main_ra
{txt}(results {stata estimates replay main_ra:main_ra} are active now)

{com}. nlcom (ra: (_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5), post

          {txt}ra:  {res}(_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ra {c |}{col 14}{res}{space 2} 2.454161{col 26}{space 2} 1.749341{col 37}{space 1}    1.40{col 46}{space 3}0.161{col 54}{space 4}-.9744845{col 67}{space 3} 5.882807
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo ra2 
{txt}
{com}. 
. estimates restore main_ra
{txt}(results {stata estimates replay main_ra:main_ra} are active now)

{com}. nlcom (ra: (_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5), post

          {txt}ra:  {res}(_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ra {c |}{col 14}{res}{space 2} 3.620767{col 26}{space 2} 3.182696{col 37}{space 1}    1.14{col 46}{space 3}0.255{col 54}{space 4}-2.617202{col 67}{space 3} 9.858736
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo ra3 
{txt}
{com}. 
. estimates restore main_ra
{txt}(results {stata estimates replay main_ra:main_ra} are active now)

{com}. nlcom (ra: (_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5), post

          {txt}ra:  {res}(_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ra {c |}{col 14}{res}{space 2}  7.80593{col 26}{space 2} 4.780116{col 37}{space 1}    1.63{col 46}{space 3}0.102{col 54}{space 4}-1.562926{col 67}{space 3} 17.17479
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo ra4 
{txt}
{com}. 
. estimates restore main_ra
{txt}(results {stata estimates replay main_ra:main_ra} are active now)

{com}. nlcom (ra: (_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5), post

          {txt}ra:  {res}(_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ra {c |}{col 14}{res}{space 2} 14.03654{col 26}{space 2} 5.805075{col 37}{space 1}    2.42{col 46}{space 3}0.016{col 54}{space 4}   2.6588{col 67}{space 3} 25.41428
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo ra5 
{txt}
{com}. 
. estimates restore main_ra
{txt}(results {stata estimates replay main_ra:main_ra} are active now)

{com}. nlcom (ra: (_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5), post

          {txt}ra:  {res}(_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ra {c |}{col 14}{res}{space 2}  24.0747{col 26}{space 2} 8.090437{col 37}{space 1}    2.98{col 46}{space 3}0.003{col 54}{space 4} 8.217729{col 67}{space 3} 39.93166
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo ra6
{txt}
{com}. 
. estimates restore main_ra
{txt}(results {stata estimates replay main_ra:main_ra} are active now)

{com}. nlcom (ra:  (_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5), post

          {txt}ra:  {res}(_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ra {c |}{col 14}{res}{space 2} 21.30969{col 26}{space 2} 8.607325{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} 4.439641{col 67}{space 3} 38.17973
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo ra7 
{txt}
{com}. 
. esttab ra* using "$tables/T5_ra.tex", replace varlabels (ra "Avg. effect on log GDP") fragment nostar nonum nonotes se nomtitles nolines wrap gaps ty  noobs b(3)
{res}
[1em]
Avg. effect &       0.060&       2.454&       3.621&       7.806&      14.037&      24.075&      21.310\\
on log GDP  &     (0.158)&     (1.749)&     (3.183)&     (4.780)&     (5.805)&     (8.090)&     (8.607)\\
{txt}(output written to {browse  `"C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/T5_ra.tex"'})

{com}. 
. /// B. Inverse propensity score reweighting
> set seed 12345
{txt}
{com}. xtset, clear
{txt}
{com}. bootstrap _b, reps(20) cluster(wbcode2): psr
{txt}(running {bf:psr} on estimation sample)

{p 0 10 2} Warning:  Because {cmd:psr} is not an estimation command or does not set {cmd:e(sample)}, {cmd:bootstrap} has no way to determine which observations are used in calculating the statistics and so assumes that all observations are used.  This means that no observations will be excluded from the resampling because of missing values or other reasons.{p_end}

{p 10 10 2} If the assumption is not true, press Break, save the data, and drop the observations that are to be excluded. 
Be sure that the dataset in memory contains only the relevant data.{p_end}

Bootstrap replications ({res}20{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
....................
{res}
{txt}Bootstrap results{col 49}Number of obs{col 67}= {res}     3,036
{txt}{col 49}Replications{col 67}= {res}        20

{txt}{ralign 78:(Replications based on {res:126} clusters in wbcode2)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}c1 {c |}{col 14}{res}{space 2}-5.348826{col 26}{space 2} 6.957534{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-18.98534{col 67}{space 3} 8.287691
{txt}{space 10}c2 {c |}{col 14}{res}{space 2}-6.863527{col 26}{space 2} 6.795896{col 37}{space 1}   -1.01{col 46}{space 3}0.313{col 54}{space 4}-20.18324{col 67}{space 3} 6.456184
{txt}{space 10}c3 {c |}{col 14}{res}{space 2}-5.011499{col 26}{space 2} 5.790955{col 37}{space 1}   -0.87{col 46}{space 3}0.387{col 54}{space 4}-16.36156{col 67}{space 3} 6.338564
{txt}{space 10}c4 {c |}{col 14}{res}{space 2}-4.715084{col 26}{space 2}  5.62822{col 37}{space 1}   -0.84{col 46}{space 3}0.402{col 54}{space 4}-15.74619{col 67}{space 3} 6.316024
{txt}{space 10}c5 {c |}{col 14}{res}{space 2}-5.692406{col 26}{space 2} 5.236376{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-15.95552{col 67}{space 3} 4.570703
{txt}{space 10}c6 {c |}{col 14}{res}{space 2}-6.355406{col 26}{space 2} 5.221794{col 37}{space 1}   -1.22{col 46}{space 3}0.224{col 54}{space 4}-16.58993{col 67}{space 3} 3.879122
{txt}{space 10}c7 {c |}{col 14}{res}{space 2}-5.020103{col 26}{space 2} 4.658915{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-14.15141{col 67}{space 3} 4.111202
{txt}{space 10}c8 {c |}{col 14}{res}{space 2}-5.654936{col 26}{space 2} 4.347182{col 37}{space 1}   -1.30{col 46}{space 3}0.193{col 54}{space 4}-14.17526{col 67}{space 3} 2.865384
{txt}{space 10}c9 {c |}{col 14}{res}{space 2}-5.386442{col 26}{space 2} 3.773977{col 37}{space 1}   -1.43{col 46}{space 3}0.154{col 54}{space 4} -12.7833{col 67}{space 3} 2.010417
{txt}{space 9}c10 {c |}{col 14}{res}{space 2}-4.552659{col 26}{space 2} 3.229088{col 37}{space 1}   -1.41{col 46}{space 3}0.159{col 54}{space 4}-10.88155{col 67}{space 3} 1.776236
{txt}{space 9}c11 {c |}{col 14}{res}{space 2}-3.090007{col 26}{space 2} 2.868372{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-8.711914{col 67}{space 3} 2.531899
{txt}{space 9}c12 {c |}{col 14}{res}{space 2} -2.38014{col 26}{space 2} 2.057285{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-6.412345{col 67}{space 3} 1.652066
{txt}{space 9}c13 {c |}{col 14}{res}{space 2}-1.743328{col 26}{space 2} 1.475667{col 37}{space 1}   -1.18{col 46}{space 3}0.237{col 54}{space 4}-4.635582{col 67}{space 3} 1.148927
{txt}{space 9}c14 {c |}{col 14}{res}{space 2}-.7173139{col 26}{space 2} .7389088{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-2.165549{col 67}{space 3} .7309207
{txt}{space 9}c15 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}c16 {c |}{col 14}{res}{space 2} 1.003326{col 26}{space 2} 1.007593{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-.9715197{col 67}{space 3} 2.978172
{txt}{space 9}c17 {c |}{col 14}{res}{space 2} 3.326791{col 26}{space 2}  1.90196{col 37}{space 1}    1.75{col 46}{space 3}0.080{col 54}{space 4}-.4009813{col 67}{space 3} 7.054564
{txt}{space 9}c18 {c |}{col 14}{res}{space 2} 4.472569{col 26}{space 2} 3.037681{col 37}{space 1}    1.47{col 46}{space 3}0.141{col 54}{space 4}-1.481176{col 67}{space 3} 10.42631
{txt}{space 9}c19 {c |}{col 14}{res}{space 2}  4.97614{col 26}{space 2} 3.640061{col 37}{space 1}    1.37{col 46}{space 3}0.172{col 54}{space 4}-2.158248{col 67}{space 3} 12.11053
{txt}{space 9}c20 {c |}{col 14}{res}{space 2} 4.841104{col 26}{space 2} 3.643861{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-2.300733{col 67}{space 3} 11.98294
{txt}{space 9}c21 {c |}{col 14}{res}{space 2} 3.844462{col 26}{space 2} 3.193471{col 37}{space 1}    1.20{col 46}{space 3}0.229{col 54}{space 4}-2.414627{col 67}{space 3} 10.10355
{txt}{space 9}c22 {c |}{col 14}{res}{space 2} 3.190795{col 26}{space 2} 3.042384{col 37}{space 1}    1.05{col 46}{space 3}0.294{col 54}{space 4}-2.772168{col 67}{space 3} 9.153758
{txt}{space 9}c23 {c |}{col 14}{res}{space 2}  2.64792{col 26}{space 2} 3.298414{col 37}{space 1}    0.80{col 46}{space 3}0.422{col 54}{space 4}-3.816853{col 67}{space 3} 9.112693
{txt}{space 9}c24 {c |}{col 14}{res}{space 2} 2.530603{col 26}{space 2} 3.557393{col 37}{space 1}    0.71{col 46}{space 3}0.477{col 54}{space 4} -4.44176{col 67}{space 3} 9.502966
{txt}{space 9}c25 {c |}{col 14}{res}{space 2} 3.854172{col 26}{space 2} 3.767691{col 37}{space 1}    1.02{col 46}{space 3}0.306{col 54}{space 4}-3.530367{col 67}{space 3} 11.23871
{txt}{space 9}c26 {c |}{col 14}{res}{space 2} 4.165231{col 26}{space 2} 4.164518{col 37}{space 1}    1.00{col 46}{space 3}0.317{col 54}{space 4}-3.997075{col 67}{space 3} 12.32754
{txt}{space 9}c27 {c |}{col 14}{res}{space 2} 6.218378{col 26}{space 2} 4.744879{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-3.081415{col 67}{space 3} 15.51817
{txt}{space 9}c28 {c |}{col 14}{res}{space 2} 7.567457{col 26}{space 2} 5.157749{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-2.541545{col 67}{space 3} 17.67646
{txt}{space 9}c29 {c |}{col 14}{res}{space 2} 7.390154{col 26}{space 2} 5.548273{col 37}{space 1}    1.33{col 46}{space 3}0.183{col 54}{space 4}-3.484261{col 67}{space 3} 18.26457
{txt}{space 9}c30 {c |}{col 14}{res}{space 2} 8.747839{col 26}{space 2} 6.066104{col 37}{space 1}    1.44{col 46}{space 3}0.149{col 54}{space 4}-3.141506{col 67}{space 3} 20.63718
{txt}{space 9}c31 {c |}{col 14}{res}{space 2} 10.77317{col 26}{space 2} 5.767627{col 37}{space 1}    1.87{col 46}{space 3}0.062{col 54}{space 4}-.5311671{col 67}{space 3} 22.07751
{txt}{space 9}c32 {c |}{col 14}{res}{space 2} 9.283862{col 26}{space 2}  6.14067{col 37}{space 1}    1.51{col 46}{space 3}0.131{col 54}{space 4}-2.751629{col 67}{space 3} 21.31935
{txt}{space 9}c33 {c |}{col 14}{res}{space 2} 14.66367{col 26}{space 2} 6.280235{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} 2.354632{col 67}{space 3}  26.9727
{txt}{space 9}c34 {c |}{col 14}{res}{space 2} 16.61314{col 26}{space 2}  5.86549{col 37}{space 1}    2.83{col 46}{space 3}0.005{col 54}{space 4} 5.116985{col 67}{space 3} 28.10929
{txt}{space 9}c35 {c |}{col 14}{res}{space 2} 16.37579{col 26}{space 2} 6.301282{col 37}{space 1}    2.60{col 46}{space 3}0.009{col 54}{space 4} 4.025502{col 67}{space 3} 28.72607
{txt}{space 9}c36 {c |}{col 14}{res}{space 2} 18.56237{col 26}{space 2} 7.289245{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} 4.275712{col 67}{space 3} 32.84903
{txt}{space 9}c37 {c |}{col 14}{res}{space 2} 24.44331{col 26}{space 2} 7.838867{col 37}{space 1}    3.12{col 46}{space 3}0.002{col 54}{space 4} 9.079413{col 67}{space 3} 39.80721
{txt}{space 9}c38 {c |}{col 14}{res}{space 2} 25.21325{col 26}{space 2} 8.127783{col 37}{space 1}    3.10{col 46}{space 3}0.002{col 54}{space 4} 9.283093{col 67}{space 3} 41.14342
{txt}{space 9}c39 {c |}{col 14}{res}{space 2} 26.21248{col 26}{space 2} 8.487525{col 37}{space 1}    3.09{col 46}{space 3}0.002{col 54}{space 4} 9.577237{col 67}{space 3} 42.84772
{txt}{space 9}c40 {c |}{col 14}{res}{space 2} 26.12366{col 26}{space 2} 8.525615{col 37}{space 1}    3.06{col 46}{space 3}0.002{col 54}{space 4} 9.413764{col 67}{space 3} 42.83356
{txt}{space 9}c41 {c |}{col 14}{res}{space 2} 24.07292{col 26}{space 2} 8.628571{col 37}{space 1}    2.79{col 46}{space 3}0.005{col 54}{space 4} 7.161235{col 67}{space 3} 40.98461
{txt}{space 9}c42 {c |}{col 14}{res}{space 2} 22.73674{col 26}{space 2} 8.374572{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} 6.322884{col 67}{space 3}  39.1506
{txt}{space 9}c43 {c |}{col 14}{res}{space 2}  22.1219{col 26}{space 2} 9.325655{col 37}{space 1}    2.37{col 46}{space 3}0.018{col 54}{space 4} 3.843954{col 67}{space 3} 40.39985
{txt}{space 9}c44 {c |}{col 14}{res}{space 2} 21.00047{col 26}{space 2} 9.085111{col 37}{space 1}    2.31{col 46}{space 3}0.021{col 54}{space 4} 3.193977{col 67}{space 3} 38.80696
{txt}{space 9}c45 {c |}{col 14}{res}{space 2} 20.98716{col 26}{space 2} 11.11615{col 37}{space 1}    1.89{col 46}{space 3}0.059{col 54}{space 4} -.800102{col 67}{space 3} 42.77442
{txt}{space 9}c46 {c |}{col 14}{res}{space 2} 20.65125{col 26}{space 2} 10.91969{col 37}{space 1}    1.89{col 46}{space 3}0.059{col 54}{space 4}-.7509427{col 67}{space 3} 42.05345
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. parmest, format(estimate min95 max95) saving("$auxdata/psr", replace)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/psr.dta saved

{com}. eststo main_psr 
{txt}
{com}. // Get 5 year averages
. nlcom (psr: (_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5), post

         {txt}psr:  {res}(_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}psr {c |}{col 14}{res}{space 2}-1.586158{col 26}{space 2} 1.386032{col 37}{space 1}   -1.14{col 46}{space 3}0.252{col 54}{space 4} -4.30273{col 67}{space 3} 1.130415
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo psr1
{txt}
{com}. 
. estimates restore main_psr 
{txt}(results {stata estimates replay main_psr:main_psr} are active now)

{com}. nlcom (psr: (_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5), post

         {txt}psr:  {res}(_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}psr {c |}{col 14}{res}{space 2} 3.723986{col 26}{space 2} 2.562663{col 37}{space 1}    1.45{col 46}{space 3}0.146{col 54}{space 4}-1.298741{col 67}{space 3} 8.746713
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo psr2 
{txt}
{com}. 
. estimates restore main_psr 
{txt}(results {stata estimates replay main_psr:main_psr} are active now)

{com}. nlcom (psr: (_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5), post

         {txt}psr:  {res}(_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}psr {c |}{col 14}{res}{space 2}  3.21359{col 26}{space 2} 3.242289{col 37}{space 1}    0.99{col 46}{space 3}0.322{col 54}{space 4}-3.141179{col 67}{space 3}  9.56836
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo psr3 
{txt}
{com}. 
. estimates restore main_psr 
{txt}(results {stata estimates replay main_psr:main_psr} are active now)

{com}. nlcom (psr: (_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5), post

         {txt}psr:  {res}(_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}psr {c |}{col 14}{res}{space 2} 6.817812{col 26}{space 2} 5.045401{col 37}{space 1}    1.35{col 46}{space 3}0.177{col 54}{space 4}-3.070992{col 67}{space 3} 16.70662
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo psr4 
{txt}
{com}. 
. estimates restore main_psr 
{txt}(results {stata estimates replay main_psr:main_psr} are active now)

{com}. nlcom (psr: (_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5), post

         {txt}psr:  {res}(_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}psr {c |}{col 14}{res}{space 2} 13.54193{col 26}{space 2}  5.80524{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} 2.163864{col 67}{space 3} 24.91999
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo psr5 
{txt}
{com}. 
. estimates restore main_psr 
{txt}(results {stata estimates replay main_psr:main_psr} are active now)

{com}. nlcom (psr: (_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5), post

         {txt}psr:  {res}(_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}psr {c |}{col 14}{res}{space 2} 24.11102{col 26}{space 2}  7.93388{col 37}{space 1}    3.04{col 46}{space 3}0.002{col 54}{space 4} 8.560897{col 67}{space 3} 39.66113
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo psr6
{txt}
{com}. 
. estimates restore main_psr 
{txt}(results {stata estimates replay main_psr:main_psr} are active now)

{com}. nlcom (psr:  (_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5), post

         {txt}psr:  {res}(_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}psr {c |}{col 14}{res}{space 2} 22.18384{col 26}{space 2}  9.00913{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} 4.526268{col 67}{space 3} 39.84141
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo psr7 
{txt}
{com}. 
. esttab psr* using "$tables/T5_psr.tex", replace varlabels (psr "Avg. effect on log GDP") fragment nostar nonum nonotes se nomtitles nolines wrap gaps ty  noobs b(3)
{res}
[1em]
Avg. effect &      -1.586&       3.724&       3.214&       6.818&      13.542&      24.111&      22.184\\
on log GDP  &     (1.386)&     (2.563)&     (3.242)&     (5.045)&     (5.805)&     (7.934)&     (9.009)\\
{txt}(output written to {browse  `"C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/T5_psr.tex"'})

{com}. 
. 
. // C. Doubly robust estimator
. set seed 12345
{txt}
{com}. xtset, clear
{txt}
{com}. bootstrap _b, reps(20) cluster(wbcode2): dr
{txt}(running {bf:dr} on estimation sample)

{p 0 10 2} Warning:  Because {cmd:dr} is not an estimation command or does not set {cmd:e(sample)}, {cmd:bootstrap} has no way to determine which observations are used in calculating the statistics and so assumes that all observations are used.  This means that no observations will be excluded from the resampling because of missing values or other reasons.{p_end}

{p 10 10 2} If the assumption is not true, press Break, save the data, and drop the observations that are to be excluded. 
Be sure that the dataset in memory contains only the relevant data.{p_end}

Bootstrap replications ({res}20{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..............{err}x{txt}.....
{res}
{txt}Bootstrap results{col 49}Number of obs{col 67}= {res}     3,036
{txt}{col 49}Replications{col 67}= {res}        19

{txt}{ralign 78:(Replications based on {res:126} clusters in wbcode2)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}c1 {c |}{col 14}{res}{space 2}-.5753906{col 26}{space 2} 4.655281{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-9.699574{col 67}{space 3} 8.548793
{txt}{space 10}c2 {c |}{col 14}{res}{space 2}-2.418304{col 26}{space 2} 4.522468{col 37}{space 1}   -0.53{col 46}{space 3}0.593{col 54}{space 4}-11.28218{col 67}{space 3} 6.445571
{txt}{space 10}c3 {c |}{col 14}{res}{space 2}-1.609369{col 26}{space 2} 4.253464{col 37}{space 1}   -0.38{col 46}{space 3}0.705{col 54}{space 4}-9.946005{col 67}{space 3} 6.727267
{txt}{space 10}c4 {c |}{col 14}{res}{space 2} -1.44989{col 26}{space 2} 4.499691{col 37}{space 1}   -0.32{col 46}{space 3}0.747{col 54}{space 4}-10.26912{col 67}{space 3} 7.369343
{txt}{space 10}c5 {c |}{col 14}{res}{space 2}-2.355892{col 26}{space 2} 4.252349{col 37}{space 1}   -0.55{col 46}{space 3}0.580{col 54}{space 4}-10.69034{col 67}{space 3}  5.97856
{txt}{space 10}c6 {c |}{col 14}{res}{space 2}-3.082545{col 26}{space 2} 3.901846{col 37}{space 1}   -0.79{col 46}{space 3}0.430{col 54}{space 4}-10.73002{col 67}{space 3} 4.564934
{txt}{space 10}c7 {c |}{col 14}{res}{space 2}-1.714901{col 26}{space 2} 3.329182{col 37}{space 1}   -0.52{col 46}{space 3}0.606{col 54}{space 4}-8.239979{col 67}{space 3} 4.810176
{txt}{space 10}c8 {c |}{col 14}{res}{space 2}-1.741191{col 26}{space 2} 2.741876{col 37}{space 1}   -0.64{col 46}{space 3}0.525{col 54}{space 4} -7.11517{col 67}{space 3} 3.632788
{txt}{space 10}c9 {c |}{col 14}{res}{space 2}-1.574023{col 26}{space 2} 1.971704{col 37}{space 1}   -0.80{col 46}{space 3}0.425{col 54}{space 4}-5.438492{col 67}{space 3} 2.290445
{txt}{space 9}c10 {c |}{col 14}{res}{space 2}-.9388879{col 26}{space 2} 1.302096{col 37}{space 1}   -0.72{col 46}{space 3}0.471{col 54}{space 4} -3.49095{col 67}{space 3} 1.613174
{txt}{space 9}c11 {c |}{col 14}{res}{space 2} .2532907{col 26}{space 2} .7977445{col 37}{space 1}    0.32{col 46}{space 3}0.751{col 54}{space 4} -1.31026{col 67}{space 3} 1.816841
{txt}{space 9}c12 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}c13 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}c14 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}c15 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}c16 {c |}{col 14}{res}{space 2}  .541812{col 26}{space 2} .7981263{col 37}{space 1}    0.68{col 46}{space 3}0.497{col 54}{space 4}-1.022487{col 67}{space 3} 2.106111
{txt}{space 9}c17 {c |}{col 14}{res}{space 2} 2.482011{col 26}{space 2} 1.437217{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.3348831{col 67}{space 3} 5.298905
{txt}{space 9}c18 {c |}{col 14}{res}{space 2} 3.390913{col 26}{space 2} 2.315614{col 37}{space 1}    1.46{col 46}{space 3}0.143{col 54}{space 4}-1.147606{col 67}{space 3} 7.929433
{txt}{space 9}c19 {c |}{col 14}{res}{space 2}  3.85488{col 26}{space 2} 2.800431{col 37}{space 1}    1.38{col 46}{space 3}0.169{col 54}{space 4}-1.633864{col 67}{space 3} 9.343623
{txt}{space 9}c20 {c |}{col 14}{res}{space 2} 3.707369{col 26}{space 2} 2.829142{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-1.837648{col 67}{space 3} 9.252385
{txt}{space 9}c21 {c |}{col 14}{res}{space 2} 3.097665{col 26}{space 2} 2.833104{col 37}{space 1}    1.09{col 46}{space 3}0.274{col 54}{space 4}-2.455116{col 67}{space 3} 8.650447
{txt}{space 9}c22 {c |}{col 14}{res}{space 2} 2.813484{col 26}{space 2} 2.980814{col 37}{space 1}    0.94{col 46}{space 3}0.345{col 54}{space 4}-3.028804{col 67}{space 3} 8.655771
{txt}{space 9}c23 {c |}{col 14}{res}{space 2} 2.498123{col 26}{space 2} 3.347301{col 37}{space 1}    0.75{col 46}{space 3}0.455{col 54}{space 4}-4.062466{col 67}{space 3} 9.058712
{txt}{space 9}c24 {c |}{col 14}{res}{space 2} 2.519032{col 26}{space 2} 3.647972{col 37}{space 1}    0.69{col 46}{space 3}0.490{col 54}{space 4}-4.630862{col 67}{space 3} 9.668926
{txt}{space 9}c25 {c |}{col 14}{res}{space 2} 3.916411{col 26}{space 2} 3.818391{col 37}{space 1}    1.03{col 46}{space 3}0.305{col 54}{space 4}-3.567498{col 67}{space 3} 11.40032
{txt}{space 9}c26 {c |}{col 14}{res}{space 2} 4.274925{col 26}{space 2} 4.244601{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4} -4.04434{col 67}{space 3} 12.59419
{txt}{space 9}c27 {c |}{col 14}{res}{space 2} 6.301885{col 26}{space 2} 4.744105{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-2.996391{col 67}{space 3} 15.60016
{txt}{space 9}c28 {c |}{col 14}{res}{space 2} 7.675004{col 26}{space 2} 5.152267{col 37}{space 1}    1.49{col 46}{space 3}0.136{col 54}{space 4}-2.423254{col 67}{space 3} 17.77326
{txt}{space 9}c29 {c |}{col 14}{res}{space 2} 7.580508{col 26}{space 2} 5.455292{col 37}{space 1}    1.39{col 46}{space 3}0.165{col 54}{space 4}-3.111667{col 67}{space 3} 18.27268
{txt}{space 9}c30 {c |}{col 14}{res}{space 2} 8.996041{col 26}{space 2} 5.887993{col 37}{space 1}    1.53{col 46}{space 3}0.127{col 54}{space 4}-2.544214{col 67}{space 3}  20.5363
{txt}{space 9}c31 {c |}{col 14}{res}{space 2} 10.84074{col 26}{space 2} 5.528871{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 54}{space 4} .0043537{col 67}{space 3} 21.67713
{txt}{space 9}c32 {c |}{col 14}{res}{space 2} 9.308498{col 26}{space 2} 5.931787{col 37}{space 1}    1.57{col 46}{space 3}0.117{col 54}{space 4}-2.317591{col 67}{space 3} 20.93459
{txt}{space 9}c33 {c |}{col 14}{res}{space 2} 13.65817{col 26}{space 2} 6.457437{col 37}{space 1}    2.12{col 46}{space 3}0.034{col 54}{space 4} 1.001829{col 67}{space 3} 26.31452
{txt}{space 9}c34 {c |}{col 14}{res}{space 2} 15.45666{col 26}{space 2} 6.109399{col 37}{space 1}    2.53{col 46}{space 3}0.011{col 54}{space 4} 3.482453{col 67}{space 3} 27.43086
{txt}{space 9}c35 {c |}{col 14}{res}{space 2} 15.46903{col 26}{space 2} 6.645145{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} 2.444786{col 67}{space 3} 28.49328
{txt}{space 9}c36 {c |}{col 14}{res}{space 2} 18.29679{col 26}{space 2} 7.649329{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4} 3.304384{col 67}{space 3}  33.2892
{txt}{space 9}c37 {c |}{col 14}{res}{space 2} 24.31254{col 26}{space 2} 7.959673{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4}  8.71187{col 67}{space 3} 39.91322
{txt}{space 9}c38 {c |}{col 14}{res}{space 2} 25.00711{col 26}{space 2} 8.309954{col 37}{space 1}    3.01{col 46}{space 3}0.003{col 54}{space 4} 8.719901{col 67}{space 3} 41.29432
{txt}{space 9}c39 {c |}{col 14}{res}{space 2} 25.43126{col 26}{space 2} 8.726507{col 37}{space 1}    2.91{col 46}{space 3}0.004{col 54}{space 4} 8.327618{col 67}{space 3} 42.53489
{txt}{space 9}c40 {c |}{col 14}{res}{space 2} 25.40845{col 26}{space 2}  8.79777{col 37}{space 1}    2.89{col 46}{space 3}0.004{col 54}{space 4} 8.165135{col 67}{space 3} 42.65176
{txt}{space 9}c41 {c |}{col 14}{res}{space 2} 23.46804{col 26}{space 2} 8.959992{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 54}{space 4} 5.906782{col 67}{space 3}  41.0293
{txt}{space 9}c42 {c |}{col 14}{res}{space 2} 22.40911{col 26}{space 2} 8.632826{col 37}{space 1}    2.60{col 46}{space 3}0.009{col 54}{space 4} 5.489082{col 67}{space 3} 39.32914
{txt}{space 9}c43 {c |}{col 14}{res}{space 2}  21.6798{col 26}{space 2} 9.571375{col 37}{space 1}    2.27{col 46}{space 3}0.024{col 54}{space 4} 2.920247{col 67}{space 3} 40.43935
{txt}{space 9}c44 {c |}{col 14}{res}{space 2}  20.8553{col 26}{space 2} 9.526973{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4} 2.182779{col 67}{space 3} 39.52783
{txt}{space 9}c45 {c |}{col 14}{res}{space 2} 20.55028{col 26}{space 2} 11.56157{col 37}{space 1}    1.78{col 46}{space 3}0.075{col 54}{space 4}-2.109985{col 67}{space 3} 43.21054
{txt}{space 9}c46 {c |}{col 14}{res}{space 2} 20.14815{col 26}{space 2} 11.27746{col 37}{space 1}    1.79{col 46}{space 3}0.074{col 54}{space 4}-1.955275{col 67}{space 3} 42.25157
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 79}Note: One or more parameters could not be estimated in 1 bootstrap replicate; standard-error estimates include only complete replications.{p_end}

{com}. parmest, format(estimate min95 max95) saving("$auxdata/dr", replace)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/dr.dta saved

{com}. eststo main_dr 
{txt}
{com}. // Get 5 year averages
. nlcom (dr: (_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5), post

          {txt}dr:  {res}(_b[c11]+_b[c12]+_b[c13]+_b[c14]+_b[c15])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}dr {c |}{col 14}{res}{space 2} .0506581{col 26}{space 2} .1595489{col 37}{space 1}    0.32{col 46}{space 3}0.751{col 54}{space 4} -.262052{col 67}{space 3} .3633682
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo dr1
{txt}
{com}. 
. estimates restore main_dr 
{txt}(results {stata estimates replay main_dr:main_dr} are active now)

{com}. nlcom (dr: (_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5), post

          {txt}dr:  {res}(_b[c16]+_b[c17]+_b[c18]+_b[c19]+_b[c20])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}dr {c |}{col 14}{res}{space 2} 2.795397{col 26}{space 2} 1.959033{col 37}{space 1}    1.43{col 46}{space 3}0.154{col 54}{space 4}-1.044237{col 67}{space 3} 6.635031
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo dr2 
{txt}
{com}. 
. estimates restore main_dr 
{txt}(results {stata estimates replay main_dr:main_dr} are active now)

{com}. nlcom (dr: (_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5), post

          {txt}dr:  {res}(_b[c21]+_b[c22]+_b[c23]+_b[c24]+_b[c25])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}dr {c |}{col 14}{res}{space 2} 2.968943{col 26}{space 2} 3.255977{col 37}{space 1}    0.91{col 46}{space 3}0.362{col 54}{space 4}-3.412655{col 67}{space 3} 9.350541
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo dr3 
{txt}
{com}. 
. estimates restore main_dr 
{txt}(results {stata estimates replay main_dr:main_dr} are active now)

{com}. nlcom (dr: (_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5), post

          {txt}dr:  {res}(_b[c26]+_b[c27]+_b[c28]+_b[c29]+_b[c30])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}dr {c |}{col 14}{res}{space 2} 6.965672{col 26}{space 2} 5.025878{col 37}{space 1}    1.39{col 46}{space 3}0.166{col 54}{space 4}-2.884868{col 67}{space 3} 16.81621
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo dr4 
{txt}
{com}. 
. estimates restore main_dr 
{txt}(results {stata estimates replay main_dr:main_dr} are active now)

{com}. nlcom (dr: (_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5), post

          {txt}dr:  {res}(_b[c31]+_b[c32]+_b[c33]+_b[c34]+_b[c35])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}dr {c |}{col 14}{res}{space 2} 12.94662{col 26}{space 2} 5.949521{col 37}{space 1}    2.18{col 46}{space 3}0.030{col 54}{space 4} 1.285773{col 67}{space 3} 24.60747
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo dr5 
{txt}
{com}. 
. estimates restore main_dr 
{txt}(results {stata estimates replay main_dr:main_dr} are active now)

{com}. nlcom (dr: (_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5), post

          {txt}dr:  {res}(_b[c36]+_b[c37]+_b[c38]+_b[c39]+_b[c40])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}dr {c |}{col 14}{res}{space 2} 23.69123{col 26}{space 2} 8.142106{col 37}{space 1}    2.91{col 46}{space 3}0.004{col 54}{space 4} 7.732996{col 67}{space 3} 39.64946
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo dr6
{txt}
{com}. 
. estimates restore main_dr 
{txt}(results {stata estimates replay main_dr:main_dr} are active now)

{com}. nlcom (dr:  (_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5), post

          {txt}dr:  {res}(_b[c41]+_b[c42]+_b[c43]+_b[c44]+_b[c45])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}dr {c |}{col 14}{res}{space 2} 21.79251{col 26}{space 2} 9.344445{col 37}{space 1}    2.33{col 46}{space 3}0.020{col 54}{space 4} 3.477729{col 67}{space 3} 40.10728
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo dr7 
{txt}
{com}. 
. esttab dr* using "$tables/T5_dr.tex", replace varlabels (dr "Avg. effect on log GDP") fragment nostar nonum nonotes se nomtitles nolines wrap ty  noobs b(3)
{res}
[1em]
Avg. effect &       0.051&       2.795&       2.969&       6.966&      12.947&      23.691&      21.793\\
on log GDP  &     (0.160)&     (1.959)&     (3.256)&     (5.026)&     (5.950)&     (8.142)&     (9.344)\\
{txt}(output written to {browse  `"C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/T5_dr.tex"'})

{com}. 
. 
. */
. *******PART 2****************************
. ****************************************
. ****************************************
. *******PART 2****************************
. ****************************************
. ****************************************
. ****************************************
. ****** PART 2***************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 2***************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 2*************************
. ****************************************
. ****************************************
. 
. 
. /// Now it is correct
> 
. use DDCGdata_final, clear
{txt}
{com}. gen tdemoc=.  
{txt}(9,384 missing values generated)

{com}. replace tdemoc=1 if dem==1 & l.dem==0 // captures the exact moment when a country transitions to democracy
{txt}(122 real changes made)

{com}. replace tdemoc=0 if dem==0 & l.dem==0 
{txt}(4,768 real changes made)

{com}. 
. forvalues i=1/4{c -(}
{txt}  2{com}. gen lag`i'y=l`i'.y
{txt}  3{com}. {c )-}
{txt}(2,405 missing values generated)
(2,578 missing values generated)
(2,752 missing values generated)
(2,927 missing values generated)

{com}. 
. forvalues i=0/15{c -(}
{txt}  2{com}. local k =15-`i'
{txt}  3{com}. gen ydep`i'=L`k'.y-L.y
{txt}  4{com}. {c )-}
{txt}(4,846 missing values generated)
(4,675 missing values generated)
(4,502 missing values generated)
(4,329 missing values generated)
(4,155 missing values generated)
(3,980 missing values generated)
(3,805 missing values generated)
(3,630 missing values generated)
(3,455 missing values generated)
(3,280 missing values generated)
(3,105 missing values generated)
(2,930 missing values generated)
(2,755 missing values generated)
(2,580 missing values generated)
(2,405 missing values generated)
(2,416 missing values generated)

{com}. 
. forvalues i=16/45{c -(}
{txt}  2{com}. local k=`i'-15
{txt}  3{com}. gen ydep`i'=F`k'.y-L.y
{txt}  4{com}. {c )-}
{txt}(2,591 missing values generated)
(2,766 missing values generated)
(2,941 missing values generated)
(3,116 missing values generated)
(3,291 missing values generated)
(3,466 missing values generated)
(3,641 missing values generated)
(3,816 missing values generated)
(3,991 missing values generated)
(4,165 missing values generated)
(4,338 missing values generated)
(4,511 missing values generated)
(4,683 missing values generated)
(4,854 missing values generated)
(5,025 missing values generated)
(5,195 missing values generated)
(5,364 missing values generated)
(5,532 missing values generated)
(5,699 missing values generated)
(5,863 missing values generated)
(6,015 missing values generated)
(6,166 missing values generated)
(6,315 missing values generated)
(6,461 missing values generated)
(6,605 missing values generated)
(6,746 missing values generated)
(6,884 missing values generated)
(7,022 missing values generated)
(7,157 missing values generated)
(7,287 missing values generated)

{com}. order country_name tdemoc year y ydep*
{txt}
{com}. keep if tdemoc!=.
{txt}(4,494 observations deleted)

{com}. 
. // Controlling for 4 GDP lags
. forvalues s=0/45{c -(}
{txt}  2{com}. quiet reg ydep`s' tdemoc  lag*, cluster(wbcode2)
{txt}  3{com}. if `s'==0{c -(}
{txt}  4{com}. mat ests=(_b[tdemoc], r(table)[5,1],r(table)[6,1])
{txt}  5{com}. {c )-}
{txt}  6{com}. else{c -(}
{txt}  7{com}. mat ests=ests\(_b[tdemoc], r(table)[5,1],r(table)[6,1])
{txt}  8{com}. mat colnames ests="b" "ll" "ul"
{txt}  9{com}. {c )-}
{txt} 10{com}. {c )-}
{txt}
{com}. 
. 
. svmat ests
{txt}
{com}. 
. cap drop yad
{txt}
{com}. gen yad=. 
{txt}(4,890 missing values generated)

{com}. forvalues i=0/45{c -(}
{txt}  2{com}. local k=`i'-14
{txt}  3{com}. local j=`i'+1
{txt}  4{com}. replace yad=`k' in `j'
{txt}  5{com}. {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. 
. line ests1 yad, lcolor(black) scheme(s1color) xtitle(Years around democratization) ytitle(Change in GDP per capita log points) yline(0, lcolor(black) lpattern(dash))||line ests2 yad,  lcolor(gray) lpattern(dash)||line ests3 yad,  lcolor(gray) lpattern(dash) legend(off)
{res}{txt}
{com}. graph export "$figures/part2a.png", as(png) replace
{txt}(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part2a.png written in PNG format)

{com}. 
. /// No lags
> forvalues s=0/45{c -(}
{txt}  2{com}. quiet reg ydep`s' tdemoc, cluster(wbcode2)
{txt}  3{com}. if `s'==0{c -(}
{txt}  4{com}. mat ests=(_b[tdemoc], r(table)[5,1],r(table)[6,1])
{txt}  5{com}. {c )-}
{txt}  6{com}. else{c -(}
{txt}  7{com}. mat ests=ests\(_b[tdemoc], r(table)[5,1],r(table)[6,1])
{txt}  8{com}. mat colnames ests="b" "ll" "ul"
{txt}  9{com}. {c )-}
{txt} 10{com}. {c )-}
{txt}
{com}. 
. drop ests*
{txt}
{com}. svmat ests
{txt}
{com}. cap drop yad
{txt}
{com}. gen yad=. 
{txt}(4,890 missing values generated)

{com}. forvalues i=0/45{c -(}
{txt}  2{com}. local k=`i'-14
{txt}  3{com}. local j=`i'+1
{txt}  4{com}. replace yad=`k' in `j'
{txt}  5{com}. {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. 
. line ests1 yad, lcolor(black) scheme(s1color) xtitle(Years around democratization) ytitle(Change in GDP per capita log points) yline(0, lcolor(black) lpattern(dash))||line ests2 yad,  lcolor(gray) lpattern(dash)||line ests3 yad,  lcolor(gray) lpattern(dash) legend(off) ylabel(#6) 
{res}{txt}
{com}. graph export "$figures/part2b.png", as(png) replace
{txt}(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part2b.png written in PNG format)

{com}. 
. 
. *******PART 3****************************
. ****************************************
. ****************************************
. *******PART 3****************************
. ****************************************
. ****************************************
. ****************************************
. ****** PART 3***************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 3***************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 3*************************
. ****************************************
. ****************************************
. 
. 
. /// Replicate the figures
> 
. * Â¯\_(ã)_/Â¯
. 
. 
. foreach type in psr dr{c -(}
{txt}  2{com}. 
. use "$auxdata/`type'.dta",clear
{txt}  3{com}. 
. gen event=.
{txt}  4{com}. 
. forvalues i=1/46{c -(}
{txt}  5{com}. local k=`i'-16
{txt}  6{com}. replace event=`k' in `i'
{txt}  7{com}. {c )-}
{txt}  8{com}. 
. line estimate event, lcolor(black) || line min95 event, lcolor(gray) lpattern(dash) || line max95 event, lcolor(gray) lpattern(dash) ytitle(Change in GDP per capita log points) xlabel(#10) xtitle(Years around democratization) scheme(s1color) legend(off) yline(0, lpattern(dash))
{txt}  9{com}. graph export  "$figures/part3`type'.png", replace
{txt} 10{com}. {c )-}
{txt}(46 missing values generated)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{res}{txt}(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part3psr.png written in PNG format)
(46 missing values generated)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{res}{txt}(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part3dr.png written in PNG format)

{com}. 
. *******PART 4****************************
. ****************************************
. ****************************************
. *******PART 4****************************
. ****************************************
. ****************************************
. ****************************************
. ****** PART 4***************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 4***************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 4*************************
. ****************************************
. ****************************************
. 
. use ${c -(}home{c )-}/DDCGdata_final, clear
{txt}
{com}. 
. // The code below identifies treated units (countries that transitioned to democracy with no reversals) and the clean controls associated to each treated unit (countries that did not have a transition before t0 and at least 20 year after)
. // We will use tunit for part 6, so it will assign a missing value to all countries which experienced a kind of transition 
. // Â¯\_(ã)_/Â¯
. 
. egen countrynum= group(country_name)
{txt}
{com}. gen tdemoc=.
{txt}(9,384 missing values generated)

{com}. replace tdemoc=1 if dem==1 & l.dem==0
{txt}(122 real changes made)

{com}. order tdemoc countrynum year
{txt}
{com}. gen tunit=.
{txt}(9,384 missing values generated)

{com}. quiet su countrynum 
{txt}
{com}. local mincountry=r(min)
{txt}
{com}. local maxcountry=r(max)
{txt}
{com}. 
. 
. forvalues i=`mincountry'/`maxcountry'{c -(}
{txt}  2{com}. quiet  su year if countrynum==`i' & tdemoc==1
{txt}  3{com}. if r(N)==1{c -(}
{txt}  4{com}. di `i'
{txt}  5{com}. di "Only one transition to democracy"
{txt}  6{com}. local t0=r(mean)
{txt}  7{com}. quiet su dem if year >=`t0' & countrynum==`i'
{txt}  8{com}. if r(min)==r(max) {c -(} // 1992 
{txt}  9{com}. di " `i' is treated unit, democratized in `t0'"
{txt} 10{com}. quietly replace tunit=1 if countrynum==`i'
{txt} 11{com}. 
. //Event i
. gen event_`i'_=.
{txt} 12{com}. // Prepare dependent variables for regressions. 
. 
. forvalues j=`mincountry'/`maxcountry'{c -(}
{txt} 13{com}. if `j'==`i'{c -(}
{txt} 14{com}. quietly replace event_`i'_=0 if year<`t0' & countrynum==`j'
{txt} 15{com}. quietly replace event_`i'_=1 if year==`t0' & countrynum==`j'
{txt} 16{com}. {c )-}
{txt} 17{com}. 
. else{c -(}
{txt} 18{com}. local t20= `t0'+20
{txt} 19{com}. quietly su dem if countrynum==`j' & year <=`t20'
{txt} 20{com}. if r(max)==0{c -(}
{txt} 21{com}. 
. // di "`j' is a clean control of `i'"
. quietly replace event_`i'_=0 if countrynum==`j'
{txt} 22{com}. {c )-}
{txt} 23{com}. else{c -(}
{txt} 24{com}. quietly replace event_`i'_=. if countrynum==`j'
{txt} 25{com}. {c )-}
{txt} 26{com}. {c )-}
{txt} 27{com}. {c )-}
{txt} 28{com}. {c )-}
{txt} 29{com}. else{c -(}
{txt} 30{com}. di "Experienced a reversal"
{txt} 31{com}. //quietly replace tunit=. if countrynum==`i'
. {c )-}
{txt} 32{com}. {c )-}
{txt} 33{com}. 
. else {c -(}
{txt} 34{com}. di "`i' had more than one transition to democracy"
{txt} 35{com}. //quietly replace tunit=. if countrynum==`i'
. {c )-}
{txt} 36{com}. {c )-}
1 had more than one transition to democracy
2 had more than one transition to democracy
3 had more than one transition to democracy
4 had more than one transition to democracy
5 had more than one transition to democracy
6 had more than one transition to democracy
7 had more than one transition to democracy
8 had more than one transition to democracy
9 had more than one transition to democracy
10
Only one transition to democracy
Experienced a reversal
11 had more than one transition to democracy
12 had more than one transition to democracy
13 had more than one transition to democracy
14 had more than one transition to democracy
15
Only one transition to democracy
Experienced a reversal
16 had more than one transition to democracy
17 had more than one transition to democracy
18
Only one transition to democracy
 18 is treated unit, democratized in 1991
{txt}(9,384 missing values generated)
19
Only one transition to democracy
 19 is treated unit, democratized in 2008
(9,384 missing values generated)
20
Only one transition to democracy
 20 is treated unit, democratized in 1982
(9,384 missing values generated)
21 had more than one transition to democracy
22 had more than one transition to democracy
23
Only one transition to democracy
 23 is treated unit, democratized in 1985
(9,384 missing values generated)
24 had more than one transition to democracy
25
Only one transition to democracy
 25 is treated unit, democratized in 1991
(9,384 missing values generated)
26
Only one transition to democracy
Experienced a reversal
27
Only one transition to democracy
 27 is treated unit, democratized in 2003
(9,384 missing values generated)
28
Only one transition to democracy
Experienced a reversal
29 had more than one transition to democracy
30 had more than one transition to democracy
31
Only one transition to democracy
 31 is treated unit, democratized in 1991
(9,384 missing values generated)
32
Only one transition to democracy
Experienced a reversal
33 had more than one transition to democracy
34
Only one transition to democracy
 34 is treated unit, democratized in 1990
(9,384 missing values generated)
35 had more than one transition to democracy
36 had more than one transition to democracy
37 had more than one transition to democracy
38 had more than one transition to democracy
39
Only one transition to democracy
Experienced a reversal
40 had more than one transition to democracy
41
Only one transition to democracy
 41 is treated unit, democratized in 2000
(9,384 missing values generated)
42 had more than one transition to democracy
43
Only one transition to democracy
 43 is treated unit, democratized in 1974
(9,384 missing values generated)
44
Only one transition to democracy
 44 is treated unit, democratized in 1993
(9,384 missing values generated)
45
Only one transition to democracy
Experienced a reversal
46 had more than one transition to democracy
47
Only one transition to democracy
Experienced a reversal
48 had more than one transition to democracy
49
Only one transition to democracy
 49 is treated unit, democratized in 1978
(9,384 missing values generated)
50
Only one transition to democracy
 50 is treated unit, democratized in 1979
(9,384 missing values generated)
51 had more than one transition to democracy
52
Only one transition to democracy
 52 is treated unit, democratized in 1982
(9,384 missing values generated)
53 had more than one transition to democracy
54 had more than one transition to democracy
55
Only one transition to democracy
 55 is treated unit, democratized in 1992
(9,384 missing values generated)
56
Only one transition to democracy
Experienced a reversal
57
Only one transition to democracy
Experienced a reversal
58 had more than one transition to democracy
59 had more than one transition to democracy
60 had more than one transition to democracy
61 had more than one transition to democracy
62
Only one transition to democracy
 62 is treated unit, democratized in 1995
(9,384 missing values generated)
63 had more than one transition to democracy
64 had more than one transition to democracy
65
Only one transition to democracy
 65 is treated unit, democratized in 1975
(9,384 missing values generated)
66
Only one transition to democracy
 66 is treated unit, democratized in 1984
(9,384 missing values generated)
67 had more than one transition to democracy
68
Only one transition to democracy
 68 is treated unit, democratized in 2010
(9,384 missing values generated)
69 had more than one transition to democracy
70
Only one transition to democracy
 70 is treated unit, democratized in 1992
(9,384 missing values generated)
71 had more than one transition to democracy
72
Only one transition to democracy
 72 is treated unit, democratized in 1982
(9,384 missing values generated)
73
Only one transition to democracy
 73 is treated unit, democratized in 1990
(9,384 missing values generated)
74 had more than one transition to democracy
75 had more than one transition to democracy
76
Only one transition to democracy
 76 is treated unit, democratized in 1999
(9,384 missing values generated)
77 had more than one transition to democracy
78 had more than one transition to democracy
79 had more than one transition to democracy
80 had more than one transition to democracy
81 had more than one transition to democracy
82 had more than one transition to democracy
83 had more than one transition to democracy
84 had more than one transition to democracy
85 had more than one transition to democracy
86
Only one transition to democracy
 86 is treated unit, democratized in 2002
(9,384 missing values generated)
87 had more than one transition to democracy
88
Only one transition to democracy
 88 is treated unit, democratized in 1988
(9,384 missing values generated)
89 had more than one transition to democracy
90 had more than one transition to democracy
91 had more than one transition to democracy
92
Only one transition to democracy
 92 is treated unit, democratized in 1993
(9,384 missing values generated)
93
Only one transition to democracy
 93 is treated unit, democratized in 2005
(9,384 missing values generated)
94 had more than one transition to democracy
95
Only one transition to democracy
 95 is treated unit, democratized in 2004
(9,384 missing values generated)
96 had more than one transition to democracy
97
Only one transition to democracy
 97 is treated unit, democratized in 1993
(9,384 missing values generated)
98 had more than one transition to democracy
99
Only one transition to democracy
 99 is treated unit, democratized in 1991
(9,384 missing values generated)
100
Only one transition to democracy
Experienced a reversal
101
Only one transition to democracy
 101 is treated unit, democratized in 1994
(9,384 missing values generated)
102 had more than one transition to democracy
103 had more than one transition to democracy
104
Only one transition to democracy
 104 is treated unit, democratized in 1992
(9,384 missing values generated)
105 had more than one transition to democracy
106
Only one transition to democracy
Experienced a reversal
107 had more than one transition to democracy
108
Only one transition to democracy
 108 is treated unit, democratized in 1997
(9,384 missing values generated)
109
Only one transition to democracy
 109 is treated unit, democratized in 1994
(9,384 missing values generated)
110
Only one transition to democracy
 110 is treated unit, democratized in 1993
(9,384 missing values generated)
111 had more than one transition to democracy
112
Only one transition to democracy
 112 is treated unit, democratized in 1994
(9,384 missing values generated)
113 had more than one transition to democracy
114 had more than one transition to democracy
115 had more than one transition to democracy
116 had more than one transition to democracy
117 had more than one transition to democracy
118 had more than one transition to democracy
119
Only one transition to democracy
 119 is treated unit, democratized in 1990
(9,384 missing values generated)
120 had more than one transition to democracy
121 had more than one transition to democracy
122 had more than one transition to democracy
123 had more than one transition to democracy
124 had more than one transition to democracy
125 had more than one transition to democracy
126 had more than one transition to democracy
127
Only one transition to democracy
 127 is treated unit, democratized in 1994
(9,384 missing values generated)
128 had more than one transition to democracy
129
Only one transition to democracy
 129 is treated unit, democratized in 1993
(9,384 missing values generated)
130 had more than one transition to democracy
131
Only one transition to democracy
 131 is treated unit, democratized in 1987
(9,384 missing values generated)
132
Only one transition to democracy
 132 is treated unit, democratized in 1990
(9,384 missing values generated)
133
Only one transition to democracy
 133 is treated unit, democratized in 1976
(9,384 missing values generated)
134 had more than one transition to democracy
135
Only one transition to democracy
 135 is treated unit, democratized in 1990
(9,384 missing values generated)
136
Only one transition to democracy
Experienced a reversal
137 had more than one transition to democracy
138 had more than one transition to democracy
139 had more than one transition to democracy
140
Only one transition to democracy
 140 is treated unit, democratized in 2000
(9,384 missing values generated)
141
Only one transition to democracy
 141 is treated unit, democratized in 2000
(9,384 missing values generated)
142 had more than one transition to democracy
143 had more than one transition to democracy
144 had more than one transition to democracy
145
Only one transition to democracy
 145 is treated unit, democratized in 1993
(9,384 missing values generated)
146
Only one transition to democracy
 146 is treated unit, democratized in 1992
(9,384 missing values generated)
147
Only one transition to democracy
 147 is treated unit, democratized in 2004
(9,384 missing values generated)
148 had more than one transition to democracy
149
Only one transition to democracy
 149 is treated unit, democratized in 1994
(9,384 missing values generated)
150
Only one transition to democracy
 150 is treated unit, democratized in 1978
(9,384 missing values generated)
151 had more than one transition to democracy
152 had more than one transition to democracy
153 had more than one transition to democracy
154 had more than one transition to democracy
155 had more than one transition to democracy
156 had more than one transition to democracy
157 had more than one transition to democracy
158 had more than one transition to democracy
159 had more than one transition to democracy
160 had more than one transition to democracy
161
Only one transition to democracy
 161 is treated unit, democratized in 1991
(9,384 missing values generated)
162
Only one transition to democracy
 162 is treated unit, democratized in 1992
(9,384 missing values generated)
163 had more than one transition to democracy
164 had more than one transition to democracy
165 had more than one transition to democracy
166 had more than one transition to democracy
167 had more than one transition to democracy
168 had more than one transition to democracy
169 had more than one transition to democracy
170 had more than one transition to democracy
171 had more than one transition to democracy
172
Only one transition to democracy
Experienced a reversal
173
Only one transition to democracy
 173 is treated unit, democratized in 1994
(9,384 missing values generated)
174 had more than one transition to democracy
175 had more than one transition to democracy
176 had more than one transition to democracy
177
Only one transition to democracy
 177 is treated unit, democratized in 1985
(9,384 missing values generated)
178 had more than one transition to democracy
179 had more than one transition to democracy
180 had more than one transition to democracy
181 had more than one transition to democracy
182 had more than one transition to democracy
183
Only one transition to democracy
 183 is treated unit, democratized in 1991
(9,384 missing values generated)
184
Only one transition to democracy
Experienced a reversal

{com}. quietly replace tunit=0 if tunit==.
{txt}
{com}. 
. 
. 
. // Generate variables and prepare events datasets
. forvalues i=1/4{c -(}
{txt}  2{com}. gen lag`i'y=l`i'.y
{txt}  3{com}. {c )-}
{txt}(2,405 missing values generated)
(2,578 missing values generated)
(2,752 missing values generated)
(2,927 missing values generated)

{com}. 
. // 15 lags (15 years previous dem)
. forvalues i=0/15{c -(}
{txt}  2{com}. local k =15-`i'
{txt}  3{com}. gen ydep`i'=L`k'.y-L.y
{txt}  4{com}. {c )-}
{txt}(4,846 missing values generated)
(4,675 missing values generated)
(4,502 missing values generated)
(4,329 missing values generated)
(4,155 missing values generated)
(3,980 missing values generated)
(3,805 missing values generated)
(3,630 missing values generated)
(3,455 missing values generated)
(3,280 missing values generated)
(3,105 missing values generated)
(2,930 missing values generated)
(2,755 missing values generated)
(2,580 missing values generated)
(2,405 missing values generated)
(2,416 missing values generated)

{com}. // 30 leads
. forvalues i=16/45{c -(}
{txt}  2{com}. local k=`i'-15
{txt}  3{com}. gen ydep`i'=F`k'.y-L.y
{txt}  4{com}. {c )-}
{txt}(2,591 missing values generated)
(2,766 missing values generated)
(2,941 missing values generated)
(3,116 missing values generated)
(3,291 missing values generated)
(3,466 missing values generated)
(3,641 missing values generated)
(3,816 missing values generated)
(3,991 missing values generated)
(4,165 missing values generated)
(4,338 missing values generated)
(4,511 missing values generated)
(4,683 missing values generated)
(4,854 missing values generated)
(5,025 missing values generated)
(5,195 missing values generated)
(5,364 missing values generated)
(5,532 missing values generated)
(5,699 missing values generated)
(5,863 missing values generated)
(6,015 missing values generated)
(6,166 missing values generated)
(6,315 missing values generated)
(6,461 missing values generated)
(6,605 missing values generated)
(6,746 missing values generated)
(6,884 missing values generated)
(7,022 missing values generated)
(7,157 missing values generated)
(7,287 missing values generated)

{com}. 
. save "DDCG_with_events.dta", replace
{txt}file DDCG_with_events.dta saved

{com}. /// Save datasets
> 
. foreach var of varlist event_*{c -(}
{txt}  2{com}. preserve 
{txt}  3{com}. drop if `var'==.
{txt}  4{com}. keep `var' ydep* country_name countrynum dem tdemoc lag* year y yy*
{txt}  5{com}. order year countrynum country_name `var' tdemoc dem y ydep* lag* 
{txt}  6{com}. quiet su year if `var'==1
{txt}  7{com}. local t0=r(mean)
{txt}  8{com}. keep if year==`t0'
{txt}  9{com}. save "$auxdata/`var'.dta", replace
{txt} 10{com}. restore
{txt} 11{com}. {c )-}
{txt}(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_18_.dta saved
(7,040 observations deleted)
(2,298 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_19_.dta saved
(6,760 observations deleted)
(2,572 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_20_.dta saved
(6,910 observations deleted)
(2,425 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_23_.dta saved
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_25_.dta saved
(7,045 observations deleted)
(2,293 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_27_.dta saved
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_31_.dta saved
(7,058 observations deleted)
(2,280 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_34_.dta saved
(7,048 observations deleted)
(2,290 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_41_.dta saved
(6,258 observations deleted)
(3,064 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_43_.dta saved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_44_.dta saved
(6,407 observations deleted)
(2,918 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_49_.dta saved
(6,508 observations deleted)
(2,819 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_50_.dta saved
(6,760 observations deleted)
(2,572 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_52_.dta saved
(7,056 observations deleted)
(2,282 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_55_.dta saved
(7,053 observations deleted)
(2,285 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_62_.dta saved
(6,359 observations deleted)
(2,965 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_65_.dta saved
(6,860 observations deleted)
(2,474 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_66_.dta saved
(7,038 observations deleted)
(2,300 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_68_.dta saved
(7,056 observations deleted)
(2,282 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_70_.dta saved
(6,760 observations deleted)
(2,572 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_72_.dta saved
(7,058 observations deleted)
(2,280 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_73_.dta saved
(7,049 observations deleted)
(2,289 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_76_.dta saved
(7,046 observations deleted)
(2,292 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_86_.dta saved
(7,009 observations deleted)
(2,328 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_88_.dta saved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_92_.dta saved
(7,043 observations deleted)
(2,295 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_93_.dta saved
(7,044 observations deleted)
(2,294 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_95_.dta saved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_97_.dta saved
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_99_.dta saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_101_.dta saved
(7,056 observations deleted)
(2,282 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_104_.dta saved
(7,051 observations deleted)
(2,287 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_108_.dta saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_109_.dta saved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_110_.dta saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_112_.dta saved
(7,058 observations deleted)
(2,280 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_119_.dta saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_127_.dta saved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_129_.dta saved
(6,959 observations deleted)
(2,377 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_131_.dta saved
(7,058 observations deleted)
(2,280 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_132_.dta saved
(6,358 observations deleted)
(2,966 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_133_.dta saved
(7,058 observations deleted)
(2,280 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_135_.dta saved
(7,048 observations deleted)
(2,290 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_140_.dta saved
(7,048 observations deleted)
(2,290 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_141_.dta saved
(7,055 observations deleted)
(2,283 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_145_.dta saved
(7,056 observations deleted)
(2,282 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_146_.dta saved
(7,044 observations deleted)
(2,294 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_147_.dta saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_149_.dta saved
(6,407 observations deleted)
(2,918 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_150_.dta saved
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_161_.dta saved
(7,056 observations deleted)
(2,282 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_162_.dta saved
(7,054 observations deleted)
(2,284 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_173_.dta saved
(6,910 observations deleted)
(2,425 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_177_.dta saved
(7,057 observations deleted)
(2,281 observations deleted)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/event_183_.dta saved

{com}. 
. ********4(a)********
. ****** 4 (a) *******
. ********************
. ********************
. ********************
. ********************
. ********************
. *******4 (a)********
. ********************
. /// Proceed with estimation...
> 
. 
. use DDCG_with_events, clear 
{txt}
{com}. 
. *** 
. 
. // This one works. 
. foreach var of varlist event_*{c -(}
{txt}  2{com}. use "$auxdata/`var'.dta",replace
{txt}  3{com}. 
. forvalues s=30/34{c -(}
{txt}  4{com}. quiet su ydep`s' if `var'==1
{txt}  5{com}. di "`var'" `s' 
{txt}  6{com}. di r(mean)
{txt}  7{com}. 
. // Define first for the first event=18
. if "`var'"=="event_18_"{c -(}
{txt}  8{com}. if r(mean)!=.{c -(}
{txt}  9{com}. quiet reg ydep`s' `var' lag*, cluster(countrynum)
{txt} 10{com}. mat b`s'=(_b[`var'])
{txt} 11{com}. {c )-}
{txt} 12{com}. else {c -(}
{txt} 13{com}. mat b`s'=(.)
{txt} 14{com}. {c )-}
{txt} 15{com}. {c )-}
{txt} 16{com}. else{c -(}
{txt} 17{com}. if r(mean)!=.{c -(}
{txt} 18{com}. quiet reg ydep`s' `var' lag*, cluster(countrynum)
{txt} 19{com}. mat b`s'=b`s' \ (_b[`var'])
{txt} 20{com}. {c )-}
{txt} 21{com}. else{c -(}
{txt} 22{com}. mat b`s'=b`s' \ (.)
{txt} 23{com}. {c )-}
{txt} 24{com}. {c )-}
{txt} 25{com}. {c )-}
{txt} 26{com}. {c )-}
event_18_30
19.82959
event_18_31
21.312927
event_18_32
23.330872
event_18_33
24.161377
event_18_34
24.272339
event_19_30
.
event_19_31
.
event_19_32
.
event_19_33
.
event_19_34
.
event_20_30
-5.4272461
event_20_31
-2.6363525
event_20_32
-4.2907104
event_20_33
-3.8623657
event_20_34
-4.2119751
event_23_30
15.831238
event_23_31
15.737305
event_23_32
17.006348
event_23_33
16.850159
event_23_34
21.179382
event_25_30
33.34906
event_25_31
40.063782
event_25_32
46.555115
event_25_33
41.401306
event_25_34
42.277466
event_27_30
.
event_27_31
.
event_27_32
.
event_27_33
.
event_27_34
.
event_31_30
69.602478
event_31_31
76.908325
event_31_32
82.025391
event_31_33
84.661316
event_31_34
89.043152
event_34_30
63.268921
event_34_31
66.737732
event_34_32
70.240967
event_34_33
72.866516
event_34_34
70.221375
event_41_30
.
event_41_31
.
event_41_32
.
event_41_33
.
event_41_34
.
event_43_30
.
event_43_31
.
event_43_32
.
event_43_33
.
event_43_34
.
event_44_30
47.71167
event_44_31
42.873169
event_44_32
44.880066
event_44_33
.
event_44_34
.
event_49_30
21.022461
event_49_31
21.431946
event_49_32
24.977966
event_49_33
30.132629
event_49_34
36.160156
event_50_30
1.6522217
event_50_31
1.5210571
event_50_32
2.1557617
event_50_33
4.5026855
event_50_34
5.029541
event_52_30
21.905273
event_52_31
24.920593
event_52_32
27.751526
event_52_33
29.388611
event_52_34
30.651367
event_55_30
73.813049
event_55_31
68.691162
event_55_32
53.756531
event_55_33
56.834229
event_55_34
.
event_62_30
100.28418
event_62_31
.
event_62_32
.
event_62_33
.
event_62_34
.
event_65_30
20.922363
event_65_31
23.001465
event_65_32
22.597778
event_65_33
20.066528
event_65_34
21.214172
event_66_30
68.654114
event_66_31
80.370422
event_66_32
76.174133
event_66_33
78.074341
event_66_34
85.944702
event_68_30
.
event_68_31
.
event_68_32
.
event_68_33
.
event_68_34
.
event_70_30
53.604675
event_70_31
55.38385
event_70_32
58.439819
event_70_33
61.713013
event_70_34
.
event_72_30
2.7963867
event_72_31
3.4970093
event_72_32
-.52062988
event_72_33
2.9886475
event_72_34
3.6201782
event_73_30
23.23407
event_73_31
27.212891
event_73_32
27.482483
event_73_33
28.547729
event_73_34
21.661804
event_76_30
.
event_76_31
.
event_76_32
.
event_76_33
.
event_76_34
.
event_86_30
.
event_86_31
.
event_86_32
.
event_86_33
.
event_86_34
.
event_88_30
83.912659
event_88_31
88.052795
event_88_32
91.727783
event_88_33
96.447021
event_88_34
101.09808
event_92_30
94.041199
event_92_31
74.749023
event_92_32
75.10968
event_92_33
.
event_92_34
.
event_93_30
.
event_93_31
.
event_93_32
.
event_93_33
.
event_93_34
.
event_95_30
.
event_95_31
.
event_95_32
.
event_95_33
.
event_95_34
.
event_97_30
64.022034
event_97_31
48.630798
event_97_32
51.535461
event_97_33
.
event_97_34
.
event_99_30
-3.2721558
event_99_31
2.4589233
event_99_32
7.0658569
event_99_33
5.9347534
event_99_34
7.5617676
event_101_30
22.738678
event_101_31
26.471222
event_101_32
.
event_101_33
.
event_101_34
.
event_104_30
32.232727
event_104_31
34.027344
event_104_32
35.365601
event_104_33
36.727539
event_104_34
.
event_108_30
.
event_108_31
.
event_108_32
.
event_108_33
.
event_108_34
.
event_109_30
-3.1886597
event_109_31
3.6281738
event_109_32
.
event_109_33
.
event_109_34
.
event_110_30
59.515564
event_110_31
56.595947
event_110_32
61.144775
event_110_33
.
event_110_34
.
event_112_30
71.520142
event_112_31
76.174683
event_112_32
.
event_112_33
.
event_112_34
.
event_119_30
19.042786
event_119_31
23.24762
event_119_32
26.717041
event_119_33
28.961487
event_119_34
24.350586
event_127_30
50.653076
event_127_31
53.792053
event_127_32
.
event_127_33
.
event_127_34
.
event_129_30
7.6054077
event_129_31
1.9066772
event_129_32
14.17041
event_129_33
.
event_129_34
.
event_131_30
17.147522
event_131_31
19.956116
event_131_32
24.462463
event_131_33
27.229919
event_131_34
30.521606
event_132_30
.
event_132_31
.
event_132_32
.
event_132_33
.
event_132_34
.
event_133_30
51.965515
event_133_31
53.02832
event_133_32
50.837158
event_133_33
51.582336
event_133_34
55.513367
event_135_30
11.636719
event_135_31
19.456299
event_135_32
25.47229
event_135_33
34.634399
event_135_34
25.905884
event_140_30
.
event_140_31
.
event_140_32
.
event_140_33
.
event_140_34
.
event_141_30
.
event_141_31
.
event_141_32
.
event_141_33
.
event_141_34
.
event_145_30
70.417786
event_145_31
65.161621
event_145_32
69.107239
event_145_33
.
event_145_34
.
event_146_30
56.370972
event_146_31
59.739136
event_146_32
50.488586
event_146_33
51.402222
event_146_34
.
event_147_30
.
event_147_31
.
event_147_32
.
event_147_33
.
event_147_34
.
event_149_30
24.019836
event_149_31
25.47821
event_149_32
.
event_149_33
.
event_149_34
.
event_150_30
27.534363
event_150_31
29.620544
event_150_32
32.10675
event_150_33
34.263794
event_150_34
37.795898
event_161_30
.
event_161_31
.
event_161_32
.
event_161_33
.
event_161_34
.
event_162_30
.
event_162_31
.
event_162_32
.
event_162_33
.
event_162_34
.
event_173_30
1.3059692
event_173_31
5.8167725
event_173_32
.
event_173_33
.
event_173_34
.
event_177_30
44.058533
event_177_31
39.911316
event_177_32
31.858826
event_177_33
32.811768
event_177_34
37.749512
event_183_30
-4.0062866
event_183_31
-.56188965
event_183_32
2.3102417
event_183_33
5.7747192
event_183_34
11.524353
{txt}
{com}. 
. 
. 
. forvalues s=30/34{c -(}
{txt}  2{com}. local k=`s'-15
{txt}  3{com}. svmat b`s'
{txt}  4{com}. replace b`s'=. if b`s'==0 // If the coefficient is exactly=0 it is because of problems of colinearity, idk why that happens 
{txt}  5{com}. {c )-}
{txt}number of observations will be reset to 55
Press any key to continue, or Break to abort
{p}
number of observations (_N)  was 46,
now 55
{p_end}
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(4 real changes made, 4 to missing)
(2 real changes made, 2 to missing)
(1 real change made, 1 to missing)

{com}. 
. egen average_b= rowmean(b*)
{txt}(20 missing values generated)

{com}. 
. hist average_b, title (Effect of Democratization on Growth: Event Analysis) subtitle(Average 15-19 years after democratization) freq w(8) scheme(s1color) xtitle(Estimate) xlabel(#20) 
{txt}(bin={res}22{txt}, start={res}-39.102684{txt}, width={res}8{txt})
{res}{txt}
{com}. graph export "$figures/4a.png",replace
{txt}(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/4a.png written in PNG format)

{com}. 
. label var average_b "Average Effect 15-19 years"
{txt}
{com}. estpost su average_b,d

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(skewn~)}{space 1}{space 1}{ralign 9:e(kurto~)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:average_b}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       35}}}{space 1}{space 1}{ralign 9:{res:{sf:       35}}}{space 1}{space 1}{ralign 9:{res:{sf: 18.11395}}}{space 1}{space 1}{ralign 9:{res:{sf: 1858.429}}}{space 1}{space 1}{ralign 9:{res:{sf:  43.1095}}}{space 1}{space 1}{ralign 9:{res:{sf: .7680999}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.129425}}}{space 1}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(sum)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(p1)}{space 1}{space 1}{ralign 9:e(p5)}{space 1}{space 1}{ralign 9:e(p10)}{space 1}{space 1}{ralign 9:e(p25)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:average_b}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 633.9882}}}{space 1}{space 1}{ralign 9:{res:{sf:-39.10268}}}{space 1}{space 1}{ralign 9:{res:{sf: 130.2509}}}{space 1}{space 1}{ralign 9:{res:{sf:-39.10268}}}{space 1}{space 1}{ralign 9:{res:{sf:-36.54499}}}{space 1}{space 1}{ralign 9:{res:{sf:-33.89811}}}{space 1}{space 1}{ralign 9:{res:{sf:-15.72699}}}{space 1}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(p50)}{space 1}{space 1}{ralign 9:e(p75)}{space 1}{space 1}{ralign 9:e(p90)}{space 1}{space 1}{ralign 9:e(p95)}{space 1}{space 1}{ralign 9:e(p99)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:average_b}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 6.906044}}}{space 1}{space 1}{ralign 9:{res:{sf: 50.35049}}}{space 1}{space 1}{ralign 9:{res:{sf: 68.88967}}}{space 1}{space 1}{ralign 9:{res:{sf: 118.6681}}}{space 1}{space 1}{ralign 9:{res:{sf: 130.2509}}}{space 1}

{com}. eststo summary4a
{txt}
{com}. esttab summary4a using "$tables/summary4a.tex", ///
>      label noobs nonumbers nomtitles ty  booktabs replace        ///
>      cell((                                        ///
>             count(fmt(%9.0fc)  label(Obs.))        ///
>              mean(fmt(%10.2fc) label(Mean))        ///
>               p50(fmt(%8.1fc)  label(Median))      ///
>                sd(fmt(%10.2fc) label(Std. Dev.))   ///
>           )) ///
> title(Summary of Event-Estimates) 
{res}
\begin{c -(}table{c )-}[htbp]\centering
\def\sym#1{c -(}\ifmmode^{c -(}#1{c )-}\else\(^{c -(}#1{c )-}\)\fi{c )-}
\caption{c -(}Summary of Event-Estimates{c )-}
\begin{c -(}tabular{c )-}{c -(}l*{c -(}1{c )-}{c -(}cccc{c )-}{c )-}
\toprule
                    &        Obs.&        Mean&      Median&   Std. Dev.\\
\midrule
Average Effect 15-19 years&          35&       18.11&         6.9&       43.11\\
\bottomrule
\end{c -(}tabular{c )-}
\end{c -(}table{c )-}
{txt}(output written to {browse  `"C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/summary4a.tex"'})

{com}. 
. ********4(b)********
. ****** 4 (b) *******
. ********************
. ********************
. ********************
. ********************
. ********************
. *******4 (b)********
. ********************
. 
. /*The basic  steps are described in Ferman and Pintoâs paper (p. 457-458), which is in our syllabus Yes, youâre right itâs Figure D1, Iâll make that correction. You can use the population of the country as the M, or can simply set M=1 for all countries for simplicity (in which case the estimates are basically like Conley and Taber and donât correct for heteroscedasticty). 
> 
> If you canât implement the FP SEs, at the minimum, show the distribution of estimates from the events even if the standard errors arenât âcorrectâ  [make a note of that in your writeup.]*/
. use DDCG_with_events, clear 
{txt}
{com}. 
. foreach var of varlist event_*{c -(}
{txt}  2{com}. di "`var'"
{txt}  3{com}. use "$auxdata/`var'.dta", clear
{txt}  4{com}. egen ydepmean= rowmean(ydep30 ydep31 ydep32 ydep33 ydep34)
{txt}  5{com}. rename `var' treatment
{txt}  6{com}. if "`var'"=="event_18_"{c -(}
{txt}  7{com}. quiet reg ydepmean treatment lag*, cluster(countrynum)
{txt}  8{com}. mat ests=(_b[treatment],r(table)[5,1],r(table)[6,1])
{txt}  9{com}. {c )-}
{txt} 10{com}. 
. 
. else{c -(}
{txt} 11{com}. cap: quiet reg ydepmean treatment lag*, cluster(countrynum)
{txt} 12{com}. if _rc==0{c -(}
{txt} 13{com}. mat ests= ests \ (_b[treatment],r(table)[5,1],r(table)[6,1])
{txt} 14{com}. {c )-}
{txt} 15{com}. else{c -(}
{txt} 16{com}. di "No observations"
{txt} 17{com}. {c )-}
{txt} 18{com}. {c )-}
{txt} 19{com}. {c )-}
event_18_
{txt}(10 missing values generated)
{res}event_19_
{txt}(46 missing values generated)
{res}No observations
event_20_
{txt}(23 missing values generated)
{res}event_23_
{txt}(19 missing values generated)
{res}event_25_
{txt}(10 missing values generated)
{res}event_27_
{txt}(46 missing values generated)
{res}No observations
event_31_
{txt}(10 missing values generated)
{res}event_34_
{txt}(12 missing values generated)
{res}event_41_
{txt}(46 missing values generated)
{res}No observations
event_43_
{txt}(33 missing values generated)
{res}event_44_
{txt}(9 missing values generated)
{res}event_49_
{txt}(29 missing values generated)
{res}event_50_
{txt}(28 missing values generated)
{res}event_52_
{txt}(23 missing values generated)
{res}event_55_
{txt}(10 missing values generated)
{res}event_62_
{txt}(12 missing values generated)
{res}event_65_
{txt}(30 missing values generated)
{res}event_66_
{txt}(22 missing values generated)
{res}event_68_
{txt}(46 missing values generated)
{res}No observations
event_70_
{txt}(10 missing values generated)
{res}event_72_
{txt}(23 missing values generated)
{res}event_73_
{txt}(12 missing values generated)
{res}event_76_
{txt}(46 missing values generated)
{res}No observations
event_86_
{txt}(46 missing values generated)
{res}No observations
event_88_
{txt}(13 missing values generated)
{res}event_92_
{txt}(9 missing values generated)
{res}event_93_
{txt}(46 missing values generated)
{res}No observations
event_95_
{txt}(46 missing values generated)
{res}No observations
event_97_
{txt}(9 missing values generated)
{res}event_99_
{txt}(10 missing values generated)
{res}event_101_
{txt}(10 missing values generated)
{res}event_104_
{txt}(10 missing values generated)
{res}event_108_
{txt}(46 missing values generated)
{res}No observations
event_109_
{txt}(10 missing values generated)
{res}event_110_
{txt}(9 missing values generated)
{res}event_112_
{txt}(10 missing values generated)
{res}event_119_
{txt}(12 missing values generated)
{res}event_127_
{txt}(10 missing values generated)
{res}event_129_
{txt}(9 missing values generated)
{res}event_131_
{txt}(15 missing values generated)
{res}event_132_
{txt}(13 missing values generated)
{res}event_133_
{txt}(29 missing values generated)
{res}event_135_
{txt}(12 missing values generated)
{res}event_140_
{txt}(46 missing values generated)
{res}No observations
event_141_
{txt}(46 missing values generated)
{res}No observations
event_145_
{txt}(9 missing values generated)
{res}event_146_
{txt}(10 missing values generated)
{res}event_147_
{txt}(46 missing values generated)
{res}No observations
event_149_
{txt}(10 missing values generated)
{res}event_150_
{txt}(29 missing values generated)
{res}event_161_
{txt}(11 missing values generated)
{res}event_162_
{txt}(11 missing values generated)
{res}event_173_
{txt}(10 missing values generated)
{res}event_177_
{txt}(19 missing values generated)
{res}event_183_
{txt}(10 missing values generated)
{res}{txt}
{com}. 
. 
. svmat ests 
{txt}
{com}. drop if ests2==. | ests3==.
{txt}(11 observations deleted)

{com}. label var ests1 "Average Effect 15-19 years"
{txt}
{com}. sort ests1
{txt}
{com}. 
. gen evening=.
{txt}(35 missing values generated)

{com}. forvalues i=1/35{c -(}
{txt}  2{com}. replace evening=`i' in `i'
{txt}  3{com}. {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. 
. twoway ///
> rbar ests2 ests3 evening , xline(0) scheme(s1color) horizontal color(gs12) ||  ///
> scatter evening  ests1 if ests2>0 | ests3<0, mcolor(blue) || ///
> scatter evening  ests1 if ests2<0 & ests3>0, mcolor(red) ///
> ytitle(Event) xtitle(Estimate 15-19 years) legend(label(1 "Lower/Upper 95%"  ) label(2 "Significant") label(3 "Non-significant"))
{res}{txt}
{com}. graph export "$figures/4b.png", replace
{txt}(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/4b.png written in PNG format)

{com}. 
. estpost su ests1, d

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(skewn~)}{space 1}{space 1}{ralign 9:e(kurto~)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:ests1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:       35}}}{space 1}{space 1}{ralign 9:{res:{sf:       35}}}{space 1}{space 1}{ralign 9:{res:{sf: 17.90633}}}{space 1}{space 1}{ralign 9:{res:{sf: 1851.763}}}{space 1}{space 1}{ralign 9:{res:{sf: 43.03212}}}{space 1}{space 1}{ralign 9:{res:{sf: .7851936}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.184998}}}{space 1}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(sum)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(p1)}{space 1}{space 1}{ralign 9:e(p5)}{space 1}{space 1}{ralign 9:e(p10)}{space 1}{space 1}{ralign 9:e(p25)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:ests1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 626.7215}}}{space 1}{space 1}{ralign 9:{res:{sf:-38.79275}}}{space 1}{space 1}{ralign 9:{res:{sf: 130.7049}}}{space 1}{space 1}{ralign 9:{res:{sf:-38.79275}}}{space 1}{space 1}{ralign 9:{res:{sf:-36.18394}}}{space 1}{space 1}{ralign 9:{res:{sf:-34.88939}}}{space 1}{space 1}{ralign 9:{res:{sf:-16.00507}}}{space 1}

{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(p50)}{space 1}{space 1}{ralign 9:e(p75)}{space 1}{space 1}{ralign 9:e(p90)}{space 1}{space 1}{ralign 9:e(p95)}{space 1}{space 1}{ralign 9:e(p99)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:ests1}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 7.803573}}}{space 1}{space 1}{ralign 9:{res:{sf: 50.35049}}}{space 1}{space 1}{ralign 9:{res:{sf: 68.88967}}}{space 1}{space 1}{ralign 9:{res:{sf: 118.6681}}}{space 1}{space 1}{ralign 9:{res:{sf: 130.7049}}}{space 1}

{com}. eststo summary4b
{txt}
{com}. 
.         
. esttab summary4b using "$tables/summary4b.tex", ///
>      label noobs nonumbers nomtitles ty  booktabs replace        ///
>      cell((                                        ///
>             count(fmt(%9.0fc)  label(Obs.))        ///
>              mean(fmt(%10.2fc) label(Mean))        ///
>               p50(fmt(%8.1fc)  label(Median))      ///
>                sd(fmt(%10.2fc) label(Std. Dev.))   ///
>           )) ///
> title(Summary of Event-Estimates) 
{res}
\begin{c -(}table{c )-}[htbp]\centering
\def\sym#1{c -(}\ifmmode^{c -(}#1{c )-}\else\(^{c -(}#1{c )-}\)\fi{c )-}
\caption{c -(}Summary of Event-Estimates{c )-}
\begin{c -(}tabular{c )-}{c -(}l*{c -(}1{c )-}{c -(}cccc{c )-}{c )-}
\toprule
                    &        Obs.&        Mean&      Median&   Std. Dev.\\
\midrule
Average Effect 15-19 years&          35&       17.91&         7.8&       43.03\\
\bottomrule
\end{c -(}tabular{c )-}
\end{c -(}table{c )-}
{txt}(output written to {browse  `"C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/summary4b.tex"'})

{com}. 
. 
. 
. 
. **** Do Conley Taber Â¯\_(ã)_/Â¯
. 
. ****************
. ****** Conley Taber
. 
. // Prepare dataset, same than as the beginning of par 4 but keeping all years for treated countries
. 
. ********4(c)********
. ********4 (c) *******
. ********************
. ********************
. ********************
. ********************
. ********************
. ********4 (c)********
. ********************
. 
. // Stack in wide format
. use DDCG_with_events, clear 
{txt}
{com}. 
. 
. // Generate FE
. foreach var of varlist event_*{c -(}
{txt}  2{com}. use "$auxdata/`var'.dta", clear
{txt}  3{com}. replace `var'=1 if `var'==0
{txt}  4{com}. replace tdemoc=0 if tdemoc==.
{txt}  5{com}. drop year
{txt}  6{com}. sa "$auxdata/fe_`var'.dta", replace
{txt}  7{com}. {c )-}
{txt}(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_18_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_19_.dta saved
(51 real changes made)
(51 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_20_.dta saved
(48 real changes made)
(48 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_23_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_25_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_27_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_31_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_34_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_41_.dta saved
(61 real changes made)
(61 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_43_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_44_.dta saved
(58 real changes made)
(58 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_49_.dta saved
(56 real changes made)
(56 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_50_.dta saved
(51 real changes made)
(51 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_52_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_55_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_62_.dta saved
(59 real changes made)
(59 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_65_.dta saved
(49 real changes made)
(49 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_66_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_68_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_70_.dta saved
(51 real changes made)
(51 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_72_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_73_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_76_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_86_.dta saved
(46 real changes made)
(46 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_88_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_92_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_93_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_95_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_97_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_99_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_101_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_104_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_108_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_109_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_110_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_112_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_119_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_127_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_129_.dta saved
(47 real changes made)
(47 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_131_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_132_.dta saved
(59 real changes made)
(59 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_133_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_135_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_140_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_141_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_145_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_146_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_147_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_149_.dta saved
(58 real changes made)
(58 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_150_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_161_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_162_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_173_.dta saved
(48 real changes made)
(48 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_177_.dta saved
(45 real changes made)
(45 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/fe_event_183_.dta saved

{com}. 
. use DDCG_with_events, clear 
{txt}
{com}. foreach var of varlist event_*{c -(}
{txt}  2{com}. 
. if "`var'"=="event_18_"{c -(}
{txt}  3{com}. use "$auxdata/fe_`var'.dta", clear
{txt}  4{com}. {c )-}
{txt}  5{com}. else{c -(}
{txt}  6{com}. append using "$auxdata/fe_`var'.dta"
{txt}  7{com}. {c )-}
{txt}  8{com}. {c )-}
{txt}
{com}. 
. foreach var of varlist event_*{c -(}
{txt}  2{com}. replace `var'=0 if `var'==.
{txt}  3{com}. {c )-}
{txt}(2,596 real changes made)
(2,596 real changes made)
(2,590 real changes made)
(2,593 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,580 real changes made)
(2,596 real changes made)
(2,583 real changes made)
(2,585 real changes made)
(2,590 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,582 real changes made)
(2,592 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,590 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,595 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,594 real changes made)
(2,596 real changes made)
(2,582 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,583 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,593 real changes made)
(2,596 real changes made)

{com}. order event_*
{txt}
{com}. 
. capture program drop  fe_event 
{txt}
{com}. program fe_event, eclass 
{txt}  1{com}. forvalues s=30/34{c -(}
{txt}  2{com}. local k= `s'-29
{txt}  3{com}. quiet reg ydep`s' tdemoc lag*  event_*, cluster (countrynum)
{txt}  4{com}. di _b[tdemoc]
{txt}  5{com}. est sto r`k'
{txt}  6{com}. if `s'==30 {c -(}
{txt}  7{com}. mat b=(_b[tdemoc])
{txt}  8{com}. local v`k'=e(V)[1,1]
{txt}  9{com}. {c )-} 
{txt} 10{com}. else{c -(}
{txt} 11{com}. mat b=(b, _b[tdemoc])
{txt} 12{com}. local v`k'=e(V)[1,1]
{txt} 13{com}. {c )-}
{txt} 14{com}. {c )-}
{txt} 15{com}. matrix V=J(5,5,1)
{txt} 16{com}. matrix V[1,1]=`v1'
{txt} 17{com}. matrix V[2,2]=`v2'
{txt} 18{com}. matrix V[3,3]=`v3'
{txt} 19{com}. matrix V[4,4]=`v4'
{txt} 20{com}. matrix V[5,5]=`v5'
{txt} 21{com}. matrix rownames V= "c1" "c2" "c3" "c4" "c5"
{txt} 22{com}. mat list V
{txt} 23{com}. mat list b
{txt} 24{com}. 
. ereturn post b V
{txt} 25{com}. *ereturn post V
. end
{txt}
{com}. 
. //bootstrap standard errors
. set seed 12345
{txt}
{com}. bootstrap _b: fe_event
{txt}(running {bf:fe_event} on estimation sample)

{p 0 10 2} Warning:  Because {cmd:fe_event} is not an estimation command or does not set {cmd:e(sample)}, {cmd:bootstrap} has no way to determine which observations are used in calculating the statistics and so assumes that all observations are used.  This means that no observations will be excluded from the resampling because of missing values or other reasons.{p_end}

{p 10 10 2} If the assumption is not true, press Break, save the data, and drop the observations that are to be excluded. 
Be sure that the dataset in memory contains only the relevant data.{p_end}

Bootstrap replications ({res}50{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
{res}
{txt}Bootstrap results{col 49}Number of obs{col 67}= {res}     2,642
{txt}{col 49}Replications{col 67}= {res}        50

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}c1 {c |}{col 14}{res}{space 2} 15.95492{col 26}{space 2} 7.342333{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} 1.564208{col 67}{space 3} 30.34562
{txt}{space 10}c2 {c |}{col 14}{res}{space 2} 12.29896{col 26}{space 2} 6.927709{col 37}{space 1}    1.78{col 46}{space 3}0.076{col 54}{space 4}-1.279105{col 67}{space 3} 25.87702
{txt}{space 10}c3 {c |}{col 14}{res}{space 2}  19.6995{col 26}{space 2} 7.977465{col 37}{space 1}    2.47{col 46}{space 3}0.014{col 54}{space 4} 4.063955{col 67}{space 3} 35.33504
{txt}{space 10}c4 {c |}{col 14}{res}{space 2} 17.33512{col 26}{space 2} 7.035737{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} 3.545326{col 67}{space 3} 31.12491
{txt}{space 10}c5 {c |}{col 14}{res}{space 2} 18.61164{col 26}{space 2} 7.616847{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} 3.682895{col 67}{space 3} 33.54038
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. nlcom (tdemoc: (_b[c1]+_b[c2]+_b[c3]+_b[c4] +_b[c5])/5), post

      {txt}tdemoc:  {res}(_b[c1]+_b[c2]+_b[c3]+_b[c4] +_b[c5])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tdemoc {c |}{col 14}{res}{space 2} 16.78003{col 26}{space 2}  6.73486{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} 3.579942{col 67}{space 3} 29.98011
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo avb
{txt}
{com}. 
. // cluster standard errors
. fe_event
15.954916
12.298956
19.699498
17.335117
18.61164
{res}
{txt}symmetric V[5,5]
           c1         c2         c3         c4         c5
c1 {res} 98.453203
{txt}c2 {res}         1  90.024329
{txt}c3 {res}         1          1  108.03712
{txt}c4 {res}         1          1          1   100.7735
{txt}c5 {res}         1          1          1          1  109.29295
{reset}{res}
{txt}b[1,5]
           c1         c2         c3         c4         c5
r1 {res} 15.954916  12.298956  19.699498  17.335117   18.61164
{reset}
{com}. nlcom (tdemoc: (_b[c1]+_b[c2]+_b[c3]+_b[c4]+_b[c5])/5), post

      {txt}tdemoc:  {res}(_b[c1]+_b[c2]+_b[c3]+_b[c4]+_b[c5])/5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tdemoc {c |}{col 14}{res}{space 2} 16.78003{col 26}{space 2} 4.589471{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} 7.784828{col 67}{space 3} 25.77522
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. eststo avc   
{txt}
{com}. 
. esttab r1 r2 r3 r4 r5 avc avb using "$tables/4c.tex", replace keep(tdemoc)  se nostar varlabels (tdemoc "Avg. effect on log GDP") b(3)   wrap nonotes ty mlabels("15 years" "16 years" "17 years" "18 years" "19 years" "Av." "Av.(Bootstrap)")
{res}
\begin{c -(}tabular{c )-}{c -(}l*{c -(}7{c )-}{c -(}c{c )-}{c )-}
\hline\hline
            &\multicolumn{c -(}1{c )-}{c -(}c{c )-}{c -(}(1){c )-}&\multicolumn{c -(}1{c )-}{c -(}c{c )-}{c -(}(2){c )-}&\multicolumn{c -(}1{c )-}{c -(}c{c )-}{c -(}(3){c )-}&\multicolumn{c -(}1{c )-}{c -(}c{c )-}{c -(}(4){c )-}&\multicolumn{c -(}1{c )-}{c -(}c{c )-}{c -(}(5){c )-}&\multicolumn{c -(}1{c )-}{c -(}c{c )-}{c -(}(6){c )-}&\multicolumn{c -(}1{c )-}{c -(}c{c )-}{c -(}(7){c )-}\\
            &    15 years&    16 years&    17 years&    18 years&    19 years&         Av.&Av.(Bootstrap)\\
\hline
Avg. effect &      15.955&      12.299&      19.699&      17.335&      18.612&      16.780&      16.780\\
on log GDP  &     (9.922)&     (9.488)&    (10.394)&    (10.039)&    (10.454)&     (4.589)&     (6.735)\\
\hline
\(N\)       &        1348&        1292&        1077&         878&         707&            &        2642\\
\hline\hline
\end{c -(}tabular{c )-}
{txt}(output written to {browse  `"C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/tables/4c.tex"'})

{com}. 
. ///  GET A FIGURE LIKE 4 WITHOUT WEIGHTS USING ALL EVENTS////////
> /// ////////////////////////////////////////////////////////////
> 
. /// Data win Wide format with FE
> use DDCG_with_events, clear 
{txt}
{com}. foreach var of varlist event_*{c -(}
{txt}  2{com}. 
. if "`var'"=="event_18_"{c -(}
{txt}  3{com}. use "$auxdata/fe_`var'.dta", clear
{txt}  4{com}. {c )-}
{txt}  5{com}. else{c -(}
{txt}  6{com}. append using "$auxdata/fe_`var'.dta"
{txt}  7{com}. {c )-}
{txt}  8{com}. {c )-}
{txt}
{com}. 
. foreach var of varlist event_*{c -(}
{txt}  2{com}. replace `var'=0 if `var'==.
{txt}  3{com}. {c )-}
{txt}(2,596 real changes made)
(2,596 real changes made)
(2,590 real changes made)
(2,593 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,580 real changes made)
(2,596 real changes made)
(2,583 real changes made)
(2,585 real changes made)
(2,590 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,582 real changes made)
(2,592 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,590 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,595 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,594 real changes made)
(2,596 real changes made)
(2,582 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,583 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,596 real changes made)
(2,593 real changes made)
(2,596 real changes made)

{com}. order event_*
{txt}
{com}. 
. //// Estimation
> 
. forvalues s=0/45{c -(}
{txt}  2{com}. quiet reg ydep`s' tdemoc i.event_*  lag*, cluster(countrynum)
{txt}  3{com}. if `s'==0{c -(}
{txt}  4{com}. mat ests=(_b[tdemoc], r(table)[5,1],r(table)[6,1])
{txt}  5{com}. {c )-}
{txt}  6{com}. else{c -(}
{txt}  7{com}. mat ests=ests\(_b[tdemoc], r(table)[5,1],r(table)[6,1])
{txt}  8{com}. mat colnames ests="b" "ll" "ul"
{txt}  9{com}. {c )-}
{txt} 10{com}. {c )-}
{txt}
{com}. 
. svmat ests
{txt}
{com}. cap drop yad
{txt}
{com}. gen yad=. 
{txt}(2,642 missing values generated)

{com}. forvalues i=0/45{c -(}
{txt}  2{com}. local k=`i'-14
{txt}  3{com}. local j=`i'+1
{txt}  4{com}. replace yad=`k' in `j'
{txt}  5{com}. {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. 
. line ests1 yad, lcolor(black) scheme(s1color) xtitle(Years around democratization) ytitle(Change in GDP per capita log points) yline(0, lcolor(black) lpattern(dash))||line ests2 yad,  lcolor(gray) lpattern(dash)||line ests3 yad,  lcolor(gray) lpattern(dash) legend(off)
{res}{txt}
{com}. graph export "$figures/part5no_weights.png", replace
{txt}(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part5no_weights.png written in PNG format)

{com}. 
. 
. *******PART 5***************************
. ****************************************
. ****************************************
. *******PART 5***************************
. ****************************************
. ****************************************
. ****************************************
. ****** PART 5***************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 5**************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ****************************************
. ********PART 5**************************
. ****************************************
. ****************************************
. 
. 
. ///////////// Get synth_events ///////////
> //////////////////////////////////////////
> 
. use DDCG_with_events, clear
{txt}
{com}. 
. foreach var of varlist event_*{c -(}
{txt}  2{com}. preserve
{txt}  3{com}. di "`var'" 
{txt}  4{com}. quiet su year if `var'==1
{txt}  5{com}. local t0 = r(mean)
{txt}  6{com}. sca t0= r(mean)
{txt}  7{com}. sca t10=t0-10
{txt}  8{com}. sca t15=t0-15
{txt}  9{com}. quiet su countrynum if `var'== 1
{txt} 10{com}. sca tcountry=r(mean)
{txt} 11{com}. quietly drop if `var'==.
{txt} 12{com}. quietly drop if year<t10 // Critical 1
{txt} 13{com}. 
. egen countrynum2=group(country_name)
{txt} 14{com}. quiet su countrynum2 
{txt} 15{com}. local mincountry=r(min)
{txt} 16{com}. local maxcountry=r(max)
{txt} 17{com}. forvalues i=`mincountry'/`maxcountry'{c -(}
{txt} 18{com}. quiet su year if countrynum2==`i'
{txt} 19{com}. local N=r(N)
{txt} 20{com}. local N5= `N'-10 // Critical 2
{txt} 21{com}. quiet su y if countrynum2==`i'
{txt} 22{com}. di r(N)
{txt} 23{com}. di `N5'
{txt} 24{com}. if r(N)<`N' {c -(}
{txt} 25{com}. drop if countrynum2==`i' 
{txt} 26{com}. {c )-}
{txt} 27{com}. else{c -(}
{txt} 28{com}. di "No"
{txt} 29{com}. {c )-}
{txt} 30{com}. {c )-}
{txt} 31{com}. rename `var'  synth_`var'
{txt} 32{com}. 
. keep synth_`var' ydep* country_name countrynum dem tdemoc lag* year y yy*
{txt} 33{com}. order year synth_`var' countrynum country_name  tdemoc dem y ydep* lag* 
{txt} 34{com}. keep if year==`t0'
{txt} 35{com}. replace synth_`var'=1 
{txt} 36{com}. replace tdemoc=0 if tdemoc==.
{txt} 37{com}. save "$auxdata/synth_`var'.dta", replace
{txt} 38{com}. restore
{txt} 39{com}. {c )-}
event_18_
0
20
{txt}(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
11
1
No
17
20
(30 observations deleted)
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
{res}{txt}(590 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_18_.dta saved
event_19_
0
3
(13 observations deleted)
13
3
No
13
3
No
11
3
(13 observations deleted)
11
1
No
13
3
No
12
3
(13 observations deleted)
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
12
3
(13 observations deleted)
13
3
No
13
3
No
13
3
No
10
3
(13 observations deleted)
13
3
No
11
3
(13 observations deleted)
13
3
No
13
3
No
13
3
No
0
3
(13 observations deleted)
12
3
(13 observations deleted)
10
3
(13 observations deleted)
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
13
3
No
0
3
(13 observations deleted)
13
3
No
13
3
No
13
3
No
{res}{txt}(430 observations deleted)
(35 real changes made)
(35 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_19_.dta saved
event_20_
0
29
(39 observations deleted)
39
29
No
26
29
(39 observations deleted)
29
29
(39 observations deleted)
30
29
(39 observations deleted)
11
1
No
17
29
(39 observations deleted)
36
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
26
29
(39 observations deleted)
19
29
(39 observations deleted)
39
29
No
25
29
(39 observations deleted)
38
29
(39 observations deleted)
14
29
(39 observations deleted)
36
29
(39 observations deleted)
21
29
(39 observations deleted)
13
29
(39 observations deleted)
25
29
(39 observations deleted)
27
29
(39 observations deleted)
39
29
No
11
29
(39 observations deleted)
39
29
No
16
29
(39 observations deleted)
39
29
No
39
29
No
0
29
(39 observations deleted)
38
29
(39 observations deleted)
10
29
(39 observations deleted)
39
29
No
29
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
26
29
(39 observations deleted)
23
29
(39 observations deleted)
39
29
No
30
29
(39 observations deleted)
39
29
No
24
29
(39 observations deleted)
0
29
(39 observations deleted)
24
29
(39 observations deleted)
27
29
(39 observations deleted)
21
29
(39 observations deleted)
{res}{txt}(808 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_20_.dta saved
event_23_
0
26
(36 observations deleted)
36
26
No
26
26
(36 observations deleted)
29
26
(36 observations deleted)
30
26
(36 observations deleted)
17
26
(36 observations deleted)
11
1
No
35
26
(36 observations deleted)
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
26
26
(36 observations deleted)
19
26
(36 observations deleted)
36
26
No
25
26
(36 observations deleted)
35
26
(36 observations deleted)
14
26
(36 observations deleted)
36
26
No
21
26
(36 observations deleted)
13
26
(36 observations deleted)
27
26
(36 observations deleted)
11
26
(36 observations deleted)
36
26
No
16
26
(36 observations deleted)
36
26
No
36
26
No
0
26
(36 observations deleted)
35
26
(36 observations deleted)
10
26
(36 observations deleted)
36
26
No
29
26
(36 observations deleted)
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
26
26
(36 observations deleted)
23
26
(36 observations deleted)
36
26
No
30
26
(36 observations deleted)
36
26
No
24
26
(36 observations deleted)
0
26
(36 observations deleted)
24
26
(36 observations deleted)
27
26
(36 observations deleted)
21
26
(36 observations deleted)
{res}{txt}(710 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_23_.dta saved
event_25_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
17
20
(30 observations deleted)
29
20
(30 observations deleted)
11
1
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
{res}{txt}(590 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_25_.dta saved
event_27_
0
8
(18 observations deleted)
18
8
No
18
8
No
16
8
(18 observations deleted)
17
8
(18 observations deleted)
17
8
(18 observations deleted)
11
1
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
17
8
(18 observations deleted)
14
8
(18 observations deleted)
18
8
No
18
8
No
13
8
(18 observations deleted)
18
8
No
11
8
(18 observations deleted)
18
8
No
16
8
(18 observations deleted)
18
8
No
0
8
(18 observations deleted)
17
8
(18 observations deleted)
10
8
(18 observations deleted)
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
18
8
No
0
8
(18 observations deleted)
18
8
No
18
8
No
18
8
No
{res}{txt}(554 observations deleted)
(32 real changes made)
(32 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_27_.dta saved
event_31_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
17
20
(30 observations deleted)
29
20
(30 observations deleted)
30
20
No
11
1
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
{res}{txt}(590 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_31_.dta saved
event_34_
0
21
(31 observations deleted)
31
21
No
26
21
(31 observations deleted)
29
21
(31 observations deleted)
17
21
(31 observations deleted)
30
21
(31 observations deleted)
31
21
No
31
21
No
11
1
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
19
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
14
21
(31 observations deleted)
31
21
No
21
21
(31 observations deleted)
13
21
(31 observations deleted)
27
21
(31 observations deleted)
11
21
(31 observations deleted)
31
21
No
16
21
(31 observations deleted)
31
21
No
0
21
(31 observations deleted)
30
21
(31 observations deleted)
10
21
(31 observations deleted)
31
21
No
29
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
23
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
31
21
No
24
21
(31 observations deleted)
0
21
(31 observations deleted)
24
21
(31 observations deleted)
27
21
(31 observations deleted)
21
21
(31 observations deleted)
{res}{txt}(580 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_34_.dta saved
event_41_
0
11
(21 observations deleted)
21
11
No
21
11
No
19
11
(21 observations deleted)
17
11
(21 observations deleted)
20
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
21
11
No
11
1
No
21
11
No
21
11
No
21
11
No
19
11
(21 observations deleted)
21
11
No
20
11
(21 observations deleted)
14
11
(21 observations deleted)
21
11
No
21
11
No
13
11
(21 observations deleted)
21
11
No
11
11
(21 observations deleted)
21
11
No
16
11
(21 observations deleted)
21
11
No
0
11
(21 observations deleted)
20
11
(21 observations deleted)
10
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
0
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
{res}{txt}(630 observations deleted)
(31 real changes made)
(31 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_41_.dta saved
event_43_
0
37
(47 observations deleted)
47
37
No
26
37
(47 observations deleted)
29
37
(47 observations deleted)
30
37
(47 observations deleted)
17
37
(47 observations deleted)
36
37
(47 observations deleted)
47
37
No
47
37
No
47
37
No
47
37
No
47
37
No
21
37
(47 observations deleted)
41
37
(47 observations deleted)
0
1
(11 observations deleted)
47
37
No
20
37
(47 observations deleted)
47
37
No
26
37
(47 observations deleted)
19
37
(47 observations deleted)
30
37
(47 observations deleted)
47
37
No
46
37
(47 observations deleted)
25
37
(47 observations deleted)
47
37
No
45
37
(47 observations deleted)
14
37
(47 observations deleted)
36
37
(47 observations deleted)
21
37
(47 observations deleted)
47
37
No
13
37
(47 observations deleted)
25
37
(47 observations deleted)
27
37
(47 observations deleted)
47
37
No
11
37
(47 observations deleted)
47
37
No
16
37
(47 observations deleted)
47
37
No
47
37
No
47
37
No
0
37
(47 observations deleted)
46
37
(47 observations deleted)
10
37
(47 observations deleted)
47
37
No
29
37
(47 observations deleted)
43
37
(47 observations deleted)
47
37
No
0
37
(47 observations deleted)
47
37
No
47
37
No
41
37
(47 observations deleted)
47
37
No
26
37
(47 observations deleted)
23
37
(47 observations deleted)
47
37
No
30
37
(47 observations deleted)
47
37
No
24
37
(47 observations deleted)
0
37
(47 observations deleted)
24
37
(47 observations deleted)
27
37
(47 observations deleted)
21
37
(47 observations deleted)
{res}{txt}(1,058 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_43_.dta saved
event_44_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
4
1
(11 observations deleted)
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
18
(28 observations deleted)
28
18
No
16
18
(28 observations deleted)
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
{res}{txt}(567 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_44_.dta saved
event_49_
0
33
(43 observations deleted)
43
33
No
26
33
(43 observations deleted)
29
33
(43 observations deleted)
30
33
(43 observations deleted)
17
33
(43 observations deleted)
36
33
(43 observations deleted)
43
33
No
43
33
No
43
33
No
43
33
No
43
33
No
21
33
(43 observations deleted)
41
33
(43 observations deleted)
43
33
No
20
33
(43 observations deleted)
11
1
No
43
33
No
26
33
(43 observations deleted)
19
33
(43 observations deleted)
43
33
No
25
33
(43 observations deleted)
43
33
No
42
33
(43 observations deleted)
14
33
(43 observations deleted)
36
33
(43 observations deleted)
21
33
(43 observations deleted)
43
33
No
13
33
(43 observations deleted)
25
33
(43 observations deleted)
27
33
(43 observations deleted)
43
33
No
11
33
(43 observations deleted)
43
33
No
16
33
(43 observations deleted)
43
33
No
43
33
No
0
33
(43 observations deleted)
42
33
(43 observations deleted)
10
33
(43 observations deleted)
43
33
No
29
33
(43 observations deleted)
43
33
No
43
33
No
0
33
(43 observations deleted)
43
33
No
43
33
No
41
33
(43 observations deleted)
43
33
No
26
33
(43 observations deleted)
23
33
(43 observations deleted)
43
33
No
30
33
(43 observations deleted)
43
33
No
24
33
(43 observations deleted)
0
33
(43 observations deleted)
24
33
(43 observations deleted)
27
33
(43 observations deleted)
21
33
(43 observations deleted)
{res}{txt}(976 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_49_.dta saved
event_50_
0
32
(42 observations deleted)
42
32
No
26
32
(42 observations deleted)
29
32
(42 observations deleted)
30
32
(42 observations deleted)
17
32
(42 observations deleted)
36
32
(42 observations deleted)
42
32
No
42
32
No
42
32
No
42
32
No
42
32
No
21
32
(42 observations deleted)
41
32
(42 observations deleted)
42
32
No
11
1
No
42
32
No
26
32
(42 observations deleted)
19
32
(42 observations deleted)
42
32
No
25
32
(42 observations deleted)
41
32
(42 observations deleted)
14
32
(42 observations deleted)
36
32
(42 observations deleted)
21
32
(42 observations deleted)
42
32
No
13
32
(42 observations deleted)
25
32
(42 observations deleted)
27
32
(42 observations deleted)
42
32
No
11
32
(42 observations deleted)
42
32
No
16
32
(42 observations deleted)
42
32
No
42
32
No
0
32
(42 observations deleted)
41
32
(42 observations deleted)
10
32
(42 observations deleted)
42
32
No
29
32
(42 observations deleted)
42
32
No
42
32
No
0
32
(42 observations deleted)
42
32
No
42
32
No
41
32
(42 observations deleted)
42
32
No
26
32
(42 observations deleted)
23
32
(42 observations deleted)
42
32
No
30
32
(42 observations deleted)
42
32
No
24
32
(42 observations deleted)
0
32
(42 observations deleted)
24
32
(42 observations deleted)
27
32
(42 observations deleted)
21
32
(42 observations deleted)
{res}{txt}(912 observations deleted)
(22 real changes made)
(22 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_50_.dta saved
event_52_
0
29
(39 observations deleted)
39
29
No
26
29
(39 observations deleted)
29
29
(39 observations deleted)
30
29
(39 observations deleted)
17
29
(39 observations deleted)
36
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
11
1
No
26
29
(39 observations deleted)
19
29
(39 observations deleted)
39
29
No
25
29
(39 observations deleted)
38
29
(39 observations deleted)
14
29
(39 observations deleted)
36
29
(39 observations deleted)
21
29
(39 observations deleted)
13
29
(39 observations deleted)
25
29
(39 observations deleted)
27
29
(39 observations deleted)
39
29
No
11
29
(39 observations deleted)
39
29
No
16
29
(39 observations deleted)
39
29
No
39
29
No
0
29
(39 observations deleted)
38
29
(39 observations deleted)
10
29
(39 observations deleted)
39
29
No
29
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
26
29
(39 observations deleted)
23
29
(39 observations deleted)
39
29
No
30
29
(39 observations deleted)
39
29
No
24
29
(39 observations deleted)
0
29
(39 observations deleted)
24
29
(39 observations deleted)
27
29
(39 observations deleted)
21
29
(39 observations deleted)
{res}{txt}(808 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_52_.dta saved
event_55_
0
19
(29 observations deleted)
29
19
No
26
19
(29 observations deleted)
27
19
(29 observations deleted)
17
19
(29 observations deleted)
28
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
19
19
(29 observations deleted)
11
1
No
29
19
No
28
19
(29 observations deleted)
14
19
(29 observations deleted)
29
19
No
21
19
(29 observations deleted)
13
19
(29 observations deleted)
27
19
(29 observations deleted)
11
19
(29 observations deleted)
29
19
No
16
19
(29 observations deleted)
29
19
No
0
19
(29 observations deleted)
28
19
(29 observations deleted)
10
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
23
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
24
19
(29 observations deleted)
0
19
(29 observations deleted)
24
19
(29 observations deleted)
27
19
(29 observations deleted)
21
19
(29 observations deleted)
{res}{txt}(598 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_55_.dta saved
event_62_
0
16
(26 observations deleted)
26
16
No
26
16
No
24
16
(26 observations deleted)
17
16
(26 observations deleted)
25
16
(26 observations deleted)
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
19
16
(26 observations deleted)
26
16
No
11
1
No
25
16
(26 observations deleted)
14
16
(26 observations deleted)
26
16
No
21
16
(26 observations deleted)
13
16
(26 observations deleted)
26
16
No
11
16
(26 observations deleted)
26
16
No
16
16
(26 observations deleted)
26
16
No
0
16
(26 observations deleted)
25
16
(26 observations deleted)
10
16
(26 observations deleted)
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
26
16
No
23
16
(26 observations deleted)
26
16
No
26
16
No
26
16
No
24
16
(26 observations deleted)
0
16
(26 observations deleted)
24
16
(26 observations deleted)
26
16
No
21
16
(26 observations deleted)
{res}{txt}(660 observations deleted)
(26 real changes made)
(26 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_62_.dta saved
event_65_
0
36
(46 observations deleted)
46
36
No
26
36
(46 observations deleted)
29
36
(46 observations deleted)
30
36
(46 observations deleted)
17
36
(46 observations deleted)
36
36
(46 observations deleted)
46
36
No
46
36
No
46
36
No
46
36
No
46
36
No
21
36
(46 observations deleted)
41
36
(46 observations deleted)
46
36
No
20
36
(46 observations deleted)
46
36
No
26
36
(46 observations deleted)
19
36
(46 observations deleted)
46
36
No
11
1
No
25
36
(46 observations deleted)
46
36
No
45
36
(46 observations deleted)
14
36
(46 observations deleted)
36
36
(46 observations deleted)
21
36
(46 observations deleted)
46
36
No
13
36
(46 observations deleted)
25
36
(46 observations deleted)
27
36
(46 observations deleted)
46
36
No
11
36
(46 observations deleted)
46
36
No
16
36
(46 observations deleted)
46
36
No
46
36
No
46
36
No
0
36
(46 observations deleted)
45
36
(46 observations deleted)
10
36
(46 observations deleted)
46
36
No
29
36
(46 observations deleted)
43
36
(46 observations deleted)
46
36
No
0
36
(46 observations deleted)
46
36
No
46
36
No
41
36
(46 observations deleted)
46
36
No
26
36
(46 observations deleted)
23
36
(46 observations deleted)
46
36
No
30
36
(46 observations deleted)
46
36
No
24
36
(46 observations deleted)
0
36
(46 observations deleted)
24
36
(46 observations deleted)
27
36
(46 observations deleted)
21
36
(46 observations deleted)
{res}{txt}(1,045 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_65_.dta saved
event_66_
0
27
(37 observations deleted)
37
27
No
26
27
(37 observations deleted)
29
27
(37 observations deleted)
30
27
(37 observations deleted)
17
27
(37 observations deleted)
36
27
(37 observations deleted)
37
27
No
37
27
No
37
27
No
37
27
No
37
27
No
37
27
No
26
27
(37 observations deleted)
19
27
(37 observations deleted)
37
27
No
8
1
(11 observations deleted)
25
27
(37 observations deleted)
36
27
(37 observations deleted)
14
27
(37 observations deleted)
36
27
(37 observations deleted)
21
27
(37 observations deleted)
13
27
(37 observations deleted)
25
27
(37 observations deleted)
27
27
(37 observations deleted)
11
27
(37 observations deleted)
37
27
No
16
27
(37 observations deleted)
37
27
No
37
27
No
0
27
(37 observations deleted)
36
27
(37 observations deleted)
10
27
(37 observations deleted)
37
27
No
29
27
(37 observations deleted)
37
27
No
37
27
No
37
27
No
37
27
No
37
27
No
26
27
(37 observations deleted)
23
27
(37 observations deleted)
37
27
No
30
27
(37 observations deleted)
37
27
No
24
27
(37 observations deleted)
0
27
(37 observations deleted)
24
27
(37 observations deleted)
27
27
(37 observations deleted)
21
27
(37 observations deleted)
{res}{txt}(684 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_66_.dta saved
event_68_
0
1
(11 observations deleted)
11
1
No
11
1
No
9
1
(11 observations deleted)
11
1
No
10
1
(11 observations deleted)
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
10
1
(11 observations deleted)
11
1
No
11
1
No
11
1
No
8
1
(11 observations deleted)
11
1
No
10
1
(11 observations deleted)
11
1
No
11
1
No
11
1
No
0
1
(11 observations deleted)
10
1
(11 observations deleted)
10
1
(11 observations deleted)
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
11
1
No
0
1
(11 observations deleted)
11
1
No
11
1
No
11
1
No
{res}{txt}(360 observations deleted)
(35 real changes made)
(35 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_68_.dta saved
event_70_
0
19
(29 observations deleted)
29
19
No
26
19
(29 observations deleted)
27
19
(29 observations deleted)
17
19
(29 observations deleted)
28
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
19
19
(29 observations deleted)
29
19
No
11
1
No
28
19
(29 observations deleted)
14
19
(29 observations deleted)
29
19
No
21
19
(29 observations deleted)
13
19
(29 observations deleted)
27
19
(29 observations deleted)
11
19
(29 observations deleted)
29
19
No
16
19
(29 observations deleted)
29
19
No
0
19
(29 observations deleted)
28
19
(29 observations deleted)
10
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
23
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
24
19
(29 observations deleted)
0
19
(29 observations deleted)
24
19
(29 observations deleted)
27
19
(29 observations deleted)
21
19
(29 observations deleted)
{res}{txt}(598 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_70_.dta saved
event_72_
0
29
(39 observations deleted)
39
29
No
26
29
(39 observations deleted)
29
29
(39 observations deleted)
30
29
(39 observations deleted)
17
29
(39 observations deleted)
36
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
26
29
(39 observations deleted)
19
29
(39 observations deleted)
39
29
No
25
29
(39 observations deleted)
11
1
No
38
29
(39 observations deleted)
14
29
(39 observations deleted)
36
29
(39 observations deleted)
21
29
(39 observations deleted)
13
29
(39 observations deleted)
25
29
(39 observations deleted)
27
29
(39 observations deleted)
39
29
No
11
29
(39 observations deleted)
39
29
No
16
29
(39 observations deleted)
39
29
No
39
29
No
0
29
(39 observations deleted)
38
29
(39 observations deleted)
10
29
(39 observations deleted)
39
29
No
29
29
(39 observations deleted)
39
29
No
39
29
No
39
29
No
39
29
No
39
29
No
26
29
(39 observations deleted)
23
29
(39 observations deleted)
39
29
No
30
29
(39 observations deleted)
39
29
No
24
29
(39 observations deleted)
0
29
(39 observations deleted)
24
29
(39 observations deleted)
27
29
(39 observations deleted)
21
29
(39 observations deleted)
{res}{txt}(808 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_72_.dta saved
event_73_
0
21
(31 observations deleted)
31
21
No
26
21
(31 observations deleted)
29
21
(31 observations deleted)
17
21
(31 observations deleted)
30
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
19
21
(31 observations deleted)
31
21
No
11
1
No
30
21
(31 observations deleted)
14
21
(31 observations deleted)
31
21
No
21
21
(31 observations deleted)
13
21
(31 observations deleted)
27
21
(31 observations deleted)
11
21
(31 observations deleted)
31
21
No
16
21
(31 observations deleted)
31
21
No
0
21
(31 observations deleted)
30
21
(31 observations deleted)
10
21
(31 observations deleted)
31
21
No
29
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
23
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
31
21
No
24
21
(31 observations deleted)
0
21
(31 observations deleted)
24
21
(31 observations deleted)
27
21
(31 observations deleted)
21
21
(31 observations deleted)
{res}{txt}(580 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_73_.dta saved
event_76_
0
12
(22 observations deleted)
22
12
No
22
12
No
20
12
(22 observations deleted)
17
12
(22 observations deleted)
21
12
(22 observations deleted)
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
19
12
(22 observations deleted)
22
12
No
11
1
No
21
12
(22 observations deleted)
14
12
(22 observations deleted)
22
12
No
21
12
(22 observations deleted)
13
12
(22 observations deleted)
22
12
No
11
12
(22 observations deleted)
22
12
No
16
12
(22 observations deleted)
22
12
No
0
12
(22 observations deleted)
21
12
(22 observations deleted)
10
12
(22 observations deleted)
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
22
12
No
0
12
(22 observations deleted)
22
12
No
22
12
No
21
12
(22 observations deleted)
{res}{txt}(619 observations deleted)
(29 real changes made)
(29 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_76_.dta saved
event_86_
0
9
(19 observations deleted)
19
9
No
19
9
No
17
9
(19 observations deleted)
17
9
(19 observations deleted)
18
9
(19 observations deleted)
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
18
9
(19 observations deleted)
14
9
(19 observations deleted)
19
9
No
19
9
No
11
1
No
13
9
(19 observations deleted)
19
9
No
11
9
(19 observations deleted)
19
9
No
16
9
(19 observations deleted)
19
9
No
0
9
(19 observations deleted)
18
9
(19 observations deleted)
10
9
(19 observations deleted)
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
19
9
No
0
9
(19 observations deleted)
19
9
No
19
9
No
19
9
No
{res}{txt}(586 observations deleted)
(32 real changes made)
(32 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_86_.dta saved
event_88_
0
23
(33 observations deleted)
33
23
No
26
23
(33 observations deleted)
29
23
(33 observations deleted)
17
23
(33 observations deleted)
32
23
(33 observations deleted)
33
23
No
33
23
No
33
23
No
33
23
No
33
23
No
33
23
No
26
23
(33 observations deleted)
19
23
(33 observations deleted)
33
23
No
25
23
(33 observations deleted)
32
23
(33 observations deleted)
14
23
(33 observations deleted)
33
23
No
21
23
(33 observations deleted)
11
1
No
13
23
(33 observations deleted)
27
23
(33 observations deleted)
11
23
(33 observations deleted)
33
23
No
16
23
(33 observations deleted)
33
23
No
0
23
(33 observations deleted)
32
23
(33 observations deleted)
10
23
(33 observations deleted)
33
23
No
29
23
(33 observations deleted)
33
23
No
33
23
No
33
23
No
33
23
No
33
23
No
26
23
(33 observations deleted)
23
23
(33 observations deleted)
33
23
No
30
23
(33 observations deleted)
33
23
No
24
23
(33 observations deleted)
0
23
(33 observations deleted)
24
23
(33 observations deleted)
27
23
(33 observations deleted)
21
23
(33 observations deleted)
{res}{txt}(618 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_88_.dta saved
event_92_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
1
No
11
18
(28 observations deleted)
28
18
No
16
18
(28 observations deleted)
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
{res}{txt}(577 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_92_.dta saved
event_93_
0
6
(16 observations deleted)
16
6
No
16
6
No
14
6
(16 observations deleted)
16
6
No
15
6
(16 observations deleted)
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
15
6
(16 observations deleted)
14
6
(16 observations deleted)
16
6
No
16
6
No
13
6
(16 observations deleted)
16
6
No
11
1
No
11
6
(16 observations deleted)
16
6
No
16
6
No
16
6
No
0
6
(16 observations deleted)
15
6
(16 observations deleted)
10
6
(16 observations deleted)
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
16
6
No
0
6
(16 observations deleted)
16
6
No
16
6
No
16
6
No
{res}{txt}(520 observations deleted)
(34 real changes made)
(34 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_93_.dta saved
event_95_
0
7
(17 observations deleted)
17
7
No
17
7
No
15
7
(17 observations deleted)
17
7
No
16
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
16
7
(17 observations deleted)
14
7
(17 observations deleted)
17
7
No
17
7
No
13
7
(17 observations deleted)
17
7
No
11
1
No
11
7
(17 observations deleted)
17
7
No
16
7
(17 observations deleted)
17
7
No
0
7
(17 observations deleted)
16
7
(17 observations deleted)
10
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
0
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
{res}{txt}(538 observations deleted)
(33 real changes made)
(33 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_95_.dta saved
event_97_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
18
(28 observations deleted)
4
1
(11 observations deleted)
28
18
No
16
18
(28 observations deleted)
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
{res}{txt}(567 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_97_.dta saved
event_99_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
17
20
(30 observations deleted)
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
2
1
(11 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
{res}{txt}(580 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_99_.dta saved
event_101_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
11
1
No
27
17
No
16
17
(27 observations deleted)
27
17
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
{res}{txt}(608 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_101_.dta saved
event_104_
0
19
(29 observations deleted)
29
19
No
26
19
(29 observations deleted)
27
19
(29 observations deleted)
17
19
(29 observations deleted)
28
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
19
19
(29 observations deleted)
29
19
No
28
19
(29 observations deleted)
14
19
(29 observations deleted)
29
19
No
21
19
(29 observations deleted)
13
19
(29 observations deleted)
27
19
(29 observations deleted)
11
19
(29 observations deleted)
29
19
No
16
19
(29 observations deleted)
11
1
No
29
19
No
0
19
(29 observations deleted)
28
19
(29 observations deleted)
10
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
23
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
24
19
(29 observations deleted)
0
19
(29 observations deleted)
24
19
(29 observations deleted)
27
19
(29 observations deleted)
21
19
(29 observations deleted)
{res}{txt}(598 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_104_.dta saved
event_108_
0
14
(24 observations deleted)
24
14
No
24
14
No
22
14
(24 observations deleted)
17
14
(24 observations deleted)
23
14
(24 observations deleted)
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
19
14
(24 observations deleted)
24
14
No
23
14
(24 observations deleted)
14
14
(24 observations deleted)
24
14
No
21
14
(24 observations deleted)
13
14
(24 observations deleted)
24
14
No
11
14
(24 observations deleted)
24
14
No
16
14
(24 observations deleted)
11
1
No
24
14
No
0
14
(24 observations deleted)
23
14
(24 observations deleted)
10
14
(24 observations deleted)
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
24
14
No
23
14
(24 observations deleted)
24
14
No
24
14
No
24
14
No
24
14
No
0
14
(24 observations deleted)
24
14
No
24
14
No
21
14
(24 observations deleted)
{res}{txt}(654 observations deleted)
(28 real changes made)
(28 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_108_.dta saved
event_109_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
27
17
No
16
17
(27 observations deleted)
11
1
No
27
17
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
{res}{txt}(608 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_109_.dta saved
event_110_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
18
(28 observations deleted)
28
18
No
16
18
(28 observations deleted)
11
1
No
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
{res}{txt}(577 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_110_.dta saved
event_112_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
27
17
No
16
17
(27 observations deleted)
27
17
No
11
1
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
{res}{txt}(608 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_112_.dta saved
event_119_
0
21
(31 observations deleted)
31
21
No
26
21
(31 observations deleted)
29
21
(31 observations deleted)
17
21
(31 observations deleted)
30
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
19
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
14
21
(31 observations deleted)
31
21
No
21
21
(31 observations deleted)
13
21
(31 observations deleted)
27
21
(31 observations deleted)
11
21
(31 observations deleted)
31
21
No
16
21
(31 observations deleted)
31
21
No
11
1
No
0
21
(31 observations deleted)
30
21
(31 observations deleted)
10
21
(31 observations deleted)
31
21
No
29
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
23
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
31
21
No
24
21
(31 observations deleted)
0
21
(31 observations deleted)
24
21
(31 observations deleted)
27
21
(31 observations deleted)
21
21
(31 observations deleted)
{res}{txt}(580 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_119_.dta saved
event_127_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
27
17
No
16
17
(27 observations deleted)
27
17
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
11
1
No
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
{res}{txt}(608 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_127_.dta saved
event_129_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
18
(28 observations deleted)
28
18
No
16
18
(28 observations deleted)
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
11
1
No
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
{res}{txt}(577 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_129_.dta saved
event_131_
0
24
(34 observations deleted)
34
24
No
26
24
(34 observations deleted)
29
24
(34 observations deleted)
30
24
(34 observations deleted)
17
24
(34 observations deleted)
33
24
(34 observations deleted)
34
24
No
34
24
No
34
24
No
34
24
No
34
24
No
34
24
No
26
24
(34 observations deleted)
19
24
(34 observations deleted)
34
24
No
25
24
(34 observations deleted)
33
24
(34 observations deleted)
14
24
(34 observations deleted)
34
24
No
21
24
(34 observations deleted)
13
24
(34 observations deleted)
27
24
(34 observations deleted)
11
24
(34 observations deleted)
34
24
No
16
24
(34 observations deleted)
34
24
No
0
24
(34 observations deleted)
33
24
(34 observations deleted)
11
1
No
10
24
(34 observations deleted)
34
24
No
29
24
(34 observations deleted)
34
24
No
34
24
No
34
24
No
34
24
No
34
24
No
26
24
(34 observations deleted)
23
24
(34 observations deleted)
34
24
No
30
24
(34 observations deleted)
34
24
No
24
24
(34 observations deleted)
0
24
(34 observations deleted)
24
24
(34 observations deleted)
27
24
(34 observations deleted)
21
24
(34 observations deleted)
{res}{txt}(637 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_131_.dta saved
event_132_
0
21
(31 observations deleted)
31
21
No
26
21
(31 observations deleted)
29
21
(31 observations deleted)
17
21
(31 observations deleted)
30
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
19
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
14
21
(31 observations deleted)
31
21
No
21
21
(31 observations deleted)
13
21
(31 observations deleted)
27
21
(31 observations deleted)
11
21
(31 observations deleted)
31
21
No
16
21
(31 observations deleted)
31
21
No
0
21
(31 observations deleted)
30
21
(31 observations deleted)
1
1
(11 observations deleted)
10
21
(31 observations deleted)
31
21
No
29
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
23
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
31
21
No
24
21
(31 observations deleted)
0
21
(31 observations deleted)
24
21
(31 observations deleted)
27
21
(31 observations deleted)
21
21
(31 observations deleted)
{res}{txt}(570 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_132_.dta saved
event_133_
0
35
(45 observations deleted)
45
35
No
26
35
(45 observations deleted)
29
35
(45 observations deleted)
30
35
(45 observations deleted)
17
35
(45 observations deleted)
36
35
(45 observations deleted)
45
35
No
45
35
No
45
35
No
45
35
No
45
35
No
21
35
(45 observations deleted)
41
35
(45 observations deleted)
45
35
No
20
35
(45 observations deleted)
45
35
No
26
35
(45 observations deleted)
19
35
(45 observations deleted)
45
35
No
25
35
(45 observations deleted)
45
35
No
44
35
(45 observations deleted)
14
35
(45 observations deleted)
36
35
(45 observations deleted)
21
35
(45 observations deleted)
45
35
No
13
35
(45 observations deleted)
25
35
(45 observations deleted)
27
35
(45 observations deleted)
45
35
No
11
35
(45 observations deleted)
45
35
No
16
35
(45 observations deleted)
45
35
No
45
35
No
45
35
No
0
35
(45 observations deleted)
44
35
(45 observations deleted)
11
1
No
10
35
(45 observations deleted)
45
35
No
29
35
(45 observations deleted)
43
35
(45 observations deleted)
45
35
No
0
35
(45 observations deleted)
45
35
No
45
35
No
41
35
(45 observations deleted)
45
35
No
26
35
(45 observations deleted)
23
35
(45 observations deleted)
45
35
No
30
35
(45 observations deleted)
45
35
No
24
35
(45 observations deleted)
0
35
(45 observations deleted)
24
35
(45 observations deleted)
27
35
(45 observations deleted)
21
35
(45 observations deleted)
{res}{txt}(1,022 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_133_.dta saved
event_135_
0
21
(31 observations deleted)
31
21
No
26
21
(31 observations deleted)
29
21
(31 observations deleted)
17
21
(31 observations deleted)
30
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
19
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
14
21
(31 observations deleted)
31
21
No
21
21
(31 observations deleted)
13
21
(31 observations deleted)
27
21
(31 observations deleted)
11
21
(31 observations deleted)
31
21
No
16
21
(31 observations deleted)
31
21
No
0
21
(31 observations deleted)
30
21
(31 observations deleted)
10
21
(31 observations deleted)
11
1
No
31
21
No
29
21
(31 observations deleted)
31
21
No
31
21
No
31
21
No
31
21
No
31
21
No
26
21
(31 observations deleted)
23
21
(31 observations deleted)
31
21
No
30
21
(31 observations deleted)
31
21
No
24
21
(31 observations deleted)
0
21
(31 observations deleted)
24
21
(31 observations deleted)
27
21
(31 observations deleted)
21
21
(31 observations deleted)
{res}{txt}(580 observations deleted)
(19 real changes made)
(19 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_135_.dta saved
event_140_
0
11
(21 observations deleted)
21
11
No
21
11
No
19
11
(21 observations deleted)
17
11
(21 observations deleted)
20
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
19
11
(21 observations deleted)
21
11
No
20
11
(21 observations deleted)
14
11
(21 observations deleted)
21
11
No
21
11
No
13
11
(21 observations deleted)
21
11
No
11
11
(21 observations deleted)
21
11
No
16
11
(21 observations deleted)
21
11
No
0
11
(21 observations deleted)
20
11
(21 observations deleted)
10
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
11
1
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
0
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
{res}{txt}(630 observations deleted)
(31 real changes made)
(31 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_140_.dta saved
event_141_
0
11
(21 observations deleted)
21
11
No
21
11
No
19
11
(21 observations deleted)
17
11
(21 observations deleted)
20
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
19
11
(21 observations deleted)
21
11
No
20
11
(21 observations deleted)
14
11
(21 observations deleted)
21
11
No
21
11
No
13
11
(21 observations deleted)
21
11
No
11
11
(21 observations deleted)
21
11
No
16
11
(21 observations deleted)
21
11
No
0
11
(21 observations deleted)
20
11
(21 observations deleted)
10
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
0
1
(11 observations deleted)
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
21
11
No
0
11
(21 observations deleted)
21
11
No
21
11
No
21
11
No
{res}{txt}(620 observations deleted)
(31 real changes made)
(31 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_141_.dta saved
event_145_
0
18
(28 observations deleted)
28
18
No
26
18
(28 observations deleted)
26
18
(28 observations deleted)
17
18
(28 observations deleted)
27
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
26
18
(28 observations deleted)
19
18
(28 observations deleted)
28
18
No
27
18
(28 observations deleted)
14
18
(28 observations deleted)
28
18
No
21
18
(28 observations deleted)
13
18
(28 observations deleted)
27
18
(28 observations deleted)
11
18
(28 observations deleted)
28
18
No
16
18
(28 observations deleted)
28
18
No
0
18
(28 observations deleted)
27
18
(28 observations deleted)
10
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
28
18
No
28
18
No
10
1
(11 observations deleted)
28
18
No
28
18
No
26
18
(28 observations deleted)
23
18
(28 observations deleted)
28
18
No
28
18
No
28
18
No
24
18
(28 observations deleted)
0
18
(28 observations deleted)
24
18
(28 observations deleted)
27
18
(28 observations deleted)
21
18
(28 observations deleted)
{res}{txt}(567 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_145_.dta saved
event_146_
0
19
(29 observations deleted)
29
19
No
26
19
(29 observations deleted)
27
19
(29 observations deleted)
17
19
(29 observations deleted)
28
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
19
19
(29 observations deleted)
29
19
No
28
19
(29 observations deleted)
14
19
(29 observations deleted)
29
19
No
21
19
(29 observations deleted)
13
19
(29 observations deleted)
27
19
(29 observations deleted)
11
19
(29 observations deleted)
29
19
No
16
19
(29 observations deleted)
29
19
No
0
19
(29 observations deleted)
28
19
(29 observations deleted)
10
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
3
1
(11 observations deleted)
29
19
No
29
19
No
26
19
(29 observations deleted)
23
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
24
19
(29 observations deleted)
0
19
(29 observations deleted)
24
19
(29 observations deleted)
27
19
(29 observations deleted)
21
19
(29 observations deleted)
{res}{txt}(588 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_146_.dta saved
event_147_
0
7
(17 observations deleted)
17
7
No
17
7
No
15
7
(17 observations deleted)
17
7
No
16
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
16
7
(17 observations deleted)
14
7
(17 observations deleted)
17
7
No
17
7
No
13
7
(17 observations deleted)
17
7
No
11
7
(17 observations deleted)
17
7
No
16
7
(17 observations deleted)
17
7
No
0
7
(17 observations deleted)
16
7
(17 observations deleted)
10
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
11
1
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
17
7
No
0
7
(17 observations deleted)
17
7
No
17
7
No
17
7
No
{res}{txt}(538 observations deleted)
(33 real changes made)
(33 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_147_.dta saved
event_149_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
27
17
No
16
17
(27 observations deleted)
27
17
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
11
1
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
{res}{txt}(608 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_149_.dta saved
event_150_
0
33
(43 observations deleted)
43
33
No
26
33
(43 observations deleted)
29
33
(43 observations deleted)
30
33
(43 observations deleted)
17
33
(43 observations deleted)
36
33
(43 observations deleted)
43
33
No
43
33
No
43
33
No
43
33
No
43
33
No
21
33
(43 observations deleted)
41
33
(43 observations deleted)
43
33
No
20
33
(43 observations deleted)
43
33
No
26
33
(43 observations deleted)
19
33
(43 observations deleted)
43
33
No
25
33
(43 observations deleted)
43
33
No
42
33
(43 observations deleted)
14
33
(43 observations deleted)
36
33
(43 observations deleted)
21
33
(43 observations deleted)
43
33
No
13
33
(43 observations deleted)
25
33
(43 observations deleted)
27
33
(43 observations deleted)
43
33
No
11
33
(43 observations deleted)
43
33
No
16
33
(43 observations deleted)
43
33
No
43
33
No
0
33
(43 observations deleted)
42
33
(43 observations deleted)
10
33
(43 observations deleted)
43
33
No
29
33
(43 observations deleted)
43
33
No
43
33
No
0
33
(43 observations deleted)
43
33
No
43
33
No
11
1
No
41
33
(43 observations deleted)
43
33
No
26
33
(43 observations deleted)
23
33
(43 observations deleted)
43
33
No
30
33
(43 observations deleted)
43
33
No
24
33
(43 observations deleted)
0
33
(43 observations deleted)
24
33
(43 observations deleted)
27
33
(43 observations deleted)
21
33
(43 observations deleted)
{res}{txt}(976 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_150_.dta saved
event_161_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
17
20
(30 observations deleted)
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
0
1
(11 observations deleted)
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
{res}{txt}(580 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_161_.dta saved
event_162_
0
19
(29 observations deleted)
29
19
No
26
19
(29 observations deleted)
27
19
(29 observations deleted)
17
19
(29 observations deleted)
28
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
26
19
(29 observations deleted)
19
19
(29 observations deleted)
29
19
No
28
19
(29 observations deleted)
14
19
(29 observations deleted)
29
19
No
21
19
(29 observations deleted)
13
19
(29 observations deleted)
27
19
(29 observations deleted)
11
19
(29 observations deleted)
29
19
No
16
19
(29 observations deleted)
29
19
No
0
19
(29 observations deleted)
28
19
(29 observations deleted)
10
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
29
19
No
0
1
(11 observations deleted)
26
19
(29 observations deleted)
23
19
(29 observations deleted)
29
19
No
29
19
No
29
19
No
24
19
(29 observations deleted)
0
19
(29 observations deleted)
24
19
(29 observations deleted)
27
19
(29 observations deleted)
21
19
(29 observations deleted)
{res}{txt}(588 observations deleted)
(21 real changes made)
(21 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_162_.dta saved
event_173_
0
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
25
17
(27 observations deleted)
17
17
(27 observations deleted)
26
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
19
17
(27 observations deleted)
27
17
No
26
17
(27 observations deleted)
14
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
13
17
(27 observations deleted)
27
17
No
11
17
(27 observations deleted)
27
17
No
16
17
(27 observations deleted)
27
17
No
0
17
(27 observations deleted)
26
17
(27 observations deleted)
10
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
27
17
No
26
17
(27 observations deleted)
23
17
(27 observations deleted)
27
17
No
27
17
No
27
17
No
24
17
(27 observations deleted)
8
1
(11 observations deleted)
0
17
(27 observations deleted)
24
17
(27 observations deleted)
27
17
No
21
17
(27 observations deleted)
{res}{txt}(598 observations deleted)
(23 real changes made)
(23 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_173_.dta saved
event_177_
0
26
(36 observations deleted)
36
26
No
26
26
(36 observations deleted)
29
26
(36 observations deleted)
30
26
(36 observations deleted)
17
26
(36 observations deleted)
35
26
(36 observations deleted)
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
26
26
(36 observations deleted)
19
26
(36 observations deleted)
36
26
No
25
26
(36 observations deleted)
35
26
(36 observations deleted)
14
26
(36 observations deleted)
36
26
No
21
26
(36 observations deleted)
13
26
(36 observations deleted)
27
26
(36 observations deleted)
11
26
(36 observations deleted)
36
26
No
16
26
(36 observations deleted)
36
26
No
36
26
No
0
26
(36 observations deleted)
35
26
(36 observations deleted)
10
26
(36 observations deleted)
36
26
No
29
26
(36 observations deleted)
36
26
No
36
26
No
36
26
No
36
26
No
36
26
No
26
26
(36 observations deleted)
23
26
(36 observations deleted)
36
26
No
30
26
(36 observations deleted)
36
26
No
24
26
(36 observations deleted)
0
26
(36 observations deleted)
11
1
No
24
26
(36 observations deleted)
27
26
(36 observations deleted)
21
26
(36 observations deleted)
{res}{txt}(710 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_177_.dta saved
event_183_
0
20
(30 observations deleted)
30
20
No
26
20
(30 observations deleted)
28
20
(30 observations deleted)
17
20
(30 observations deleted)
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
19
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
14
20
(30 observations deleted)
30
20
No
21
20
(30 observations deleted)
13
20
(30 observations deleted)
27
20
(30 observations deleted)
11
20
(30 observations deleted)
30
20
No
16
20
(30 observations deleted)
30
20
No
0
20
(30 observations deleted)
29
20
(30 observations deleted)
10
20
(30 observations deleted)
30
20
No
29
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
30
20
No
30
20
No
26
20
(30 observations deleted)
23
20
(30 observations deleted)
30
20
No
30
20
No
30
20
No
24
20
(30 observations deleted)
0
20
(30 observations deleted)
24
20
(30 observations deleted)
27
20
(30 observations deleted)
21
20
(30 observations deleted)
11
1
No
{res}{txt}(590 observations deleted)
(20 real changes made)
(20 real changes made)
file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_event_183_.dta saved

{com}. 
. 
. //// Get weights and merge with events ////
> use DDCG_with_events, clear 
{txt}
{com}. xtset countrynum year
{res}{txt}{col 8}panel variable:  {res}countrynum (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1960 to 2010
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. foreach var of varlist  event_*{c -(}
{txt}  2{com}. preserve
{txt}  3{com}. quiet su year if `var'==1
{txt}  4{com}. local t0 = r(mean)
{txt}  5{com}. sca t0= r(mean)
{txt}  6{com}. sca t10=t0-10
{txt}  7{com}. sca t15=t0-15
{txt}  8{com}. quiet su countrynum if `var'== 1
{txt}  9{com}. sca tcountry=r(mean)
{txt} 10{com}. replace `var'=1 if `var'==. & countrynum==tcountry
{txt} 11{com}. quietly drop if `var'==.
{txt} 12{com}. quietly drop if year<t10 // Critical 1
{txt} 13{com}. egen countrynum2=group(country_name)
{txt} 14{com}. order countrynum2 
{txt} 15{com}. quiet su countrynum2 
{txt} 16{com}. local mincountry=r(min)
{txt} 17{com}. local maxcountry=r(max)
{txt} 18{com}. forvalues i=`mincountry'/`maxcountry'{c -(}
{txt} 19{com}. quiet su year if countrynum2==`i'
{txt} 20{com}. local N=r(N)
{txt} 21{com}. local N5= `N'-10 // Critical 2
{txt} 22{com}. quiet su y if countrynum2==`i'
{txt} 23{com}. if r(N)<`N' {c -(}
{txt} 24{com}. quietly drop if countrynum2==`i' 
{txt} 25{com}. {c )-}
{txt} 26{com}. else{c -(}
{txt} 27{com}. {c )-}
{txt} 28{com}. {c )-}
{txt} 29{com}. */
. forvalues k=1/10{c -(}
{txt} 30{com}. local t`k'=t0-`k'
{txt} 31{com}. {c )-}
{txt} 32{com}. local t0=t0
{txt} 33{com}. local tcountry=tcountry
{txt} 34{com}. //Controls must have y data for at least 10 years before treatment
. cap: quiet synth y  y(`t1') y(`t2') y(`t3') y(`t4'), trunit(`tcountry')  trperiod(`t0') keep("$auxdata/s1_`var'", replace) 
{txt} 35{com}. if _rc==0{c -(}
{txt} 36{com}. use "$auxdata/s1_`var'.dta", clear
{txt} 37{com}. rename _Co_Number countrynum   
{txt} 38{com}. rename _W_Weight weight 
{txt} 39{com}. quietly keep countrynum weight
{txt} 40{com}. quietly drop if countrynum==. & weight==.
{txt} 41{com}. quietly merge 1:1 countrynum using "$auxdata/synth_`var'.dta"
{txt} 42{com}. quietly drop _merge 
{txt} 43{com}. save "$auxdata/synth_weight_`var'.dta", replace
{txt} 44{com}. {c )-}
{txt} 45{com}. else{c -(}
{txt} 46{com}. di "s1 didn't run `var'"
{txt} 47{com}. {c )-}
{txt} 48{com}. restore
{txt} 49{com}. {c )-}
{txt}(19 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_18_.dta saved
(2 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_19_.dta saved
(28 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_20_.dta saved
(25 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_23_.dta saved
(19 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_25_.dta saved
(7 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_27_.dta saved
(19 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_31_.dta saved
(20 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_34_.dta saved
(10 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_41_.dta saved
(36 real changes made)
s1 didn't run event_43_
(17 real changes made)
s1 didn't run event_44_
(32 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_49_.dta saved
(31 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_50_.dta saved
(28 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_52_.dta saved
(18 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_55_.dta saved
(15 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_62_.dta saved
(35 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_65_.dta saved
(26 real changes made)
s1 didn't run event_66_
(0 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_68_.dta saved
(18 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_70_.dta saved
(28 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_72_.dta saved
(20 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_73_.dta saved
(11 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_76_.dta saved
(8 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_86_.dta saved
(22 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_88_.dta saved
(17 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_92_.dta saved
(5 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_93_.dta saved
(6 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_95_.dta saved
(17 real changes made)
s1 didn't run event_97_
(19 real changes made)
s1 didn't run event_99_
(16 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_101_.dta saved
(18 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_104_.dta saved
(13 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_108_.dta saved
(16 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_109_.dta saved
(17 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_110_.dta saved
(16 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_112_.dta saved
(20 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_119_.dta saved
(16 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_127_.dta saved
(17 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_129_.dta saved
(23 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_131_.dta saved
(20 real changes made)
s1 didn't run event_132_
(34 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_133_.dta saved
(20 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_135_.dta saved
(10 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_140_.dta saved
(10 real changes made)
s1 didn't run event_141_
(17 real changes made)
s1 didn't run event_145_
(18 real changes made)
s1 didn't run event_146_
(6 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_147_.dta saved
(16 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_149_.dta saved
(32 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_150_.dta saved
(19 real changes made)
s1 didn't run event_161_
(18 real changes made)
s1 didn't run event_162_
(16 real changes made)
s1 didn't run event_173_
(25 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_177_.dta saved
(19 real changes made)
{res}{txt}file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/auxdata/synth_weight_event_183_.dta saved

{com}. /////
> /// Repeat for S2 with 10 pre-treatment outcomes as predictors (couldn't) find a way to do it more economically
> use DDCG_with_events, clear 
{txt}
{com}. xtset countrynum year
{res}{txt}{col 8}panel variable:  {res}countrynum (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1960 to 2010
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. foreach var of varlist  event_*{c -(}
{txt}  2{com}. preserve
{txt}  3{com}. quiet su year if `var'==1
{txt}  4{com}. local t0 = r(mean)
{txt}  5{com}. sca t0= r(mean)
{txt}  6{com}. sca t10=t0-10
{txt}  7{com}. sca t15=t0-15
{txt}  8{com}. quiet su countrynum if `var'== 1
{txt}  9{com}. sca tcountry=r(mean)
{txt} 10{com}. replace `var'=1 if `var'==. & countrynum==tcountry
{txt} 11{com}. quietly drop if `var'==.
{txt} 12{com}. quietly drop if year<t10 // Critical 1
{txt} 13{com}. egen countrynum2=group(country_name)
{txt} 14{com}. order countrynum2 
{txt} 15{com}. quiet su countrynum2 
{txt} 16{com}. local mincountry=r(min)
{txt} 17{com}. local maxcountry=r(max)
{txt} 18{com}. forvalues i=`mincountry'/`maxcountry'{c -(}
{txt} 19{com}. quiet su year if countrynum2==`i'
{txt} 20{com}. local N=r(N)
{txt} 21{com}. local N5= `N'-10 // Critical 2
{txt} 22{com}. quiet su y if countrynum2==`i'
{txt} 23{com}. if r(N)<`N5' {c -(}
{txt} 24{com}. quietly drop if countrynum2==`i' 
{txt} 25{com}. {c )-}
{txt} 26{com}. else{c -(}
{txt} 27{com}. {c )-}
{txt} 28{com}. {c )-}
{txt} 29{com}. */
. forvalues k=1/10{c -(}
{txt} 30{com}. local t`k'=t0-`k'
{txt} 31{com}. {c )-}
{txt} 32{com}. local t0=t0
{txt} 33{com}. local tcountry=tcountry
{txt} 34{com}. //Controls must have y data for at least 10 years before treatment
. cap: quiet  synth  y y(`t1') y(`t2') y(`t3') y(`t4') y(`t5') y(`t6') y(`t7') y(`t8') y(`t9') y(`t10') , trunit(`tcountry')  trperiod(`t0') keep("$auxdata/s2_`var'", replace) 
{txt} 35{com}. if _rc==0{c -(}
{txt} 36{com}. di "s2 did run `var'"
{txt} 37{com}. use "$auxdata/s2_`var'", clear
{txt} 38{com}. rename _Co_Number countrynum   
{txt} 39{com}. rename _W_Weight weight 
{txt} 40{com}. quietly keep countrynum weight
{txt} 41{com}. quietly drop if countrynum==. & weight==.
{txt} 42{com}. quietly merge 1:1 countrynum using "$auxdata/synth_`var'.dta"
{txt} 43{com}. quietly drop _merge 
{txt} 44{com}. save "$auxdata/synth2_weight_`var'.dta", replace 
{txt} 45{com}. {c )-}
{txt} 46{com}. else{c -(}
{txt} 47{com}. di "s2 didn't run `var'"
{txt} 48{com}. {c )-}
{txt} 49{com}. restore
{txt} 50{com}. {c )-}
{txt}(19 real changes made)
s2 didn't run event_18_
(2 real changes made)
s2 didn't run event_19_
(28 real changes made)
s2 didn't run event_20_
(25 real changes made)
s2 didn't run event_23_
(19 real changes made)
s2 didn't run event_25_
(7 real changes made)
s2 didn't run event_27_
(19 real changes made)
s2 didn't run event_31_
(20 real changes made)
s2 didn't run event_34_
(10 real changes made)
s2 didn't run event_41_
(36 real changes made)
s2 didn't run event_43_
(17 real changes made)
s2 didn't run event_44_
(32 real changes made)
s2 didn't run event_49_
(31 real changes made)
s2 didn't run event_50_
(28 real changes made)
s2 didn't run event_52_
(18 real changes made)
s2 didn't run event_55_
(15 real changes made)
s2 didn't run event_62_
(35 real changes made)
s2 didn't run event_65_
(26 real changes made)
s2 didn't run event_66_
(0 real changes made)
s2 didn't run event_68_
(18 real changes made)
s2 didn't run event_70_
(28 real changes made)
s2 didn't run event_72_
(20 real changes made)
s2 didn't run event_73_
(11 real changes made)
s2 didn't run event_76_
(8 real changes made)
s2 didn't run event_86_
(22 real changes made)
s2 didn't run event_88_
(17 real changes made)
s2 didn't run event_92_
(5 real changes made)
s2 didn't run event_93_
(6 real changes made)
s2 didn't run event_95_
(17 real changes made)
s2 didn't run event_97_
(19 real changes made)
s2 didn't run event_99_
(16 real changes made)
s2 didn't run event_101_
(18 real changes made)
s2 didn't run event_104_
(13 real changes made)
s2 didn't run event_108_
(16 real changes made)
s2 didn't run event_109_
(17 real changes made)
s2 didn't run event_110_
(16 real changes made)
s2 didn't run event_112_
(20 real changes made)
s2 didn't run event_119_
(16 real changes made)
s2 didn't run event_127_
(17 real changes made)
s2 didn't run event_129_
(23 real changes made)
s2 didn't run event_131_
(20 real changes made)
s2 didn't run event_132_
(34 real changes made)
s2 didn't run event_133_
(20 real changes made)
s2 didn't run event_135_
(10 real changes made)
s2 didn't run event_140_
(10 real changes made)
s2 didn't run event_141_
(17 real changes made)
s2 didn't run event_145_
(18 real changes made)
s2 didn't run event_146_
(6 real changes made)
s2 didn't run event_147_
(16 real changes made)
s2 didn't run event_149_
(32 real changes made)
s2 didn't run event_150_
(19 real changes made)
s2 didn't run event_161_
(18 real changes made)
s2 didn't run event_162_
(16 real changes made)
s2 didn't run event_173_
(25 real changes made)
s2 didn't run event_177_
(19 real changes made)
s2 didn't run event_183_

{com}. 
. ////////////////////////////////
> //// ESTIMATE USING WEIGHTS 1///
> ////////////////////////////////
> 
. use DDCG_with_events, clear 
{txt}
{com}. foreach var of varlist event_*{c -(}
{txt}  2{com}. 
. if "`var'"=="event_18_"{c -(}
{txt}  3{com}. use "$auxdata/synth_weight_`var'.dta", clear
{txt}  4{com}. {c )-}
{txt}  5{com}. else{c -(}
{txt}  6{com}. cap: append using "$auxdata/synth_weight_`var'.dta"
{txt}  7{com}. {c )-}
{txt}  8{com}. {c )-}
{txt}
{com}. 
. foreach var of varlist synth_event_*{c -(}
{txt}  2{com}. replace `var'=0 if `var'==.
{txt}  3{com}. {c )-}
{txt}(1,053 real changes made)
(1,038 real changes made)
(1,052 real changes made)
(1,053 real changes made)
(1,053 real changes made)
(1,041 real changes made)
(1,053 real changes made)
(1,054 real changes made)
(1,042 real changes made)
(1,050 real changes made)
(1,051 real changes made)
(1,052 real changes made)
(1,052 real changes made)
(1,047 real changes made)
(1,050 real changes made)
(1,038 real changes made)
(1,052 real changes made)
(1,052 real changes made)
(1,054 real changes made)
(1,044 real changes made)
(1,041 real changes made)
(1,054 real changes made)
(1,052 real changes made)
(1,039 real changes made)
(1,040 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,045 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,050 real changes made)
(1,054 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,054 real changes made)
(1,050 real changes made)
(1,054 real changes made)
(1,042 real changes made)
(1,040 real changes made)
(1,050 real changes made)
(1,050 real changes made)
(1,053 real changes made)
(1,053 real changes made)

{com}. 
. replace weight=1 if weight==.
{txt}(43 real changes made)

{com}. //// Estimation
> 
. forvalues s=0/45{c -(}
{txt}  2{com}. quiet reg ydep`s' tdemoc lag* i.synth_event_*   [aw=weight], cluster(countrynum)
{txt}  3{com}. if `s'==0{c -(}
{txt}  4{com}. mat ests=(_b[tdemoc], r(table)[5,1],r(table)[6,1])
{txt}  5{com}. {c )-}
{txt}  6{com}. else{c -(}
{txt}  7{com}. mat ests=ests\(_b[tdemoc], r(table)[5,1],r(table)[6,1])
{txt}  8{com}. mat colnames ests="b" "ll" "ul"
{txt}  9{com}. {c )-}
{txt} 10{com}. {c )-}
{txt}
{com}. 
. svmat ests
{txt}
{com}. cap drop yad
{txt}
{com}. gen yad=. 
{txt}(1,074 missing values generated)

{com}. forvalues i=0/45{c -(}
{txt}  2{com}. local k=`i'-14
{txt}  3{com}. local j=`i'+1
{txt}  4{com}. replace yad=`k' in `j'
{txt}  5{com}. {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. 
. line ests1 yad, lcolor(black) scheme(s1color) xtitle(Years around democratization) ytitle(Change in GDP per capita log points) yline(0, lcolor(black) lpattern(dash))||line ests2 yad,  lcolor(gray) lpattern(dash)||line ests3 yad,  lcolor(gray) lpattern(dash) legend(off)
{res}{txt}
{com}. graph export "$figures/part5s1_weights.png", replace
{txt}(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part5s1_weights.png written in PNG format)

{com}. 
. ////////////////////////////////
> //// ESTIMATE USING WEIGHTS 2///
> ////////////////////////////////
> 
. 
. use DDCG_with_events, clear 
{txt}
{com}. foreach var of varlist event_*{c -(}
{txt}  2{com}. 
. if "`var'"=="event_18_"{c -(}
{txt}  3{com}. use "$auxdata/synth2_weight_`var'.dta", clear
{txt}  4{com}. {c )-}
{txt}  5{com}. else{c -(}
{txt}  6{com}. cap: append using "$auxdata/synth2_weight_`var'.dta"
{txt}  7{com}. {c )-}
{txt}  8{com}. {c )-}
{txt}
{com}. 
. foreach var of varlist synth_event_*{c -(}
{txt}  2{com}. replace `var'=0 if `var'==.
{txt}  3{com}. {c )-}
{txt}(1,053 real changes made)
(1,038 real changes made)
(1,052 real changes made)
(1,053 real changes made)
(1,053 real changes made)
(1,041 real changes made)
(1,053 real changes made)
(1,054 real changes made)
(1,042 real changes made)
(1,050 real changes made)
(1,051 real changes made)
(1,052 real changes made)
(1,052 real changes made)
(1,047 real changes made)
(1,050 real changes made)
(1,038 real changes made)
(1,052 real changes made)
(1,052 real changes made)
(1,054 real changes made)
(1,044 real changes made)
(1,041 real changes made)
(1,054 real changes made)
(1,052 real changes made)
(1,039 real changes made)
(1,040 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,045 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,050 real changes made)
(1,054 real changes made)
(1,050 real changes made)
(1,052 real changes made)
(1,054 real changes made)
(1,050 real changes made)
(1,054 real changes made)
(1,042 real changes made)
(1,040 real changes made)
(1,050 real changes made)
(1,050 real changes made)
(1,053 real changes made)
(1,053 real changes made)

{com}. 
. replace weight=1 if weight==.
{txt}(43 real changes made)

{com}. //// Estimation
> 
. forvalues s=0/45{c -(}
{txt}  2{com}. quiet reg ydep`s' tdemoc lag* i.synth_event_*   [aw=weight], cluster(countrynum)
{txt}  3{com}. if `s'==0{c -(}
{txt}  4{com}. mat ests=(_b[tdemoc], r(table)[5,1],r(table)[6,1])
{txt}  5{com}. {c )-}
{txt}  6{com}. else{c -(}
{txt}  7{com}. mat ests=ests\(_b[tdemoc], r(table)[5,1],r(table)[6,1])
{txt}  8{com}. mat colnames ests="b" "ll" "ul"
{txt}  9{com}. {c )-}
{txt} 10{com}. {c )-}
{txt}
{com}. 
. svmat ests
{txt}
{com}. cap drop yad
{txt}
{com}. gen yad=. 
{txt}(1,074 missing values generated)

{com}. forvalues i=0/45{c -(}
{txt}  2{com}. local k=`i'-14
{txt}  3{com}. local j=`i'+1
{txt}  4{com}. replace yad=`k' in `j'
{txt}  5{com}. {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. 
. line ests1 yad, lcolor(black) scheme(s1color) xtitle(Years around democratization) ytitle(Change in GDP per capita log points) yline(0, lcolor(black) lpattern(dash))||line ests2 yad,  lcolor(gray) lpattern(dash)||line ests3 yad,  lcolor(gray) lpattern(dash) legend(off)
{res}{txt}
{com}. graph export "$figures/part5s2_weights.png", replace
{txt}(file C:/Users/User/Documents/GitHub/797b-problem-sets/DDCG_Replication/figures/part5s2_weights.png written in PNG format)

{com}. 
. 
. ********************
. ****** PART 6*******
. ********************
. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\User\Documents\GitHub\797b-problem-sets\DDCG_Replication\JL_replication_final.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Dec 2020, 19:44:20
{txt}{.-}
{smcl}
{txt}{sf}{ul off}